#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_Hair_SCIEL_MessyBun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_Hair_SCIEL_MessyBun.ABP_PostProcess_Hair_SCIEL_MessyBun_C
// 0x10E00 (0x11170 - 0x0370)
class UABP_PostProcess_Hair_SCIEL_MessyBun_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0388(0x0020)()
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0x03B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x0B50(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x12F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x1A90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x2230(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x29D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x3170(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x3910(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x40B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x4850(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x4FF0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x5790(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x5F30(0x07A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x66D0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x66F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x6E90(0x07A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x7630(0x00B8)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0x76E8(0x0168)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x7850(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x7FF0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x8790(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x8F30(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x96D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x9E70(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0xA610(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0xADB0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0xB550(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0xBCF0(0x07A0)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0xC490(0x0520)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0xC9B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0xD150(0x07A0)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0xD8F0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0xDE10(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0xE330(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0xE850(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0xED70(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0xF290(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0xF7B0(0x0520)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xFCD0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0xFCF0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x10210(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x10730(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x10C50(0x0520)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_0029AD984562DC8B4DB870A0064E6A89();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_016080364EE9D18CC3ED279D0E871334();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_16E866C349A90863FDDB508F8B0740AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_1AEE69D24D93BC3AA38078B67EBCC674();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_1DBAEB3941A030B6395B089A65E1F4C7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_1FE49D334F32BC6B1073E58DB0DAC5E9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_201EE5334DF982798D1D90B6505C60B7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_2D996AB246EC3D6D29A2768203D73AD1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_55505FA34AA222F847164F867F90571A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_69E2891B4B73BD596A1355A00F3B19BE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_86B36BE6422689A72F7F52951E5E2212();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_89B00D45480F8814B084C48C13FE7578();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_8D8D2C9F46E8A9FE778172A7A07CC36A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_972314754FD14F86E2A399BFD4769C99();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_9F9854974D5615C4FAE7A58E231C41F6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_A56AD06B489A2EBAF13C8BBFC04BFA46();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_AE46290F418C21A928618AB762328C54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_B07662BC4028B1F78A1811837D023E21();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_BE4A92624DAB9E0F009AACBE74C84EB3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_C5C9E33C45357E218EF2D2A8B8216C9E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_CA5CCEB147B0AFACE5FF1793BB198B7F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_D0E7CAE14A35217D710B8F8BF93589A4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_E09056DF4F6B3F681DEE24B4E9CB9EFC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_E3EFB6BD42F58672F336BBBE4CA0F8EA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_E59135FE4369FD97832F5096BC1F26E5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_E9F689CA4214B1EAC18FF59CBA2D031F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun_AnimGraphNode_KawaiiPhysics_F90441FC47111917EE72F2A4EACDF1DA();
	void ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_MessyBun(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_Hair_SCIEL_MessyBun_C">();
	}
	static class UABP_PostProcess_Hair_SCIEL_MessyBun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_Hair_SCIEL_MessyBun_C>();
	}
};
static_assert(alignof(UABP_PostProcess_Hair_SCIEL_MessyBun_C) == 0x000010, "Wrong alignment on UABP_PostProcess_Hair_SCIEL_MessyBun_C");
static_assert(sizeof(UABP_PostProcess_Hair_SCIEL_MessyBun_C) == 0x011170, "Wrong size on UABP_PostProcess_Hair_SCIEL_MessyBun_C");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_ComponentToLocalSpace) == 0x000388, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_26) == 0x0003B0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_26' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_25) == 0x000B50, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_24) == 0x0012F0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_23) == 0x001A90, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_22) == 0x002230, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_21) == 0x0029D0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_20) == 0x003170, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_19) == 0x003910, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_18) == 0x0040B0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_17) == 0x004850, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_16) == 0x004FF0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_15) == 0x005790, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_14) == 0x005F30, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_LocalToComponentSpace) == 0x0066D0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_13) == 0x0066F0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_12) == 0x006E90, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_LinkedInputPose) == 0x007630, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_SpringBone) == 0x0076E8, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_SpringBone' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_11) == 0x007850, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_10) == 0x007FF0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_9) == 0x008790, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_8) == 0x008F30, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_7) == 0x0096D0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_6) == 0x009E70, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_5) == 0x00A610, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_4) == 0x00ADB0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_3) == 0x00B550, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_2) == 0x00BCF0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_AnimDynamics_11) == 0x00C490, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics_1) == 0x00C9B0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_KawaiiPhysics) == 0x00D150, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_AnimDynamics_10) == 0x00D8F0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_AnimDynamics_9) == 0x00DE10, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_AnimDynamics_8) == 0x00E330, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_AnimDynamics_7) == 0x00E850, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_AnimDynamics_6) == 0x00ED70, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_AnimDynamics_5) == 0x00F290, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_AnimDynamics_4) == 0x00F7B0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_Root) == 0x00FCD0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_AnimDynamics_3) == 0x00FCF0, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_AnimDynamics_2) == 0x010210, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_AnimDynamics_1) == 0x010730, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_MessyBun_C, AnimGraphNode_AnimDynamics) == 0x010C50, "Member 'UABP_PostProcess_Hair_SCIEL_MessyBun_C::AnimGraphNode_AnimDynamics' has a wrong offset!");

}

