#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_HairVar_VERSO_Samourai

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_HairVar_VERSO_Samourai.ABP_PostProcess_HairVar_VERSO_Samourai_C
// 0xB0A0 (0xB410 - 0x0370)
class UABP_PostProcess_HairVar_VERSO_Samourai_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0388(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03A8(0x0020)()
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x03D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x0B70(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x1310(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x1AB0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x2250(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x29F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x3190(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x3930(0x07A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x40D0(0x00B8)()
	uint8                                         Pad_4188[0x8];                                     // 0x4188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x4190(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x4930(0x07A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x50D0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x50F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x5890(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x6030(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x67D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x6F70(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x7710(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x7EB0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x8650(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x8DF0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x9590(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x9D30(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0xA4D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0xAC70(0x07A0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_076C1E2941BB181C076194B72C09373C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_21CF4461432F2473B65C55AB5DFE4DA2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_3E5039454DA14ECDDF91A79C6F26C30C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_42B02A6E44FAA2D3DD53229715F8262F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_458AA86E459A85EEC2E3BFB8C393BB25();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_4AA4E33C46A1BFEEC5C98AA739C3063B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_528E664545FC66C7FA9EBDB4F78FED78();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_53FE279C49BFB42862A439BE125E3F76();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_5ACE0F4A44CD9076B43DDD8990CEB762();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_68591D4146B19A30830385B004074A23();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_834FE8F54294321236D1078C39B4A404();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_8842DB77487E51B4DAFDEFAE7D0419AE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_8EFA423742DDAA3D360693A92403B427();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_97A52DFF4D4C8C0D5F2A0DAF9A973055();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_A105E6534EB58A418E0A27B8933C2784();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_A12C32E540FE3EA62CE72FB97242F324();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_A6615DF045CC72CAD91021BC36705D8F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_BC3AD40141816220AECC5C9D50B15622();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_C34836FB4B8CF472B6CF3B94078C2E73();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_E298034D48235DDB8EC4F48382AE14A4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_F7E5C22F47364D9451774295825EB672();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_F90054364CD5D5F96773599007E19FDC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai_AnimGraphNode_KawaiiPhysics_F979DBBA451675356D62F393EF736688();
	void ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_HairVar_VERSO_Samourai_C">();
	}
	static class UABP_PostProcess_HairVar_VERSO_Samourai_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_HairVar_VERSO_Samourai_C>();
	}
};
static_assert(alignof(UABP_PostProcess_HairVar_VERSO_Samourai_C) == 0x000010, "Wrong alignment on UABP_PostProcess_HairVar_VERSO_Samourai_C");
static_assert(sizeof(UABP_PostProcess_HairVar_VERSO_Samourai_C) == 0x00B410, "Wrong size on UABP_PostProcess_HairVar_VERSO_Samourai_C");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_LocalToComponentSpace) == 0x000388, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003A8, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_22) == 0x0003D0, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_21) == 0x000B70, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_20) == 0x001310, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_19) == 0x001AB0, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_18) == 0x002250, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_17) == 0x0029F0, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_16) == 0x003190, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_15) == 0x003930, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_LinkedInputPose) == 0x0040D0, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_14) == 0x004190, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_13) == 0x004930, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_Root) == 0x0050D0, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_12) == 0x0050F0, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_11) == 0x005890, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_10) == 0x006030, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_9) == 0x0067D0, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_8) == 0x006F70, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_7) == 0x007710, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_6) == 0x007EB0, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_5) == 0x008650, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_4) == 0x008DF0, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_3) == 0x009590, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_2) == 0x009D30, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics_1) == 0x00A4D0, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_VERSO_Samourai_C, AnimGraphNode_KawaiiPhysics) == 0x00AC70, "Member 'UABP_PostProcess_HairVar_VERSO_Samourai_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

