#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_HairVar_MAELLE_Short

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_HairVar_MAELLE_Short.ABP_PostProcess_HairVar_MAELLE_Short_C
// 0x7B40 (0x7EB0 - 0x0370)
class UABP_PostProcess_HairVar_MAELLE_Short_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03A8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03C8(0x0020)()
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x03F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x0B90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x1330(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x1AD0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x2270(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x2A10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x31B0(0x07A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x3950(0x00B8)()
	uint8                                         Pad_3A08[0x8];                                     // 0x3A08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x3A10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x41B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x4950(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x50F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x5890(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x6030(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x67D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x6F70(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x7710(0x07A0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_14C3F1924A47D9F9E0CCABA136459A80();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_1B3E65BA4C0F2CAC9814739BEBC62A70();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_252046804067BF6B62D1FCB744C27400();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_2C5A486E46D0781992D031AAEC005FD6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_3F4FA5C44D956C97D9022CB54F6A4ED9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_446342FA41D1524F799714A21B3B936F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_46E5D4C4423C1EF91FFE028873E5D573();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_563EB660417D9B604E71FB836F418B23();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_920176824E05DA48E36848AE4EC4F85C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_92D3758C4616892CEE1B72A4A66DA66B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_9873311943BE1A791A1AD081B6A276C8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_B50F4A4642B4F3E492B2808B29BA7075();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_C6D523334A916A0EDE09119645E319A6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_E3489E814E43D600C655AFB961806054();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_EED1A37B4B44E165859917B8A922B512();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short_AnimGraphNode_KawaiiPhysics_F839438045C8FAA66852EEA5F55C15A1();
	void ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_Short(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_HairVar_MAELLE_Short_C">();
	}
	static class UABP_PostProcess_HairVar_MAELLE_Short_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_HairVar_MAELLE_Short_C>();
	}
};
static_assert(alignof(UABP_PostProcess_HairVar_MAELLE_Short_C) == 0x000010, "Wrong alignment on UABP_PostProcess_HairVar_MAELLE_Short_C");
static_assert(sizeof(UABP_PostProcess_HairVar_MAELLE_Short_C) == 0x007EB0, "Wrong size on UABP_PostProcess_HairVar_MAELLE_Short_C");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_LocalToComponentSpace) == 0x0003A8, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003C8, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_15) == 0x0003F0, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_14) == 0x000B90, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_13) == 0x001330, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_12) == 0x001AD0, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_11) == 0x002270, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_10) == 0x002A10, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_9) == 0x0031B0, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_LinkedInputPose) == 0x003950, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_8) == 0x003A10, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_7) == 0x0041B0, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_6) == 0x004950, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_5) == 0x0050F0, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_4) == 0x005890, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_3) == 0x006030, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_2) == 0x0067D0, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics_1) == 0x006F70, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_Short_C, AnimGraphNode_KawaiiPhysics) == 0x007710, "Member 'UABP_PostProcess_HairVar_MAELLE_Short_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

