#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_Maelle_ActeIII

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ABP_PostProcess_Maelle_ActeIII_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_Maelle_ActeIII.ABP_PostProcess_Maelle_ActeIII_C
// 0x14F30 (0x152A0 - 0x0370)
class UABP_PostProcess_Maelle_ActeIII_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_PostProcess_Maelle_ActeIII::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0378(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0390(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03B0(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0468(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0488(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x04A8(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0x0978(0x0168)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0x0AE0(0x0168)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0C48(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0C70(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_48;                     // 0x0C90(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_47;                     // 0x11B0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_46;                     // 0x16D0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_45;                     // 0x1BF0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_44;                     // 0x2110(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_43;                     // 0x2630(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_42;                     // 0x2B50(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_41;                     // 0x3070(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_40;                     // 0x3590(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_39;                     // 0x3AB0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_38;                     // 0x3FD0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_37;                     // 0x44F0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_36;                     // 0x4A10(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_35;                     // 0x4F30(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_34;                     // 0x5450(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_33;                     // 0x5970(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_32;                     // 0x5E90(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_31;                     // 0x63B0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_30;                     // 0x68D0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_29;                     // 0x6DF0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_28;                     // 0x7310(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_27;                     // 0x7830(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_26;                     // 0x7D50(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_25;                     // 0x8270(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_24;                     // 0x8790(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_23;                     // 0x8CB0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_22;                     // 0x91D0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_21;                     // 0x96F0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_20;                     // 0x9C10(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_19;                     // 0xA130(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_18;                     // 0xA650(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_17;                     // 0xAB70(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_16;                     // 0xB090(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_15;                     // 0xB5B0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_14;                     // 0xBAD0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_13;                     // 0xBFF0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_12;                     // 0xC510(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0xCA30(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0xCF50(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0xD470(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0xD990(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0xDEB0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0xE3D0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0xE8F0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0xEE10(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0xF330(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0xF850(0x0520)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xFD70(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0xFD90(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0xFDD8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0xFE00(0x0080)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0xFE80(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x103A0(0x0520)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_1;              // 0x108C0(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController;                // 0x109E8(0x0128)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_43;                       // 0x10B10(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_42;                       // 0x10CB0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_41;                       // 0x10E50(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_40;                       // 0x10FF0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_39;                       // 0x11190(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_38;                       // 0x11330(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_37;                       // 0x114D0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_36;                       // 0x11670(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_35;                       // 0x11810(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_34;                       // 0x119B0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_33;                       // 0x11B50(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_32;                       // 0x11CF0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_31;                       // 0x11E90(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_30;                       // 0x12030(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_29;                       // 0x121D0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_28;                       // 0x12370(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_27;                       // 0x12510(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_26;                       // 0x126B0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_25;                       // 0x12850(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_24;                       // 0x129F0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_23;                       // 0x12B90(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_22;                       // 0x12D30(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_21;                       // 0x12ED0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_20;                       // 0x13070(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_19;                       // 0x13210(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_18;                       // 0x133B0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_17;                       // 0x13550(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_16;                       // 0x136F0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_15;                       // 0x13890(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_14;                       // 0x13A30(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_13;                       // 0x13BD0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_12;                       // 0x13D70(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_11;                       // 0x13F10(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_10;                       // 0x140B0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_9;                        // 0x14250(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_8;                        // 0x143F0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_7;                        // 0x14590(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_6;                        // 0x14730(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_5;                        // 0x148D0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_4;                        // 0x14A70(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_3;                        // 0x14C10(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_2;                        // 0x14DB0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0x14F50(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0x150F0(0x01A0)()
	bool                                          ShouldDisablePostProcess;                          // 0x15290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_PostProcess_Maelle_ActeIII(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_Maelle_ActeIII_C">();
	}
	static class UABP_PostProcess_Maelle_ActeIII_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_Maelle_ActeIII_C>();
	}
};
static_assert(alignof(UABP_PostProcess_Maelle_ActeIII_C) == 0x000010, "Wrong alignment on UABP_PostProcess_Maelle_ActeIII_C");
static_assert(sizeof(UABP_PostProcess_Maelle_ActeIII_C) == 0x0152A0, "Wrong size on UABP_PostProcess_Maelle_ActeIII_C");
