#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_Hair_MAELLE_Ponytail

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_Hair_MAELLE_Ponytail.ABP_PostProcess_Hair_MAELLE_Ponytail_C
// 0xBFE0 (0xC350 - 0x0370)
class UABP_PostProcess_Hair_MAELLE_Ponytail_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x0390(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x0B30(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x12D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x1A70(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x2210(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x29B0(0x07A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x3150(0x00B8)()
	uint8                                         Pad_3208[0x8];                                     // 0x3208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x3210(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x39B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x4150(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x48F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x5090(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x5830(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x5FD0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x6770(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x6F10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x76B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x7E50(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x85F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x8D90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x9530(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x9CD0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0xA470(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0xAC10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0xB3B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0xBB50(0x07A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xC2F0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xC310(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xC330(0x0020)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_0B90E6534452292898FE2DA0644F431C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_0D1D7B5E4449689F6BCFC5B8E03C0D13();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_1052E42549E74D1401C380AC0A09689B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_1386DBBE4585FAF1E5849487606B55DA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_2FEB4DDF42F85E0289E5DFB7AB5BE07E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_332041B84D0B8F27D7D3E58A8C116495();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_5729CA7C4787F5D23F7E1BAE8489F4C3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_6C06E31341B7117C8F971BB04B7618E2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_7F1B84DC4EF405CAC83C02BD281B20CF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_84AF46A840982B98CB441883B4DDCC9A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_88597601459DAF0A6DC60A853AEA0481();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_9CB02E2B42EA7C17F58A8384053F1CC9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_9D11D3084A0B7E0FA00CCA8A5C4190DD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_AC4C4FE14B1403CD5A87F9B98DC0CB98();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_AD91728545C2EBE94664928D09F25123();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_B63F389642430CB7DDDA62A1FF6D12CB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_BDC47FBE482E318CE1ED909378E105D2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_C401FCF4487C9A068EA766BBD6C0686E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_CC24AC3E423209D3668B61A7A75FEE67();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_CEE4874041943BF1C76174BD5294D48D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_CEF3B9E14AF816A3D118EC8EFDB65481();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_D56271F54E997130246237B779D525A8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_E35630B842E575B115CD73990B0C534B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_E4C19B304D75A4BCC561A7BD70D13263();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail_AnimGraphNode_KawaiiPhysics_EBC580234708076B84696E8E4D1D8730();
	void ExecuteUbergraph_ABP_PostProcess_Hair_MAELLE_Ponytail(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_Hair_MAELLE_Ponytail_C">();
	}
	static class UABP_PostProcess_Hair_MAELLE_Ponytail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_Hair_MAELLE_Ponytail_C>();
	}
};
static_assert(alignof(UABP_PostProcess_Hair_MAELLE_Ponytail_C) == 0x000010, "Wrong alignment on UABP_PostProcess_Hair_MAELLE_Ponytail_C");
static_assert(sizeof(UABP_PostProcess_Hair_MAELLE_Ponytail_C) == 0x00C350, "Wrong size on UABP_PostProcess_Hair_MAELLE_Ponytail_C");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_24) == 0x000390, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_23) == 0x000B30, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_22) == 0x0012D0, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_21) == 0x001A70, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_20) == 0x002210, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_19) == 0x0029B0, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_LinkedInputPose) == 0x003150, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_18) == 0x003210, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_17) == 0x0039B0, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_16) == 0x004150, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_15) == 0x0048F0, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_14) == 0x005090, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_13) == 0x005830, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_12) == 0x005FD0, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_11) == 0x006770, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_10) == 0x006F10, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_9) == 0x0076B0, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_8) == 0x007E50, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_7) == 0x0085F0, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_6) == 0x008D90, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_5) == 0x009530, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_4) == 0x009CD0, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_3) == 0x00A470, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_2) == 0x00AC10, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics_1) == 0x00B3B0, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_KawaiiPhysics) == 0x00BB50, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_ComponentToLocalSpace) == 0x00C2F0, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_LocalToComponentSpace) == 0x00C310, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_MAELLE_Ponytail_C, AnimGraphNode_Root) == 0x00C330, "Member 'UABP_PostProcess_Hair_MAELLE_Ponytail_C::AnimGraphNode_Root' has a wrong offset!");

}

