#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_Sophie_Opti

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_Sophie_Opti.ABP_PostProcess_Sophie_Opti_C
// 0x7350 (0x76C0 - 0x0370)
class UABP_PostProcess_Sophie_Opti_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03A8(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0460(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_19;                     // 0x0480(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_18;                     // 0x09A0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_17;                     // 0x0EC0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_16;                     // 0x13E0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_15;                     // 0x1900(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_14;                     // 0x1E20(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_13;                     // 0x2340(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_12;                     // 0x2860(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0x2D80(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x32A0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x37C0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x3CE0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x4200(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x4720(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x4C40(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x5160(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x5680(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x5BA0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x60C0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x65E0(0x0520)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x6B00(0x0020)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_9;              // 0x6B20(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_8;              // 0x6C48(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_7;              // 0x6D70(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_6;              // 0x6E98(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_5;              // 0x6FC0(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_4;              // 0x70E8(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_3;              // 0x7210(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_2;              // 0x7338(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_1;              // 0x7460(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController;                // 0x7588(0x0128)()
	bool                                          ShouldDisablePostProcess;                          // 0x76B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_PostProcess_Sophie_Opti(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_Sophie_Opti_C">();
	}
	static class UABP_PostProcess_Sophie_Opti_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_Sophie_Opti_C>();
	}
};
static_assert(alignof(UABP_PostProcess_Sophie_Opti_C) == 0x000010, "Wrong alignment on UABP_PostProcess_Sophie_Opti_C");
static_assert(sizeof(UABP_PostProcess_Sophie_Opti_C) == 0x0076C0, "Wrong size on UABP_PostProcess_Sophie_Opti_C");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_Sophie_Opti_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_LinkedInputPose) == 0x0003A8, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_LocalToComponentSpace) == 0x000460, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_19) == 0x000480, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_19' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_18) == 0x0009A0, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_18' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_17) == 0x000EC0, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_17' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_16) == 0x0013E0, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_16' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_15) == 0x001900, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_14) == 0x001E20, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_13) == 0x002340, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_12) == 0x002860, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_11) == 0x002D80, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_10) == 0x0032A0, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_9) == 0x0037C0, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_8) == 0x003CE0, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_7) == 0x004200, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_6) == 0x004720, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_5) == 0x004C40, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_4) == 0x005160, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_3) == 0x005680, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_2) == 0x005BA0, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics_1) == 0x0060C0, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_AnimDynamics) == 0x0065E0, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_ComponentToLocalSpace) == 0x006B00, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_BoneDrivenController_9) == 0x006B20, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_BoneDrivenController_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_BoneDrivenController_8) == 0x006C48, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_BoneDrivenController_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_BoneDrivenController_7) == 0x006D70, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_BoneDrivenController_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_BoneDrivenController_6) == 0x006E98, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_BoneDrivenController_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_BoneDrivenController_5) == 0x006FC0, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_BoneDrivenController_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_BoneDrivenController_4) == 0x0070E8, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_BoneDrivenController_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_BoneDrivenController_3) == 0x007210, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_BoneDrivenController_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_BoneDrivenController_2) == 0x007338, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_BoneDrivenController_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_BoneDrivenController_1) == 0x007460, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_BoneDrivenController_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, AnimGraphNode_BoneDrivenController) == 0x007588, "Member 'UABP_PostProcess_Sophie_Opti_C::AnimGraphNode_BoneDrivenController' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Sophie_Opti_C, ShouldDisablePostProcess) == 0x0076B0, "Member 'UABP_PostProcess_Sophie_Opti_C::ShouldDisablePostProcess' has a wrong offset!");

}

