#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_Expeditioners_Male

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_PostProcess_Expeditioners_Male.ABP_PostProcess_Expeditioners_Male_C.AnimBlueprintGeneratedConstantData
// 0x0DEF (0x0DF0 - 0x0001)
struct ABP_PostProcess_Expeditioners_Male::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_208;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_209;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_210;                              // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0038(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                // 0x00D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_9;                // 0x0100(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_8;                // 0x0130(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_7;                // 0x0160(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_6;                // 0x0190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_5;                // 0x01C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_4;                // 0x01F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_43;                  // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_3;                // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_2;                // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_1;                // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics;                  // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_42;                  // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_11;                // 0x03D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_10;                // 0x0400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_9;                 // 0x0430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_8;                 // 0x0460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_7;                 // 0x0490(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_6;                 // 0x04C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_5;                 // 0x04F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_4;                 // 0x0520(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_3;                 // 0x0550(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_2;                 // 0x0580(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_1;                 // 0x05B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_41;                  // 0x05E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics;                   // 0x0610(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_40;                  // 0x0640(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_39;                  // 0x0670(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_38;                  // 0x06A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_37;                  // 0x06D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_36;                  // 0x0700(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_35;                  // 0x0730(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_34;                  // 0x0760(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_33;                  // 0x0790(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_32;                  // 0x07C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_31;                  // 0x07F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_30;                  // 0x0820(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_29;                  // 0x0850(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_28;                  // 0x0880(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_27;                  // 0x08B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_26;                  // 0x08E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_25;                  // 0x0910(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_24;                  // 0x0940(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_23;                  // 0x0970(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_22;                  // 0x09A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_21;                  // 0x09D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_20;                  // 0x0A00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_19;                  // 0x0A30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_18;                  // 0x0A60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_17;                  // 0x0A90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_16;                  // 0x0AC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_15;                  // 0x0AF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_14;                  // 0x0B20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_13;                  // 0x0B50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_12;                  // 0x0B80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_11;                  // 0x0BB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_10;                  // 0x0BE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_9;                   // 0x0C10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_8;                   // 0x0C40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_7;                   // 0x0C70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_6;                   // 0x0CA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_5;                   // 0x0CD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_4;                   // 0x0D00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_3;                   // 0x0D30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_2;                   // 0x0D60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver_1;                   // 0x0D90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseDriver;                     // 0x0DC0(0x0030)()
};
static_assert(alignof(ABP_PostProcess_Expeditioners_Male::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_PostProcess_Expeditioners_Male::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_PostProcess_Expeditioners_Male::FAnimBlueprintGeneratedConstantData) == 0x000DF0, "Wrong size on ABP_PostProcess_Expeditioners_Male::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_PostProcess_Expeditioners_Male::FAnimBlueprintGeneratedConstantData, __NameProperty_208) == 0x000004, "Member 'ABP_PostProcess_Expeditioners_Male::FAnimBlueprintGeneratedConstantData::__NameProperty_208' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Expeditioners_Male::FAnimBlueprintGeneratedConstantData, __NameProperty_209) == 0x00000C, "Member 'ABP_PostProcess_Expeditioners_Male::FAnimBlueprintGeneratedConstantData::__NameProperty_209' has a wrong offset!");
