#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Monoco_PostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Monoco_PostProcess.ABP_Monoco_PostProcess_C.AnimBlueprintGeneratedConstantData
// 0x0877 (0x0878 - 0x0001)
struct ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_118;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_119;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_120;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_121;                                  // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_122;                                // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_123;                                // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_124;                                // 0x002A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_125;                               // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_126;                              // 0x0040(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0060(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00E0(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x00F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0128(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0158(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                // 0x0188(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_3;                // 0x01B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_2;                // 0x01E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x0218(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics_1;                // 0x0248(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_KawaiiPhysics;                  // 0x0278(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x02A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x02D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_25;                // 0x0308(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_24;                // 0x0338(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_23;                // 0x0368(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_22;                // 0x0398(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_21;                // 0x03C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_20;                // 0x03F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_19;                // 0x0428(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_18;                // 0x0458(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_17;                // 0x0488(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BoneDrivenController_1;         // 0x04B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BoneDrivenController;           // 0x04E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x0518(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_16;                // 0x0548(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_15;                // 0x0578(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_14;                // 0x05A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_13;                // 0x05D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_12;                // 0x0608(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_11;                // 0x0638(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_10;                // 0x0668(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_9;                 // 0x0698(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_8;                 // 0x06C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_7;                 // 0x06F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_6;                 // 0x0728(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_5;                 // 0x0758(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_4;                 // 0x0788(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_3;                 // 0x07B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_2;                 // 0x07E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_1;                 // 0x0818(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics;                   // 0x0848(0x0030)()
};
static_assert(alignof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData) == 0x000878, "Wrong size on ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, __NameProperty_118) == 0x000004, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::__NameProperty_118' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, __NameProperty_119) == 0x00000C, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::__NameProperty_119' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, __BlendProfile_120) == 0x000018, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::__BlendProfile_120' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, __CurveFloat_121) == 0x000020, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::__CurveFloat_121' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, __BoolProperty_122) == 0x000028, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::__BoolProperty_122' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, __EnumProperty_123) == 0x000029, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::__EnumProperty_123' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, __EnumProperty_124) == 0x00002A, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::__EnumProperty_124' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, __ArrayProperty_125) == 0x000030, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::__ArrayProperty_125' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, __StructProperty_126) == 0x000040, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::__StructProperty_126' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000060, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000E0, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000F8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000128, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000158, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000188, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_3) == 0x0001B8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_2) == 0x0001E8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x000218, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics_1) == 0x000248, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_KawaiiPhysics) == 0x000278, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x0002A8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x0002D8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_25) == 0x000308, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_25' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_24) == 0x000338, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_24' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_23) == 0x000368, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_23' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_22) == 0x000398, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_22' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_21) == 0x0003C8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_21' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_20) == 0x0003F8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_20' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_19) == 0x000428, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_19' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_18) == 0x000458, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_18' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_17) == 0x000488, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_17' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BoneDrivenController_1) == 0x0004B8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BoneDrivenController_1' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BoneDrivenController) == 0x0004E8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BoneDrivenController' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000518, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_16) == 0x000548, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_16' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_15) == 0x000578, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_15' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_14) == 0x0005A8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_14' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_13) == 0x0005D8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_13' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_12) == 0x000608, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_12' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_11) == 0x000638, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_10) == 0x000668, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_9) == 0x000698, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_8) == 0x0006C8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_7) == 0x0006F8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_6) == 0x000728, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_5) == 0x000758, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_4) == 0x000788, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_3) == 0x0007B8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_2) == 0x0007E8, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics_1) == 0x000818, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData, AnimGraphNode_AnimDynamics) == 0x000848, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedConstantData::AnimGraphNode_AnimDynamics' has a wrong offset!");

// ScriptStruct ABP_Monoco_PostProcess.ABP_Monoco_PostProcess_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_Monoco_PostProcess::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_Monoco_PostProcess::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_Monoco_PostProcess::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Monoco_PostProcess::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_Monoco_PostProcess::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

