#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Sciel_PostProcess_V2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_Sciel_PostProcess_V2_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Sciel_PostProcess_V2.ABP_Sciel_PostProcess_V2_C
// 0x15600 (0x15970 - 0x0370)
class UABP_Sciel_PostProcess_V2_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Sciel_PostProcess_V2::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;     // 0x0378(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_43;                       // 0x0390(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_42;                       // 0x0530(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_41;                       // 0x06D0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_40;                       // 0x0870(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_39;                       // 0x0A10(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_38;                       // 0x0BB0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_37;                       // 0x0D50(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_36;                       // 0x0EF0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_35;                       // 0x1090(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_34;                       // 0x1230(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_33;                       // 0x13D0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_32;                       // 0x1570(0x01A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1710(0x0048)()
	uint8                                         Pad_1758[0x8];                                     // 0x1758(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x1760(0x07A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_31;                       // 0x1F00(0x01A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x20A0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x2840(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x2FE0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x3780(0x07A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_30;                       // 0x3F20(0x01A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x40C0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x4860(0x07A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x5000(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x5080(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x50A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x50D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x50F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x5120(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x5148(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x5170(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x5260(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x52A8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x52D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x52F0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x5338(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x5428(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x5450(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x5470(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x5560(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x55A8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x55D0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x55F0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x5618(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x5638(0x00C8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_29;                       // 0x5700(0x01A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x58A0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x58C8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x58E8(0x00B8)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_28;                       // 0x59A0(0x01A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x5B40(0x0020)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_27;                       // 0x5B60(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_26;                       // 0x5D00(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_25;                       // 0x5EA0(0x01A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x6040(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x6060(0x0020)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_3;                        // 0x6080(0x0168)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_2;                        // 0x61E8(0x0168)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_24;                       // 0x6350(0x01A0)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0x64F0(0x0168)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0x6658(0x0168)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_37;                     // 0x67C0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_36;                     // 0x6CE0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_35;                     // 0x7200(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_34;                     // 0x7720(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_33;                     // 0x7C40(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_32;                     // 0x8160(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_31;                     // 0x8680(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_30;                     // 0x8BA0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_29;                     // 0x90C0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_28;                     // 0x95E0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_27;                     // 0x9B00(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_26;                     // 0xA020(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_25;                     // 0xA540(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_24;                     // 0xAA60(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_23;                     // 0xAF80(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_22;                     // 0xB4A0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_21;                     // 0xB9C0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_20;                     // 0xBEE0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_19;                     // 0xC400(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_18;                     // 0xC920(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_17;                     // 0xCE40(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_16;                     // 0xD360(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_15;                     // 0xD880(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_14;                     // 0xDDA0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_13;                     // 0xE2C0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_12;                     // 0xE7E0(0x0520)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0xED00(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xF1D0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0xF1F0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0xF710(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0xFC30(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x10150(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x10670(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x10B90(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x110B0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x115D0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x11AF0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x12010(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x12530(0x0520)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_23;                       // 0x12A50(0x01A0)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x12BF0(0x0520)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_1;              // 0x13110(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController;                // 0x13238(0x0128)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_22;                       // 0x13360(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_21;                       // 0x13500(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_20;                       // 0x136A0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_19;                       // 0x13840(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_18;                       // 0x139E0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_17;                       // 0x13B80(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_16;                       // 0x13D20(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_15;                       // 0x13EC0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_14;                       // 0x14060(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_13;                       // 0x14200(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_12;                       // 0x143A0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_11;                       // 0x14540(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_10;                       // 0x146E0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_9;                        // 0x14880(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_8;                        // 0x14A20(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_7;                        // 0x14BC0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_6;                        // 0x14D60(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_5;                        // 0x14F00(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_4;                        // 0x150A0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_3;                        // 0x15240(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_2;                        // 0x153E0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0x15580(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0x15720(0x01A0)()
	struct FKawaiiPhysicsSettings                 Physics_Settings_Coat;                             // 0x158C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector                                External_Force;                                    // 0x158D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CoatShouldGoGup;                                   // 0x158F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_158F1[0x7];                                    // 0x158F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FallingVelocity;                                   // 0x158F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Pelvis;                                            // 0x15900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCharacter;                                       // 0x15908(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15909[0x7];                                    // 0x15909(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  PawnOwner;                                         // 0x15910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CharacterMesh;                                     // 0x15918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FRotator                               PreviousRotator;                                   // 0x15920(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        RotationVelocity;                                  // 0x15938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CoatTurnVelocityThreshold;                         // 0x15940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKawaiiPhysicsSettings                 Physics_Settings;                                  // 0x15948(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          ShouldDisablePostProcess;                          // 0x15960(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sciel_PostProcess_V2_AnimGraphNode_TransitionResult_17608CF84D6AD77E8C46DDABE49D309A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sciel_PostProcess_V2_AnimGraphNode_TransitionResult_9E0BFDCB43FAA05D31A35F967A65E3D5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sciel_PostProcess_V2_AnimGraphNode_TransitionResult_AA23B33244A987543DF63984DF80701E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sciel_PostProcess_V2_AnimGraphNode_TransitionResult_E74E349848A94B57D0A400A0DC02B86D();
	void ExecuteUbergraph_ABP_Sciel_PostProcess_V2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
