#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_HairVar_MAELLE_DoubleBraided

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_HairVar_MAELLE_DoubleBraided.ABP_PostProcess_HairVar_MAELLE_DoubleBraided_C
// 0xCF20 (0xD290 - 0x0370)
class UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0x0390(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x0B30(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x12D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x1A70(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x2210(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x29B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x3150(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x38F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x4090(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x4830(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x4FD0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x5770(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x5F10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x66B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x6E50(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x75F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x7D90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x8530(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x8CD0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x9470(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x9C10(0x07A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0xA3B0(0x00B8)()
	uint8                                         Pad_A468[0x8];                                     // 0xA468(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0xA470(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0xAC10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0xB3B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0xBB50(0x07A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xC2F0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xC310(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xC330(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0xC350(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0xCAF0(0x07A0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_1B07CD48483A85BF03B47CA9E2B9B0B5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_1F93A95C4DCF308DE0303CB2EEEA5EE8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_23CB8CF54284D221235236A84D53AEFE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_25F0F5604E0102C326D7798F7838CF80();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_2B76021A479199DBF18F9AA7AA93FFF5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_2CD0F4574EA3DA1FAAAE5DB81390DE7B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_2D74592F4D10B03103BB8FA1C416E528();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_439C211E4674F2E2E81B0E9240D7FC4F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_453594AE4C6EB37E63CDC6AB4AC90B6F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_53FF534F49FA5CC0596096A9D11C646B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_66008C3D4FD0CF12DDE43FA4D6D2DA26();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_6926141D4119B05FEBDB06962B178738();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_696C1C784D61A44AFF8C47B63F4AC2B1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_750182084EDA5E782387B596FA27BD6C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_855F402942733F149AD560B42D39F227();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_860E513340C8A8373AC1879EE739D9C3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_898AF53F41F1E91A418696B704483D58();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_8D9E99854E095F01E617F8A023FF440A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_9DEB960D4A8EE3FA6B9252AD580BD493();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_A08D22364BA3058B5FC43F8F405CD63A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_AAE076064955D3195DBB72A8BCABB8BA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_D5E578354690A096AEA1B69853FC5048();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_E37541444FCDF3C0803447A2F1CB9B20();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_E5D2C9204A189D89BF273391A0031DCA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_EEE258E94871504B3755848A313760EE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_FC2F2E9D424747FD2EBBDF9B3FDCF502();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided_AnimGraphNode_KawaiiPhysics_FF3491AF4CF87444139B0BBC31BB08BB();
	void ExecuteUbergraph_ABP_PostProcess_HairVar_MAELLE_DoubleBraided(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_HairVar_MAELLE_DoubleBraided_C">();
	}
	static class UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C>();
	}
};
static_assert(alignof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C) == 0x000010, "Wrong alignment on UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C");
static_assert(sizeof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C) == 0x00D290, "Wrong size on UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_26) == 0x000390, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_26' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_25) == 0x000B30, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_24) == 0x0012D0, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_23) == 0x001A70, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_22) == 0x002210, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_21) == 0x0029B0, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_20) == 0x003150, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_19) == 0x0038F0, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_18) == 0x004090, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_17) == 0x004830, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_16) == 0x004FD0, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_15) == 0x005770, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_14) == 0x005F10, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_13) == 0x0066B0, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_12) == 0x006E50, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_11) == 0x0075F0, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_10) == 0x007D90, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_9) == 0x008530, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_8) == 0x008CD0, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_7) == 0x009470, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_6) == 0x009C10, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_LinkedInputPose) == 0x00A3B0, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_5) == 0x00A470, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_4) == 0x00AC10, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_3) == 0x00B3B0, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_2) == 0x00BB50, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_ComponentToLocalSpace) == 0x00C2F0, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_LocalToComponentSpace) == 0x00C310, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_Root) == 0x00C330, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics_1) == 0x00C350, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C, AnimGraphNode_KawaiiPhysics) == 0x00CAF0, "Member 'UABP_PostProcess_HairVar_MAELLE_DoubleBraided_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

