#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint.ABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C
// 0x2F00 (0x3270 - 0x0370)
class UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03A8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03C8(0x0020)()
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x03F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x0B90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x1330(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x1AD0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x2270(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x2A10(0x07A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x31B0(0x00B8)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_69EA8169460A9BB2916977B7A696D48E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_6C8DBB30443EC10E59F44B82E56CF9BE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_72136DA14BE3E8CF2BE42699573566DC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_7E8F54684FF61C2F23D6F9ADD1E2E6A0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_AA860C0B42F0D9D6946B499EAEAF0BE4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_C553BD554884D3BBB22A5A91B308CAF3();
	void ExecuteUbergraph_ABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C">();
	}
	static class UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C) == 0x003270, "Wrong size on UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x0003A8, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003C8, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_5) == 0x0003F0, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_4) == 0x000B90, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_3) == 0x001330, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_2) == 0x001AD0, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_1) == 0x002270, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics) == 0x002A10, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_LinkedInputPose) == 0x0031B0, "Member 'UABP_PostProcess_Hair_GRANDIS_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

