#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_Maelle_Civil

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_PostProcess_Maelle_Civil_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_Maelle_Civil.ABP_PostProcess_Maelle_Civil_C
// 0x67D0 (0x6B40 - 0x0370)
class UABP_PostProcess_Maelle_Civil_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_PostProcess_Maelle_Civil::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0378(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0390(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03B0(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0468(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0488(0x0020)()
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x04B0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x09D0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x0EF0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x1410(0x0520)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_3;              // 0x1930(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_2;              // 0x1A58(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_1;              // 0x1B80(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController;                // 0x1CA8(0x0128)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x1DD0(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_43;                       // 0x22A0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_42;                       // 0x2440(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_41;                       // 0x25E0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_40;                       // 0x2780(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_39;                       // 0x2920(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_38;                       // 0x2AC0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_37;                       // 0x2C60(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_36;                       // 0x2E00(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_35;                       // 0x2FA0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_34;                       // 0x3140(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_33;                       // 0x32E0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_32;                       // 0x3480(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_31;                       // 0x3620(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_30;                       // 0x37C0(0x01A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3960(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3988(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x39D0(0x0028)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_29;                       // 0x39F8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_28;                       // 0x3B98(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_27;                       // 0x3D38(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_26;                       // 0x3ED8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_25;                       // 0x4078(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_24;                       // 0x4218(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_23;                       // 0x43B8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_22;                       // 0x4558(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_21;                       // 0x46F8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_20;                       // 0x4898(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_19;                       // 0x4A38(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_18;                       // 0x4BD8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_17;                       // 0x4D78(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_16;                       // 0x4F18(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_15;                       // 0x50B8(0x01A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x5258(0x0080)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_14;                       // 0x52D8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_13;                       // 0x5478(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_12;                       // 0x5618(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_11;                       // 0x57B8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_10;                       // 0x5958(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_9;                        // 0x5AF8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_8;                        // 0x5C98(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_7;                        // 0x5E38(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_6;                        // 0x5FD8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_5;                        // 0x6178(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_4;                        // 0x6318(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_3;                        // 0x64B8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_2;                        // 0x6658(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0x67F8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0x6998(0x01A0)()
	bool                                          ShouldDisablePostProcess;                          // 0x6B38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_PostProcess_Maelle_Civil(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_Maelle_Civil_C">();
	}
	static class UABP_PostProcess_Maelle_Civil_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_Maelle_Civil_C>();
	}
};
static_assert(alignof(UABP_PostProcess_Maelle_Civil_C) == 0x000010, "Wrong alignment on UABP_PostProcess_Maelle_Civil_C");
static_assert(sizeof(UABP_PostProcess_Maelle_Civil_C) == 0x006B40, "Wrong size on UABP_PostProcess_Maelle_Civil_C");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_Maelle_Civil_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, __AnimBlueprintMutables) == 0x000378, "Member 'UABP_PostProcess_Maelle_Civil_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimBlueprintExtension_PropertyAccess) == 0x000380, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimBlueprintExtension_Base) == 0x000388, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_Root) == 0x000390, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_LinkedInputPose) == 0x0003B0, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_LocalToComponentSpace) == 0x000468, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_ComponentToLocalSpace) == 0x000488, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_AnimDynamics_3) == 0x0004B0, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_AnimDynamics_2) == 0x0009D0, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_AnimDynamics_1) == 0x000EF0, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_AnimDynamics) == 0x001410, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_BoneDrivenController_3) == 0x001930, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_BoneDrivenController_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_BoneDrivenController_2) == 0x001A58, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_BoneDrivenController_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_BoneDrivenController_1) == 0x001B80, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_BoneDrivenController_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_BoneDrivenController) == 0x001CA8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_BoneDrivenController' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_ControlRig) == 0x001DD0, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_43) == 0x0022A0, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_43' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_42) == 0x002440, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_42' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_41) == 0x0025E0, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_41' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_40) == 0x002780, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_40' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_39) == 0x002920, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_39' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_38) == 0x002AC0, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_38' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_37) == 0x002C60, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_37' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_36) == 0x002E00, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_36' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_35) == 0x002FA0, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_35' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_34) == 0x003140, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_34' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_33) == 0x0032E0, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_33' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_32) == 0x003480, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_32' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_31) == 0x003620, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_31' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_30) == 0x0037C0, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_30' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_UseCachedPose_1) == 0x003960, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_BlendListByBool) == 0x003988, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_UseCachedPose) == 0x0039D0, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_29) == 0x0039F8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_29' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_28) == 0x003B98, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_28' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_27) == 0x003D38, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_27' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_26) == 0x003ED8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_26' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_25) == 0x004078, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_25' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_24) == 0x004218, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_24' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_23) == 0x0043B8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_23' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_22) == 0x004558, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_22' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_21) == 0x0046F8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_21' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_20) == 0x004898, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_20' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_19) == 0x004A38, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_19' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_18) == 0x004BD8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_18' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_17) == 0x004D78, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_17' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_16) == 0x004F18, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_16' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_15) == 0x0050B8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_SaveCachedPose) == 0x005258, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_14) == 0x0052D8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_13) == 0x005478, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_12) == 0x005618, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_11) == 0x0057B8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_10) == 0x005958, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_9) == 0x005AF8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_8) == 0x005C98, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_7) == 0x005E38, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_6) == 0x005FD8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_5) == 0x006178, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_4) == 0x006318, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_3) == 0x0064B8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_2) == 0x006658, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver_1) == 0x0067F8, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, AnimGraphNode_PoseDriver) == 0x006998, "Member 'UABP_PostProcess_Maelle_Civil_C::AnimGraphNode_PoseDriver' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Maelle_Civil_C, ShouldDisablePostProcess) == 0x006B38, "Member 'UABP_PostProcess_Maelle_Civil_C::ShouldDisablePostProcess' has a wrong offset!");

}

