#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_HairVar_VERSO_Samourai

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK::Params
{

// Function ABP_PostProcess_HairVar_VERSO_Samourai.ABP_PostProcess_HairVar_VERSO_Samourai_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_PostProcess_HairVar_VERSO_Samourai_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PostProcess_HairVar_VERSO_Samourai_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_PostProcess_HairVar_VERSO_Samourai_C_AnimGraph");
static_assert(sizeof(ABP_PostProcess_HairVar_VERSO_Samourai_C_AnimGraph) == 0x000020, "Wrong size on ABP_PostProcess_HairVar_VERSO_Samourai_C_AnimGraph");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_PostProcess_HairVar_VERSO_Samourai.ABP_PostProcess_HairVar_VERSO_Samourai_C.ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai
// 0x010C (0x010C - 0x0000)
struct ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings;           // 0x0004(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_1;         // 0x001C(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_2;         // 0x0034(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_3;         // 0x004C(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_4;         // 0x0064(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_5;         // 0x007C(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_6;         // 0x0094(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_7;         // 0x00AC(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_8;         // 0x00C4(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_9;         // 0x00DC(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_10;        // 0x00F4(0x0018)(NoDestructor)
};
static_assert(alignof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai) == 0x000004, "Wrong alignment on ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai");
static_assert(sizeof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai) == 0x00010C, "Wrong size on ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai, EntryPoint) == 0x000000, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai, K2Node_MakeStruct_KawaiiPhysicsSettings) == 0x000004, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai::K2Node_MakeStruct_KawaiiPhysicsSettings' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai, K2Node_MakeStruct_KawaiiPhysicsSettings_1) == 0x00001C, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai::K2Node_MakeStruct_KawaiiPhysicsSettings_1' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai, K2Node_MakeStruct_KawaiiPhysicsSettings_2) == 0x000034, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai::K2Node_MakeStruct_KawaiiPhysicsSettings_2' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai, K2Node_MakeStruct_KawaiiPhysicsSettings_3) == 0x00004C, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai::K2Node_MakeStruct_KawaiiPhysicsSettings_3' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai, K2Node_MakeStruct_KawaiiPhysicsSettings_4) == 0x000064, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai::K2Node_MakeStruct_KawaiiPhysicsSettings_4' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai, K2Node_MakeStruct_KawaiiPhysicsSettings_5) == 0x00007C, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai::K2Node_MakeStruct_KawaiiPhysicsSettings_5' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai, K2Node_MakeStruct_KawaiiPhysicsSettings_6) == 0x000094, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai::K2Node_MakeStruct_KawaiiPhysicsSettings_6' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai, K2Node_MakeStruct_KawaiiPhysicsSettings_7) == 0x0000AC, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai::K2Node_MakeStruct_KawaiiPhysicsSettings_7' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai, K2Node_MakeStruct_KawaiiPhysicsSettings_8) == 0x0000C4, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai::K2Node_MakeStruct_KawaiiPhysicsSettings_8' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai, K2Node_MakeStruct_KawaiiPhysicsSettings_9) == 0x0000DC, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai::K2Node_MakeStruct_KawaiiPhysicsSettings_9' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai, K2Node_MakeStruct_KawaiiPhysicsSettings_10) == 0x0000F4, "Member 'ABP_PostProcess_HairVar_VERSO_Samourai_C_ExecuteUbergraph_ABP_PostProcess_HairVar_VERSO_Samourai::K2Node_MakeStruct_KawaiiPhysicsSettings_10' has a wrong offset!");

}

