#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Gestral_Merchant_Backpack_PostProcess

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Gestral_Merchant_Backpack_PostProcess.ABP_Gestral_Merchant_Backpack_PostProcess_C
// 0x8370 (0x86E0 - 0x0370)
class UABP_Gestral_Merchant_Backpack_PostProcess_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03A8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03C8(0x0020)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_6;                        // 0x03E8(0x0168)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_5;                        // 0x0550(0x0168)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_4;                        // 0x06B8(0x0168)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_3;                        // 0x0820(0x0168)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_2;                        // 0x0988(0x0168)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0x0AF0(0x0168)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0x0C58(0x0168)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_21;                     // 0x0DC0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_20;                     // 0x12E0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_19;                     // 0x1800(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_18;                     // 0x1D20(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_17;                     // 0x2240(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_16;                     // 0x2760(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_15;                     // 0x2C80(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_14;                     // 0x31A0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_13;                     // 0x36C0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_12;                     // 0x3BE0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0x4100(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x4620(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x4B40(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x5060(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x5580(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x5AA0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x5FC0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x64E0(0x0520)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x6A00(0x00B8)()
	uint8                                         Pad_6AB8[0x8];                                     // 0x6AB8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x6AC0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x6FE0(0x0520)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x7500(0x07A0)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x7CA0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x81C0(0x0520)()

public:
	void ExecuteUbergraph_ABP_Gestral_Merchant_Backpack_PostProcess(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Gestral_Merchant_Backpack_PostProcess_C">();
	}
	static class UABP_Gestral_Merchant_Backpack_PostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Gestral_Merchant_Backpack_PostProcess_C>();
	}
};
static_assert(alignof(UABP_Gestral_Merchant_Backpack_PostProcess_C) == 0x000010, "Wrong alignment on UABP_Gestral_Merchant_Backpack_PostProcess_C");
static_assert(sizeof(UABP_Gestral_Merchant_Backpack_PostProcess_C) == 0x0086E0, "Wrong size on UABP_Gestral_Merchant_Backpack_PostProcess_C");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, UberGraphFrame) == 0x000370, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_LocalToComponentSpace) == 0x0003A8, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003C8, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_SpringBone_6) == 0x0003E8, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_SpringBone_6' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_SpringBone_5) == 0x000550, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_SpringBone_5' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_SpringBone_4) == 0x0006B8, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_SpringBone_4' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_SpringBone_3) == 0x000820, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_SpringBone_3' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_SpringBone_2) == 0x000988, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_SpringBone_2' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_SpringBone_1) == 0x000AF0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_SpringBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_SpringBone) == 0x000C58, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_SpringBone' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_21) == 0x000DC0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_21' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_20) == 0x0012E0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_20' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_19) == 0x001800, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_19' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_18) == 0x001D20, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_18' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_17) == 0x002240, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_17' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_16) == 0x002760, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_16' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_15) == 0x002C80, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_15' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_14) == 0x0031A0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_14' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_13) == 0x0036C0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_13' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_12) == 0x003BE0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_12' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_11) == 0x004100, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_10) == 0x004620, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_9) == 0x004B40, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_8) == 0x005060, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_7) == 0x005580, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_6) == 0x005AA0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_5) == 0x005FC0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_4) == 0x0064E0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_LinkedInputPose) == 0x006A00, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_3) == 0x006AC0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_2) == 0x006FE0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_KawaiiPhysics) == 0x007500, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics_1) == 0x007CA0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UABP_Gestral_Merchant_Backpack_PostProcess_C, AnimGraphNode_AnimDynamics) == 0x0081C0, "Member 'UABP_Gestral_Merchant_Backpack_PostProcess_C::AnimGraphNode_AnimDynamics' has a wrong offset!");

}

