#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_Hair_Gestral_8

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_Hair_Gestral_8.ABP_PostProcess_Hair_Gestral_8_C
// 0x99C0 (0x9D30 - 0x0370)
class UABP_PostProcess_Hair_Gestral_8_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x03B0(0x07A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0B50(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x0B70(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x1310(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x1AB0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x2250(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x29F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x3190(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x3930(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x40D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x4870(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x5010(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x57B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x5F50(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x66F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x6E90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x7630(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x7DD0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x8570(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x8D10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x94B0(0x07A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x9C50(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x9C70(0x00B8)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_03969D0644E6F5A8438E008429B70FBF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_1CF3BAEF44D5F9BBC8C5179070BADDE6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_23F222C54E322848A714C88F66BB9C16();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_2BE705EF43A8DC0DA85230A3C081FDCE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_30CB65E2431E164DA588F09D5337668B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_35B2F30840CF5334877A108663841FB2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_474E11A9451C6C54A5EAE79523FA7506();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_5274BFF94DF4556654F874BAA886D45A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_6B5F77EA4F2D25872AD124920A30CEC9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_88005C86455039937096B19CA4A61BF8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_89E52E4B450F391D5D175D9BC2A1ECB5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_933DB50F4114CEB9C67148B9A09A2F8F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_9861BA1B4D629AC67458599C1A65BF27();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_9F4578114945790994ECC0A6B98F4550();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_A447CDDE413AC78D118C96A38FB889D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_BE9614EA4F78D2AEF3DF908175DEECD0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_C207214745C545375909F2A77E9F569E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_E6550E9F451C587679EED1A4B9E80479();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_ED6FBEC24FB72ABB903810A04B8EE9EB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8_AnimGraphNode_KawaiiPhysics_FB3AC9BC4D8BE88B227AB78FDF978EE3();
	void ExecuteUbergraph_ABP_PostProcess_Hair_Gestral_8(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_Hair_Gestral_8_C">();
	}
	static class UABP_PostProcess_Hair_Gestral_8_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_Hair_Gestral_8_C>();
	}
};
static_assert(alignof(UABP_PostProcess_Hair_Gestral_8_C) == 0x000010, "Wrong alignment on UABP_PostProcess_Hair_Gestral_8_C");
static_assert(sizeof(UABP_PostProcess_Hair_Gestral_8_C) == 0x009D30, "Wrong size on UABP_PostProcess_Hair_Gestral_8_C");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_Hair_Gestral_8_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_19) == 0x0003B0, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_LocalToComponentSpace) == 0x000B50, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_18) == 0x000B70, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_17) == 0x001310, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_16) == 0x001AB0, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_15) == 0x002250, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_14) == 0x0029F0, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_13) == 0x003190, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_12) == 0x003930, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_11) == 0x0040D0, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_10) == 0x004870, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_9) == 0x005010, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_8) == 0x0057B0, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_7) == 0x005F50, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_6) == 0x0066F0, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_5) == 0x006E90, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_4) == 0x007630, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_3) == 0x007DD0, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_2) == 0x008570, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics_1) == 0x008D10, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_KawaiiPhysics) == 0x0094B0, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_ComponentToLocalSpace) == 0x009C50, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_Gestral_8_C, AnimGraphNode_LinkedInputPose) == 0x009C70, "Member 'UABP_PostProcess_Hair_Gestral_8_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

