#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_Hair_SCIEL_Voluminous

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_Hair_SCIEL_Voluminous.ABP_PostProcess_Hair_SCIEL_Voluminous_C
// 0x11B60 (0x11ED0 - 0x0370)
class UABP_PostProcess_Hair_SCIEL_Voluminous_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03A8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03C8(0x0020)()
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_36;                    // 0x03F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_35;                    // 0x0B90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_34;                    // 0x1330(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_33;                    // 0x1AD0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_32;                    // 0x2270(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_31;                    // 0x2A10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0x31B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0x3950(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0x40F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0x4890(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0x5030(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x57D0(0x07A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x5F70(0x00B8)()
	uint8                                         Pad_6028[0x8];                                     // 0x6028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x6030(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x67D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x6F70(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x7710(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x7EB0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x8650(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x8DF0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x9590(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x9D30(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0xA4D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0xAC70(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0xB410(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0xBBB0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0xC350(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0xCAF0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0xD290(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0xDA30(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0xE1D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0xE970(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0xF110(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0xF8B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x10050(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x107F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x10F90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x11730(0x07A0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_052CBD224117A567F81CBEAA61DD6325();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_14CAE86B435D9A8326F6089D8DF9D265();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_1D752BD042713EA5E209D7AD5670C013();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_1E775133469D188DDD0F4DB8A5F4DF28();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_2CC918084DB0F11352468A97F2675BCF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_2DD159CA41C621A67F3128A3D24F907F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_33C189A34C52A9246CA3F480EF7F9C93();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_382C0349480347047783E8B9B0DE7882();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_408FF0D84D12FA848F743992C74C810F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_434B81694ACB51C326CB0AB9B9CF460A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_4C115E254271D3CDFD106EB43C221D09();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_4D2169D24924DE5797C362812A799B03();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_50D7286F4866F40426DC93A4F223DD1E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_5BA8943C4B9BDB2A726522A622ECDAED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_61EFEFE746CB6D6D9146A38C461D8682();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_63C12DDD4E78A765109A83BA5873DDB2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_64F8CD544877E59E6AD9A183F4B8CE8E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_6703CBA84284AD959F6251A2CF2ED0E2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_68941F73492B858916966D8FC77ED6E5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_6FCF1F9448AECEBF4A3A9C98A0176BF3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_7CFAD0884F2495DEA59CF2A6ECF1FE76();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_7D4F36024ED00F0171074FA3F5FADC88();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_84001E3144730E8D354DDBA648DD53C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_91C65A9D483D50963B53E0AC3F5BAC63();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_92A38C0B4C86700C3C3471B425CA88D5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_95B1E8ED4C4B6DBB832297896DAFE7CE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_9B6BE3F0436C898888916A9C2EBB1906();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_A1BDA6D144958E746542E5A4B28F1040();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_A5B7418F43DB323F4329D7BBBD2A8E99();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_A7876A4C4750F85C0A8D659523FBCA98();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_BA289C9F42083DD7445F98AEECE73496();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_BD2BFB384E58D404F0792DA29EF5AF3E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_C50FA16C499FE2656DE95B99E918329C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_E2779149486D873DAB8FCF828709864E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_E72232D2433F3FB9856EDC9082E3462A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_F5091125459F4AE9369F5D8364B7BF92();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous_AnimGraphNode_KawaiiPhysics_F623F69047281DC43ACDCBBF9105281A();
	void ExecuteUbergraph_ABP_PostProcess_Hair_SCIEL_Voluminous(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_Hair_SCIEL_Voluminous_C">();
	}
	static class UABP_PostProcess_Hair_SCIEL_Voluminous_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_Hair_SCIEL_Voluminous_C>();
	}
};
static_assert(alignof(UABP_PostProcess_Hair_SCIEL_Voluminous_C) == 0x000010, "Wrong alignment on UABP_PostProcess_Hair_SCIEL_Voluminous_C");
static_assert(sizeof(UABP_PostProcess_Hair_SCIEL_Voluminous_C) == 0x011ED0, "Wrong size on UABP_PostProcess_Hair_SCIEL_Voluminous_C");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_LocalToComponentSpace) == 0x0003A8, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003C8, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_36) == 0x0003F0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_36' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_35) == 0x000B90, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_35' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_34) == 0x001330, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_34' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_33) == 0x001AD0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_33' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_32) == 0x002270, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_32' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_31) == 0x002A10, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_31' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_30) == 0x0031B0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_30' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_29) == 0x003950, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_29' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_28) == 0x0040F0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_28' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_27) == 0x004890, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_27' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_26) == 0x005030, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_26' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_25) == 0x0057D0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_LinkedInputPose) == 0x005F70, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_24) == 0x006030, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_23) == 0x0067D0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_22) == 0x006F70, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_21) == 0x007710, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_20) == 0x007EB0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_19) == 0x008650, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_18) == 0x008DF0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_17) == 0x009590, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_16) == 0x009D30, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_15) == 0x00A4D0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_14) == 0x00AC70, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_13) == 0x00B410, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_12) == 0x00BBB0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_11) == 0x00C350, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_10) == 0x00CAF0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_9) == 0x00D290, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_8) == 0x00DA30, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_7) == 0x00E1D0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_6) == 0x00E970, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_5) == 0x00F110, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_4) == 0x00F8B0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_3) == 0x010050, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_2) == 0x0107F0, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics_1) == 0x010F90, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Hair_SCIEL_Voluminous_C, AnimGraphNode_KawaiiPhysics) == 0x011730, "Member 'UABP_PostProcess_Hair_SCIEL_Voluminous_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

