#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Monoco_PostProcess

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "ABP_Monoco_PostProcess_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Monoco_PostProcess.ABP_Monoco_PostProcess_C
// 0xA880 (0xABF0 - 0x0370)
class UABP_Monoco_PostProcess_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Monoco_PostProcess::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;       // 0x0378(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0390(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03B0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03F0(0x00B8)()
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x04B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x0C50(0x07A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x13F0(0x0028)()
	uint8                                         Pad_1418[0x8];                                     // 0x1418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x1420(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1BC0(0x07A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2360(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x23A8(0x0028)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_25;                     // 0x23D0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_24;                     // 0x28F0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_23;                     // 0x2E10(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_22;                     // 0x3330(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_21;                     // 0x3850(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_20;                     // 0x3D70(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_19;                     // 0x4290(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_18;                     // 0x47B0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_17;                     // 0x4CD0(0x0520)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_1;              // 0x51F0(0x0128)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController;                // 0x5318(0x0128)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x5440(0x0080)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_16;                     // 0x54C0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_15;                     // 0x59E0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_14;                     // 0x5F00(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_13;                     // 0x6420(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_12;                     // 0x6940(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0x6E60(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x7380(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x78A0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x7DC0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x82E0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x8800(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x8D20(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x9240(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x9760(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x9C80(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0xA1A0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0xA6C0(0x0520)()
	bool                                          ShouldDisablePostProcess;                          // 0xABE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Monoco_PostProcess_AnimGraphNode_KawaiiPhysics_3FADAF2D4AC8E6265A0CA7BCB6E90970();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Monoco_PostProcess_AnimGraphNode_KawaiiPhysics_6FFC1B294751E0C4F677EC96B4819A13();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Monoco_PostProcess_AnimGraphNode_KawaiiPhysics_CB42337C485FB5DA3BC2F282F71F8498();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Monoco_PostProcess_AnimGraphNode_KawaiiPhysics_D4C75B7843A7D4EE51EBE79BA9148E11();
	void ExecuteUbergraph_ABP_Monoco_PostProcess(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Monoco_PostProcess_C">();
	}
	static class UABP_Monoco_PostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Monoco_PostProcess_C>();
	}
};
static_assert(alignof(UABP_Monoco_PostProcess_C) == 0x000010, "Wrong alignment on UABP_Monoco_PostProcess_C");
static_assert(sizeof(UABP_Monoco_PostProcess_C) == 0x00ABF0, "Wrong size on UABP_Monoco_PostProcess_C");
static_assert(offsetof(UABP_Monoco_PostProcess_C, UberGraphFrame) == 0x000370, "Member 'UABP_Monoco_PostProcess_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, __AnimBlueprintMutables) == 0x000378, "Member 'UABP_Monoco_PostProcess_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimBlueprintExtension_PropertyAccess) == 0x000380, "Member 'UABP_Monoco_PostProcess_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimBlueprintExtension_Base) == 0x000388, "Member 'UABP_Monoco_PostProcess_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_Root) == 0x000390, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_LocalToComponentSpace) == 0x0003B0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003D0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_LinkedInputPose) == 0x0003F0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_KawaiiPhysics_3) == 0x0004B0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_KawaiiPhysics_2) == 0x000C50, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_UseCachedPose_1) == 0x0013F0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_KawaiiPhysics_1) == 0x001420, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_KawaiiPhysics) == 0x001BC0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_BlendListByBool) == 0x002360, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_UseCachedPose) == 0x0023A8, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_25) == 0x0023D0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_25' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_24) == 0x0028F0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_24' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_23) == 0x002E10, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_23' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_22) == 0x003330, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_22' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_21) == 0x003850, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_21' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_20) == 0x003D70, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_20' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_19) == 0x004290, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_19' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_18) == 0x0047B0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_18' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_17) == 0x004CD0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_17' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_BoneDrivenController_1) == 0x0051F0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_BoneDrivenController_1' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_BoneDrivenController) == 0x005318, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_BoneDrivenController' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_SaveCachedPose) == 0x005440, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_16) == 0x0054C0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_16' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_15) == 0x0059E0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_15' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_14) == 0x005F00, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_14' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_13) == 0x006420, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_13' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_12) == 0x006940, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_12' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_11) == 0x006E60, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_10) == 0x007380, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_9) == 0x0078A0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_8) == 0x007DC0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_7) == 0x0082E0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_6) == 0x008800, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_5) == 0x008D20, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_4) == 0x009240, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_3) == 0x009760, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_2) == 0x009C80, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics_1) == 0x00A1A0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, AnimGraphNode_AnimDynamics) == 0x00A6C0, "Member 'UABP_Monoco_PostProcess_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UABP_Monoco_PostProcess_C, ShouldDisablePostProcess) == 0x00ABE0, "Member 'UABP_Monoco_PostProcess_C::ShouldDisablePostProcess' has a wrong offset!");

}

