#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_RealRenoir

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "ABP_PostProcess_RealRenoir_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_RealRenoir.ABP_PostProcess_RealRenoir_C
// 0x6EE0 (0x7250 - 0x0370)
class UABP_PostProcess_RealRenoir_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_PostProcess_RealRenoir::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;   // 0x0378(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0390(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03B0(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x03D0(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x08A0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x08C0(0x00B8)()
	uint8                                         Pad_978[0x8];                                      // 0x0978(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x0980(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x0EA0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x13C0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x18E0(0x0520)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController;                // 0x1E00(0x0128)()
	uint8                                         Pad_1F28[0x8];                                     // 0x1F28(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x1F30(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2450(0x0520)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_43;                       // 0x2970(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_42;                       // 0x2B10(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_41;                       // 0x2CB0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_40;                       // 0x2E50(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_39;                       // 0x2FF0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_38;                       // 0x3190(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_37;                       // 0x3330(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_36;                       // 0x34D0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_35;                       // 0x3670(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_34;                       // 0x3810(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_33;                       // 0x39B0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_32;                       // 0x3B50(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_31;                       // 0x3CF0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_30;                       // 0x3E90(0x01A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x4030(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x4058(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x40A0(0x0028)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_29;                       // 0x40C8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_28;                       // 0x4268(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_27;                       // 0x4408(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_26;                       // 0x45A8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_25;                       // 0x4748(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_24;                       // 0x48E8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_23;                       // 0x4A88(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_22;                       // 0x4C28(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_21;                       // 0x4DC8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_20;                       // 0x4F68(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_19;                       // 0x5108(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_18;                       // 0x52A8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_17;                       // 0x5448(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_16;                       // 0x55E8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_15;                       // 0x5788(0x01A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x5928(0x0080)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_14;                       // 0x59A8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_13;                       // 0x5B48(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_12;                       // 0x5CE8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_11;                       // 0x5E88(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_10;                       // 0x6028(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_9;                        // 0x61C8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_8;                        // 0x6368(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_7;                        // 0x6508(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_6;                        // 0x66A8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_5;                        // 0x6848(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_4;                        // 0x69E8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_3;                        // 0x6B88(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_2;                        // 0x6D28(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0x6EC8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0x7068(0x01A0)()
	struct FKawaiiPhysicsSettings                 Coat_KawaiiSettings;                               // 0x7208(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 Sleeves_KawaiiSettings;                            // 0x7220(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         AlphaSleeves;                                      // 0x7238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha_Coat_Ext;                                    // 0x723C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha_Coat_Int;                                    // 0x7240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha_Kawaii;                                      // 0x7244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldDisablePostProcess;                          // 0x7248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_PostProcess_RealRenoir(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_RealRenoir_C">();
	}
	static class UABP_PostProcess_RealRenoir_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_RealRenoir_C>();
	}
};
static_assert(alignof(UABP_PostProcess_RealRenoir_C) == 0x000010, "Wrong alignment on UABP_PostProcess_RealRenoir_C");
static_assert(sizeof(UABP_PostProcess_RealRenoir_C) == 0x007250, "Wrong size on UABP_PostProcess_RealRenoir_C");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_RealRenoir_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, __AnimBlueprintMutables) == 0x000378, "Member 'UABP_PostProcess_RealRenoir_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimBlueprintExtension_PropertyAccess) == 0x000380, "Member 'UABP_PostProcess_RealRenoir_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimBlueprintExtension_Base) == 0x000388, "Member 'UABP_PostProcess_RealRenoir_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_Root) == 0x000390, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_LocalToComponentSpace) == 0x0003B0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_ControlRig) == 0x0003D0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_ComponentToLocalSpace) == 0x0008A0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_LinkedInputPose) == 0x0008C0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_AnimDynamics_5) == 0x000980, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_AnimDynamics_4) == 0x000EA0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_AnimDynamics_3) == 0x0013C0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_AnimDynamics_2) == 0x0018E0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_BoneDrivenController) == 0x001E00, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_BoneDrivenController' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_AnimDynamics_1) == 0x001F30, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_AnimDynamics) == 0x002450, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_43) == 0x002970, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_43' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_42) == 0x002B10, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_42' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_41) == 0x002CB0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_41' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_40) == 0x002E50, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_40' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_39) == 0x002FF0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_39' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_38) == 0x003190, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_38' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_37) == 0x003330, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_37' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_36) == 0x0034D0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_36' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_35) == 0x003670, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_35' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_34) == 0x003810, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_34' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_33) == 0x0039B0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_33' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_32) == 0x003B50, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_32' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_31) == 0x003CF0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_31' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_30) == 0x003E90, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_30' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_UseCachedPose_1) == 0x004030, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_BlendListByBool) == 0x004058, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_UseCachedPose) == 0x0040A0, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_29) == 0x0040C8, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_29' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_28) == 0x004268, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_28' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_27) == 0x004408, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_27' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_26) == 0x0045A8, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_26' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_25) == 0x004748, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_25' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_24) == 0x0048E8, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_24' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_23) == 0x004A88, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_23' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_22) == 0x004C28, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_22' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_21) == 0x004DC8, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_21' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_20) == 0x004F68, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_20' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_19) == 0x005108, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_19' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_18) == 0x0052A8, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_18' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_17) == 0x005448, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_17' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_16) == 0x0055E8, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_16' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_15) == 0x005788, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_SaveCachedPose) == 0x005928, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_14) == 0x0059A8, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_13) == 0x005B48, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_12) == 0x005CE8, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_11) == 0x005E88, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_10) == 0x006028, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_9) == 0x0061C8, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_8) == 0x006368, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_7) == 0x006508, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_6) == 0x0066A8, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_5) == 0x006848, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_4) == 0x0069E8, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_3) == 0x006B88, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_2) == 0x006D28, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver_1) == 0x006EC8, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AnimGraphNode_PoseDriver) == 0x007068, "Member 'UABP_PostProcess_RealRenoir_C::AnimGraphNode_PoseDriver' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, Coat_KawaiiSettings) == 0x007208, "Member 'UABP_PostProcess_RealRenoir_C::Coat_KawaiiSettings' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, Sleeves_KawaiiSettings) == 0x007220, "Member 'UABP_PostProcess_RealRenoir_C::Sleeves_KawaiiSettings' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, AlphaSleeves) == 0x007238, "Member 'UABP_PostProcess_RealRenoir_C::AlphaSleeves' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, Alpha_Coat_Ext) == 0x00723C, "Member 'UABP_PostProcess_RealRenoir_C::Alpha_Coat_Ext' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, Alpha_Coat_Int) == 0x007240, "Member 'UABP_PostProcess_RealRenoir_C::Alpha_Coat_Int' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, Alpha_Kawaii) == 0x007244, "Member 'UABP_PostProcess_RealRenoir_C::Alpha_Kawaii' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_RealRenoir_C, ShouldDisablePostProcess) == 0x007248, "Member 'UABP_PostProcess_RealRenoir_C::ShouldDisablePostProcess' has a wrong offset!");

}

