#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_Expeditioners_Male

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_Expeditioners_Male.ABP_PostProcess_Expeditioners_Male_C
// 0xD2B0 (0xD620 - 0x0370)
class UABP_PostProcess_Expeditioners_Male_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0388(0x00B8)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x0440(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x0BE0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x1380(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x1B20(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x22C0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x2A60(0x07A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x3200(0x0020)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_43;                       // 0x3220(0x01A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x33C0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x3B60(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x4300(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x4AA0(0x07A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_42;                       // 0x5240(0x01A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x53E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x5400(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0x5420(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x5940(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x5E60(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x6380(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x68A0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x6DC0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x72E0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x7800(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x7D20(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x8240(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x8760(0x0520)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_41;                       // 0x8C80(0x01A0)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x8E20(0x0520)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_40;                       // 0x9340(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_39;                       // 0x94E0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_38;                       // 0x9680(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_37;                       // 0x9820(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_36;                       // 0x99C0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_35;                       // 0x9B60(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_34;                       // 0x9D00(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_33;                       // 0x9EA0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_32;                       // 0xA040(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_31;                       // 0xA1E0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_30;                       // 0xA380(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_29;                       // 0xA520(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_28;                       // 0xA6C0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_27;                       // 0xA860(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_26;                       // 0xAA00(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_25;                       // 0xABA0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_24;                       // 0xAD40(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_23;                       // 0xAEE0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_22;                       // 0xB080(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_21;                       // 0xB220(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_20;                       // 0xB3C0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_19;                       // 0xB560(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_18;                       // 0xB700(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_17;                       // 0xB8A0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_16;                       // 0xBA40(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_15;                       // 0xBBE0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_14;                       // 0xBD80(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_13;                       // 0xBF20(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_12;                       // 0xC0C0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_11;                       // 0xC260(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_10;                       // 0xC400(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_9;                        // 0xC5A0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_8;                        // 0xC740(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_7;                        // 0xC8E0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_6;                        // 0xCA80(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_5;                        // 0xCC20(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_4;                        // 0xCDC0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_3;                        // 0xCF60(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_2;                        // 0xD100(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0xD2A0(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0xD440(0x01A0)()
	struct FKawaiiPhysicsSettings                 Physics_Settings_Coat;                             // 0xD5E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 Physics_Settings_Coat_Borders;                     // 0xD5F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Alpha;                                             // 0xD610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_PostProcess_Expeditioners_Male(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_Expeditioners_Male_C">();
	}
	static class UABP_PostProcess_Expeditioners_Male_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_Expeditioners_Male_C>();
	}
};
static_assert(alignof(UABP_PostProcess_Expeditioners_Male_C) == 0x000010, "Wrong alignment on UABP_PostProcess_Expeditioners_Male_C");
static_assert(sizeof(UABP_PostProcess_Expeditioners_Male_C) == 0x00D620, "Wrong size on UABP_PostProcess_Expeditioners_Male_C");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_Expeditioners_Male_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_LinkedInputPose) == 0x000388, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_KawaiiPhysics_9) == 0x000440, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_KawaiiPhysics_8) == 0x000BE0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_KawaiiPhysics_7) == 0x001380, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_KawaiiPhysics_6) == 0x001B20, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_KawaiiPhysics_5) == 0x0022C0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_KawaiiPhysics_4) == 0x002A60, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_LocalToComponentSpace) == 0x003200, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_43) == 0x003220, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_43' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_KawaiiPhysics_3) == 0x0033C0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_KawaiiPhysics_2) == 0x003B60, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_KawaiiPhysics_1) == 0x004300, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_KawaiiPhysics) == 0x004AA0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_42) == 0x005240, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_42' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_Root) == 0x0053E0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_ComponentToLocalSpace) == 0x005400, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_AnimDynamics_11) == 0x005420, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_AnimDynamics_10) == 0x005940, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_AnimDynamics_9) == 0x005E60, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_AnimDynamics_8) == 0x006380, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_AnimDynamics_7) == 0x0068A0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_AnimDynamics_6) == 0x006DC0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_AnimDynamics_5) == 0x0072E0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_AnimDynamics_4) == 0x007800, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_AnimDynamics_3) == 0x007D20, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_AnimDynamics_2) == 0x008240, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_AnimDynamics_1) == 0x008760, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_41) == 0x008C80, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_41' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_AnimDynamics) == 0x008E20, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_40) == 0x009340, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_40' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_39) == 0x0094E0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_39' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_38) == 0x009680, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_38' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_37) == 0x009820, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_37' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_36) == 0x0099C0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_36' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_35) == 0x009B60, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_35' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_34) == 0x009D00, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_34' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_33) == 0x009EA0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_33' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_32) == 0x00A040, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_32' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_31) == 0x00A1E0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_31' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_30) == 0x00A380, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_30' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_29) == 0x00A520, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_29' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_28) == 0x00A6C0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_28' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_27) == 0x00A860, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_27' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_26) == 0x00AA00, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_26' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_25) == 0x00ABA0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_25' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_24) == 0x00AD40, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_24' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_23) == 0x00AEE0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_23' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_22) == 0x00B080, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_22' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_21) == 0x00B220, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_21' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_20) == 0x00B3C0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_20' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_19) == 0x00B560, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_19' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_18) == 0x00B700, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_18' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_17) == 0x00B8A0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_17' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_16) == 0x00BA40, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_16' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_15) == 0x00BBE0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_14) == 0x00BD80, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_13) == 0x00BF20, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_12) == 0x00C0C0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_11) == 0x00C260, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_10) == 0x00C400, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_9) == 0x00C5A0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_8) == 0x00C740, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_7) == 0x00C8E0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_6) == 0x00CA80, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_5) == 0x00CC20, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_4) == 0x00CDC0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_3) == 0x00CF60, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_2) == 0x00D100, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver_1) == 0x00D2A0, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, AnimGraphNode_PoseDriver) == 0x00D440, "Member 'UABP_PostProcess_Expeditioners_Male_C::AnimGraphNode_PoseDriver' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, Physics_Settings_Coat) == 0x00D5E0, "Member 'UABP_PostProcess_Expeditioners_Male_C::Physics_Settings_Coat' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, Physics_Settings_Coat_Borders) == 0x00D5F8, "Member 'UABP_PostProcess_Expeditioners_Male_C::Physics_Settings_Coat_Borders' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_Expeditioners_Male_C, Alpha) == 0x00D610, "Member 'UABP_PostProcess_Expeditioners_Male_C::Alpha' has a wrong offset!");

}

