#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_HairVar_MONOCO_Viking

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_HairVar_MONOCO_Viking.ABP_PostProcess_HairVar_MONOCO_Viking_C
// 0x7B40 (0x7EB0 - 0x0370)
class UABP_PostProcess_HairVar_MONOCO_Viking_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x0390(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x0B30(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x12D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x1A70(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x2210(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x29B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x3150(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x38F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x4090(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x4830(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x4FD0(0x07A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x5770(0x00B8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x5828(0x0020)()
	uint8                                         Pad_5848[0x8];                                     // 0x5848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x5850(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x5FF0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x6790(0x07A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x6F30(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x6F50(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x6F70(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x7710(0x07A0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_06D9458C43C6BB9DE3715D99ADF20F77();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_17DA22494C9B5457C02DFF9BBFA440D9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_2FDB3B5C42504476C561CE8214AD8EEE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_56501A644EFA7544E33237A63ACE2A6F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_5B9183E24095F183DA51E19336122AB9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_6707C9024A56248CF736FEA56590C5CD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_6B76AB224458F6EC316F35BEB3F5C6FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_70DD793642FE31042F6233A27B114E9A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_846F0149454693C2F9C6039E66E9B82C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_859F721C4FBDC658043B24A5C0B09062();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_A2B0C9BE450647A86C4B0F945D42F70C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_BF6BF6F4423B818BA89E8999D9EB639C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_CF3F721D414598AD13E94C97AC35B2EE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_E5A1CDC04BB037C2CB1701AC4C0CE8EF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_F9E02BD84B781808665E8BA63C31FEAB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking_AnimGraphNode_KawaiiPhysics_FC5DEF654154B7CAA54210A0D8B6D08C();
	void ExecuteUbergraph_ABP_PostProcess_HairVar_MONOCO_Viking(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_HairVar_MONOCO_Viking_C">();
	}
	static class UABP_PostProcess_HairVar_MONOCO_Viking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_HairVar_MONOCO_Viking_C>();
	}
};
static_assert(alignof(UABP_PostProcess_HairVar_MONOCO_Viking_C) == 0x000010, "Wrong alignment on UABP_PostProcess_HairVar_MONOCO_Viking_C");
static_assert(sizeof(UABP_PostProcess_HairVar_MONOCO_Viking_C) == 0x007EB0, "Wrong size on UABP_PostProcess_HairVar_MONOCO_Viking_C");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_15) == 0x000390, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_14) == 0x000B30, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_13) == 0x0012D0, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_12) == 0x001A70, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_11) == 0x002210, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_10) == 0x0029B0, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_9) == 0x003150, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_8) == 0x0038F0, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_7) == 0x004090, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_6) == 0x004830, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_5) == 0x004FD0, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_LinkedInputPose) == 0x005770, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_ComponentToLocalSpace) == 0x005828, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_4) == 0x005850, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_3) == 0x005FF0, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_2) == 0x006790, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_LocalToComponentSpace) == 0x006F30, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_Root) == 0x006F50, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics_1) == 0x006F70, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_HairVar_MONOCO_Viking_C, AnimGraphNode_KawaiiPhysics) == 0x007710, "Member 'UABP_PostProcess_HairVar_MONOCO_Viking_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

