#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PostProcess_PotatoBagCanon

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PostProcess_PotatoBagCanon.ABP_PostProcess_PotatoBagCanon_C
// 0x4610 (0x4980 - 0x0370)
class UABP_PostProcess_PotatoBagCanon_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x0390(0x07A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0B30(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0B50(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0B70(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0C28(0x0020)()
	uint8                                         Pad_C48[0x8];                                      // 0x0C48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x0C50(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x13F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x1B90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x2330(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x2AD0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x3270(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x3A10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x41B0(0x07A0)()
	struct FKawaiiPhysicsSettings                 Physics_Settings_Upperbody;                        // 0x4950(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 Physics_Settings_Legs;                             // 0x4968(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_ABP_PostProcess_PotatoBagCanon(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PostProcess_PotatoBagCanon_C">();
	}
	static class UABP_PostProcess_PotatoBagCanon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PostProcess_PotatoBagCanon_C>();
	}
};
static_assert(alignof(UABP_PostProcess_PotatoBagCanon_C) == 0x000010, "Wrong alignment on UABP_PostProcess_PotatoBagCanon_C");
static_assert(sizeof(UABP_PostProcess_PotatoBagCanon_C) == 0x004980, "Wrong size on UABP_PostProcess_PotatoBagCanon_C");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, UberGraphFrame) == 0x000370, "Member 'UABP_PostProcess_PotatoBagCanon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_KawaiiPhysics_8) == 0x000390, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_LocalToComponentSpace) == 0x000B30, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_ComponentToLocalSpace) == 0x000B50, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_LinkedInputPose) == 0x000B70, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_Root) == 0x000C28, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_KawaiiPhysics_7) == 0x000C50, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_KawaiiPhysics_6) == 0x0013F0, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_KawaiiPhysics_5) == 0x001B90, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_KawaiiPhysics_4) == 0x002330, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_KawaiiPhysics_3) == 0x002AD0, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_KawaiiPhysics_2) == 0x003270, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_KawaiiPhysics_1) == 0x003A10, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, AnimGraphNode_KawaiiPhysics) == 0x0041B0, "Member 'UABP_PostProcess_PotatoBagCanon_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, Physics_Settings_Upperbody) == 0x004950, "Member 'UABP_PostProcess_PotatoBagCanon_C::Physics_Settings_Upperbody' has a wrong offset!");
static_assert(offsetof(UABP_PostProcess_PotatoBagCanon_C, Physics_Settings_Legs) == 0x004968, "Member 'UABP_PostProcess_PotatoBagCanon_C::Physics_Settings_Legs' has a wrong offset!");

}

