#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Buff_EndSliceForetellConsumedCount

#include "Basic.hpp"

#include "EBattleContext_structs.hpp"


namespace SDK::Params
{

// Function BP_Buff_EndSliceForetellConsumedCount.BP_Buff_EndSliceForetellConsumedCount_C.ActivateBuff
// 0x0008 (0x0008 - 0x0000)
struct BP_Buff_EndSliceForetellConsumedCount_C_ActivateBuff final
{
public:
	const class UAC_jRPG_CharacterBattleStats_C*  CharacterStats;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Buff_EndSliceForetellConsumedCount_C_ActivateBuff) == 0x000008, "Wrong alignment on BP_Buff_EndSliceForetellConsumedCount_C_ActivateBuff");
static_assert(sizeof(BP_Buff_EndSliceForetellConsumedCount_C_ActivateBuff) == 0x000008, "Wrong size on BP_Buff_EndSliceForetellConsumedCount_C_ActivateBuff");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ActivateBuff, CharacterStats) == 0x000000, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ActivateBuff::CharacterStats' has a wrong offset!");

// Function BP_Buff_EndSliceForetellConsumedCount.BP_Buff_EndSliceForetellConsumedCount_C.ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount
// 0x0050 (0x0050 - 0x0000)
struct BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAC_jRPG_CharacterBattleStats_C* TargetStats, int32 PreviousForetell, int32 ForetellConsumed, EBattleContext Reason)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAC_jRPG_CharacterBattleStats_C*  K2Node_Event_CharacterStats;                       // 0x0018(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        K2Node_CustomEvent_TargetStats;                    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PreviousForetell;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ForetellConsumed;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleContext                                K2Node_CustomEvent_Reason;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_UniqueMechanic_Foretell_Component_C* CallFunc_GetComponentByClass_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount) == 0x000008, "Wrong alignment on BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount");
static_assert(sizeof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount) == 0x000050, "Wrong size on BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount, EntryPoint) == 0x000000, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount, K2Node_Event_CharacterStats) == 0x000018, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount::K2Node_Event_CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount, K2Node_CustomEvent_TargetStats) == 0x000020, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount::K2Node_CustomEvent_TargetStats' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount, K2Node_CustomEvent_PreviousForetell) == 0x000028, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount::K2Node_CustomEvent_PreviousForetell' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount, K2Node_CustomEvent_ForetellConsumed) == 0x00002C, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount::K2Node_CustomEvent_ForetellConsumed' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount, K2Node_CustomEvent_Reason) == 0x000030, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount::K2Node_CustomEvent_Reason' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000038, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount, CallFunc_GetCharacterBattleBase_IsValid) == 0x000040, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ExecuteUbergraph_BP_Buff_EndSliceForetellConsumedCount::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_Buff_EndSliceForetellConsumedCount.BP_Buff_EndSliceForetellConsumedCount_C.ForetellConsumedCount
// 0x0018 (0x0018 - 0x0000)
struct BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        TargetStats;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousForetell;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ForetellConsumed;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleContext                                Reason;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount) == 0x000008, "Wrong alignment on BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount");
static_assert(sizeof(BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount) == 0x000018, "Wrong size on BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount, TargetStats) == 0x000000, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount::TargetStats' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount, PreviousForetell) == 0x000008, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount::PreviousForetell' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount, ForetellConsumed) == 0x00000C, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount::ForetellConsumed' has a wrong offset!");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount, Reason) == 0x000010, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_ForetellConsumedCount::Reason' has a wrong offset!");

// Function BP_Buff_EndSliceForetellConsumedCount.BP_Buff_EndSliceForetellConsumedCount_C.GetForetellConsumedAmount
// 0x0004 (0x0004 - 0x0000)
struct BP_Buff_EndSliceForetellConsumedCount_C_GetForetellConsumedAmount final
{
public:
	int32                                         ForetellConsumedAmount_0;                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Buff_EndSliceForetellConsumedCount_C_GetForetellConsumedAmount) == 0x000004, "Wrong alignment on BP_Buff_EndSliceForetellConsumedCount_C_GetForetellConsumedAmount");
static_assert(sizeof(BP_Buff_EndSliceForetellConsumedCount_C_GetForetellConsumedAmount) == 0x000004, "Wrong size on BP_Buff_EndSliceForetellConsumedCount_C_GetForetellConsumedAmount");
static_assert(offsetof(BP_Buff_EndSliceForetellConsumedCount_C_GetForetellConsumedAmount, ForetellConsumedAmount_0) == 0x000000, "Member 'BP_Buff_EndSliceForetellConsumedCount_C_GetForetellConsumedAmount::ForetellConsumedAmount_0' has a wrong offset!");

}

