#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_buoyancy_component

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_buoyancy_component.BP_buoyancy_component_C.ExecuteUbergraph_BP_buoyancy_component
// 0x03B0 (0x03B0 - 0x0000)
struct BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_2;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_3;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_4;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Sin_ReturnValue;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Cos_ReturnValue;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_8;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_9;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_10;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Sin_ReturnValue_1;                        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0190(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_11;     // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_5;           // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x02B0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component) == 0x000008, "Wrong alignment on BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component");
static_assert(sizeof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component) == 0x0003B0, "Wrong size on BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, EntryPoint) == 0x000000, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_BreakVector_X) == 0x000008, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_BreakVector_Z) == 0x000018, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_GetTimeSeconds_ReturnValue) == 0x000020, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_GetOwner_ReturnValue_1) == 0x000040, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000048, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000050, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000058, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, K2Node_Event_DeltaSeconds) == 0x000070, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_BreakRotator_Roll) == 0x000074, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_BreakRotator_Pitch) == 0x000078, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_BreakRotator_Yaw) == 0x00007C, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000080, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000088, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000090, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_GetOwner_ReturnValue_2) == 0x000098, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_GetOwner_ReturnValue_3) == 0x0000A0, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_K2_GetRootComponent_ReturnValue_2) == 0x0000A8, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_K2_GetRootComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_K2_GetRootComponent_ReturnValue_3) == 0x0000B0, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_K2_GetRootComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_GetOwner_ReturnValue_4) == 0x0000B8, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_K2_GetRootComponent_ReturnValue_4) == 0x0000C0, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_K2_GetRootComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000D0, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0000E8, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Sin_ReturnValue) == 0x0000F0, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_BreakVector_X_1) == 0x0000F8, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_BreakVector_Y_1) == 0x000100, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_BreakVector_Z_1) == 0x000108, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000110, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000118, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000120, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000128, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000130, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000138, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x000140, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Cos_ReturnValue) == 0x000148, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Multiply_DoubleDouble_ReturnValue_8) == 0x000150, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Multiply_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x000158, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Multiply_DoubleDouble_ReturnValue_9) == 0x000160, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Multiply_DoubleDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Multiply_DoubleDouble_ReturnValue_10) == 0x000168, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Multiply_DoubleDouble_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_MakeRotator_ReturnValue) == 0x000170, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Sin_ReturnValue_1) == 0x000188, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Sin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000190, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Multiply_DoubleDouble_ReturnValue_11) == 0x000288, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Multiply_DoubleDouble_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_Add_DoubleDouble_ReturnValue_5) == 0x000290, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_Add_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_MakeVector_ReturnValue) == 0x000298, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0002B0, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0003A8, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0003AC, "Member 'BP_buoyancy_component_C_ExecuteUbergraph_BP_buoyancy_component::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");

// Function BP_buoyancy_component.BP_buoyancy_component_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_buoyancy_component_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_buoyancy_component_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_buoyancy_component_C_ReceiveTick");
static_assert(sizeof(BP_buoyancy_component_C_ReceiveTick) == 0x000004, "Wrong size on BP_buoyancy_component_C_ReceiveTick");
static_assert(offsetof(BP_buoyancy_component_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_buoyancy_component_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

