#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_buoyancy_component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_buoyancy_component.BP_buoyancy_component_C
// 0x0038 (0x00D8 - 0x00A0)
class UBP_buoyancy_component_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        WavesSpeed;                                        // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WavesIntensity;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SeedBoat;                                          // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SaveActorLocation;                                 // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_buoyancy_component(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_buoyancy_component_C">();
	}
	static class UBP_buoyancy_component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_buoyancy_component_C>();
	}
};
static_assert(alignof(UBP_buoyancy_component_C) == 0x000008, "Wrong alignment on UBP_buoyancy_component_C");
static_assert(sizeof(UBP_buoyancy_component_C) == 0x0000D8, "Wrong size on UBP_buoyancy_component_C");
static_assert(offsetof(UBP_buoyancy_component_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_buoyancy_component_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_buoyancy_component_C, WavesSpeed) == 0x0000A8, "Member 'UBP_buoyancy_component_C::WavesSpeed' has a wrong offset!");
static_assert(offsetof(UBP_buoyancy_component_C, WavesIntensity) == 0x0000B0, "Member 'UBP_buoyancy_component_C::WavesIntensity' has a wrong offset!");
static_assert(offsetof(UBP_buoyancy_component_C, SeedBoat) == 0x0000B8, "Member 'UBP_buoyancy_component_C::SeedBoat' has a wrong offset!");
static_assert(offsetof(UBP_buoyancy_component_C, SaveActorLocation) == 0x0000C0, "Member 'UBP_buoyancy_component_C::SaveActorLocation' has a wrong offset!");

}

