#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleEvent_ForetellChargeChange

#include "Basic.hpp"

#include "E_UniqueMechanic_Foretell_ChargeType_structs.hpp"
#include "EBattleContext_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleEvent_ForetellChargeChange.BP_BattleEvent_ForetellChargeChange_C.ChangeChargeType
// 0x0020 (0x0020 - 0x0000)
struct BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType final
{
public:
	E_UniqueMechanic_Foretell_ChargeType          PreviousChargeType;                                // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UniqueMechanic_Foretell_ChargeType          NewChargeType;                                     // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SumWithExistingCharges;                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         local_finalChargesCount;                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value_1;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType) == 0x000004, "Wrong alignment on BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType");
static_assert(sizeof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType) == 0x000020, "Wrong size on BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType, PreviousChargeType) == 0x000000, "Member 'BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType::PreviousChargeType' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType, NewChargeType) == 0x000001, "Member 'BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType::NewChargeType' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType, SumWithExistingCharges) == 0x000002, "Member 'BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType::SumWithExistingCharges' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType, local_finalChargesCount) == 0x000004, "Member 'BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType::local_finalChargesCount' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000008, "Member 'BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType, CallFunc_Map_Remove_ReturnValue) == 0x000009, "Member 'BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType, CallFunc_Map_Find_Value) == 0x00000C, "Member 'BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType, CallFunc_Map_Find_Value_1) == 0x000018, "Member 'BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType, CallFunc_Map_Find_ReturnValue_1) == 0x00001C, "Member 'BP_BattleEvent_ForetellChargeChange_C_ChangeChargeType::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

// Function BP_BattleEvent_ForetellChargeChange.BP_BattleEvent_ForetellChargeChange_C.EnsureCanChange
// 0x0002 (0x0002 - 0x0000)
struct BP_BattleEvent_ForetellChargeChange_C_EnsureCanChange final
{
public:
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_ForetellChargeChange_C_EnsureCanChange) == 0x000001, "Wrong alignment on BP_BattleEvent_ForetellChargeChange_C_EnsureCanChange");
static_assert(sizeof(BP_BattleEvent_ForetellChargeChange_C_EnsureCanChange) == 0x000002, "Wrong size on BP_BattleEvent_ForetellChargeChange_C_EnsureCanChange");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_EnsureCanChange, CallFunc_IsPackagedBuild_ReturnValue) == 0x000000, "Member 'BP_BattleEvent_ForetellChargeChange_C_EnsureCanChange::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_EnsureCanChange, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_BattleEvent_ForetellChargeChange_C_EnsureCanChange::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_BattleEvent_ForetellChargeChange.BP_BattleEvent_ForetellChargeChange_C.GetChangeReason
// 0x0001 (0x0001 - 0x0000)
struct BP_BattleEvent_ForetellChargeChange_C_GetChangeReason final
{
public:
	EBattleContext                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_ForetellChargeChange_C_GetChangeReason) == 0x000001, "Wrong alignment on BP_BattleEvent_ForetellChargeChange_C_GetChangeReason");
static_assert(sizeof(BP_BattleEvent_ForetellChargeChange_C_GetChangeReason) == 0x000001, "Wrong size on BP_BattleEvent_ForetellChargeChange_C_GetChangeReason");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_GetChangeReason, ReturnValue) == 0x000000, "Member 'BP_BattleEvent_ForetellChargeChange_C_GetChangeReason::ReturnValue' has a wrong offset!");

// Function BP_BattleEvent_ForetellChargeChange.BP_BattleEvent_ForetellChargeChange_C.GetCurrentChargesDelta
// 0x0050 (0x0050 - 0x0000)
struct BP_BattleEvent_ForetellChargeChange_C_GetCurrentChargesDelta final
{
public:
	TMap<E_UniqueMechanic_Foretell_ChargeType, int32> ReturnValue;                                   // 0x0000(0x0050)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_BattleEvent_ForetellChargeChange_C_GetCurrentChargesDelta) == 0x000008, "Wrong alignment on BP_BattleEvent_ForetellChargeChange_C_GetCurrentChargesDelta");
static_assert(sizeof(BP_BattleEvent_ForetellChargeChange_C_GetCurrentChargesDelta) == 0x000050, "Wrong size on BP_BattleEvent_ForetellChargeChange_C_GetCurrentChargesDelta");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_GetCurrentChargesDelta, ReturnValue) == 0x000000, "Member 'BP_BattleEvent_ForetellChargeChange_C_GetCurrentChargesDelta::ReturnValue' has a wrong offset!");

// Function BP_BattleEvent_ForetellChargeChange.BP_BattleEvent_ForetellChargeChange_C.GetInitialChargesDelta
// 0x0050 (0x0050 - 0x0000)
struct BP_BattleEvent_ForetellChargeChange_C_GetInitialChargesDelta final
{
public:
	TMap<E_UniqueMechanic_Foretell_ChargeType, int32> ReturnValue;                                   // 0x0000(0x0050)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_BattleEvent_ForetellChargeChange_C_GetInitialChargesDelta) == 0x000008, "Wrong alignment on BP_BattleEvent_ForetellChargeChange_C_GetInitialChargesDelta");
static_assert(sizeof(BP_BattleEvent_ForetellChargeChange_C_GetInitialChargesDelta) == 0x000050, "Wrong size on BP_BattleEvent_ForetellChargeChange_C_GetInitialChargesDelta");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_GetInitialChargesDelta, ReturnValue) == 0x000000, "Member 'BP_BattleEvent_ForetellChargeChange_C_GetInitialChargesDelta::ReturnValue' has a wrong offset!");

// Function BP_BattleEvent_ForetellChargeChange.BP_BattleEvent_ForetellChargeChange_C.OverrideChargesDelta
// 0x0050 (0x0050 - 0x0000)
struct BP_BattleEvent_ForetellChargeChange_C_OverrideChargesDelta final
{
public:
	TMap<E_UniqueMechanic_Foretell_ChargeType, int32> NewCharges;                                    // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_BattleEvent_ForetellChargeChange_C_OverrideChargesDelta) == 0x000008, "Wrong alignment on BP_BattleEvent_ForetellChargeChange_C_OverrideChargesDelta");
static_assert(sizeof(BP_BattleEvent_ForetellChargeChange_C_OverrideChargesDelta) == 0x000050, "Wrong size on BP_BattleEvent_ForetellChargeChange_C_OverrideChargesDelta");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_OverrideChargesDelta, NewCharges) == 0x000000, "Member 'BP_BattleEvent_ForetellChargeChange_C_OverrideChargesDelta::NewCharges' has a wrong offset!");

// Function BP_BattleEvent_ForetellChargeChange.BP_BattleEvent_ForetellChargeChange_C.RemoveChargeType
// 0x0002 (0x0002 - 0x0000)
struct BP_BattleEvent_ForetellChargeChange_C_RemoveChargeType final
{
public:
	E_UniqueMechanic_Foretell_ChargeType          ChargeType;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_ForetellChargeChange_C_RemoveChargeType) == 0x000001, "Wrong alignment on BP_BattleEvent_ForetellChargeChange_C_RemoveChargeType");
static_assert(sizeof(BP_BattleEvent_ForetellChargeChange_C_RemoveChargeType) == 0x000002, "Wrong size on BP_BattleEvent_ForetellChargeChange_C_RemoveChargeType");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_RemoveChargeType, ChargeType) == 0x000000, "Member 'BP_BattleEvent_ForetellChargeChange_C_RemoveChargeType::ChargeType' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_RemoveChargeType, CallFunc_Map_Remove_ReturnValue) == 0x000001, "Member 'BP_BattleEvent_ForetellChargeChange_C_RemoveChargeType::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");

// Function BP_BattleEvent_ForetellChargeChange.BP_BattleEvent_ForetellChargeChange_C.SetChargeQuantity
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleEvent_ForetellChargeChange_C_SetChargeQuantity final
{
public:
	E_UniqueMechanic_Foretell_ChargeType          ChargeType;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewQuantity;                                       // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleEvent_ForetellChargeChange_C_SetChargeQuantity) == 0x000004, "Wrong alignment on BP_BattleEvent_ForetellChargeChange_C_SetChargeQuantity");
static_assert(sizeof(BP_BattleEvent_ForetellChargeChange_C_SetChargeQuantity) == 0x000008, "Wrong size on BP_BattleEvent_ForetellChargeChange_C_SetChargeQuantity");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_SetChargeQuantity, ChargeType) == 0x000000, "Member 'BP_BattleEvent_ForetellChargeChange_C_SetChargeQuantity::ChargeType' has a wrong offset!");
static_assert(offsetof(BP_BattleEvent_ForetellChargeChange_C_SetChargeQuantity, NewQuantity) == 0x000004, "Member 'BP_BattleEvent_ForetellChargeChange_C_SetChargeQuantity::NewQuantity' has a wrong offset!");

}

