#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleBuff_Foretell_Charge_Sun

#include "Basic.hpp"

#include "EBattleContext_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleBuff_Foretell_Charge_Sun.BP_BattleBuff_Foretell_Charge_Sun_C.ActivateBuff
// 0x0008 (0x0008 - 0x0000)
struct BP_BattleBuff_Foretell_Charge_Sun_C_ActivateBuff final
{
public:
	const class UAC_jRPG_CharacterBattleStats_C*  CharacterStats;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Foretell_Charge_Sun_C_ActivateBuff) == 0x000008, "Wrong alignment on BP_BattleBuff_Foretell_Charge_Sun_C_ActivateBuff");
static_assert(sizeof(BP_BattleBuff_Foretell_Charge_Sun_C_ActivateBuff) == 0x000008, "Wrong size on BP_BattleBuff_Foretell_Charge_Sun_C_ActivateBuff");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ActivateBuff, CharacterStats) == 0x000000, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ActivateBuff::CharacterStats' has a wrong offset!");

// Function BP_BattleBuff_Foretell_Charge_Sun.BP_BattleBuff_Foretell_Charge_Sun_C.ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun
// 0x0058 (0x0058 - 0x0000)
struct BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_CharacterBattleStats_C*        K2Node_CustomEvent_TargetStats;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PreviousForetell;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ForetellConsumed;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleContext                                K2Node_CustomEvent_Reason;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAC_jRPG_CharacterBattleStats_C* TargetStats, int32 PreviousForetell, int32 ForetellConsumed, EBattleContext Reason)> K2Node_CreateDelegate_OutputDelegate; // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAC_jRPG_CharacterBattleStats_C*  K2Node_Event_CharacterStats;                       // 0x0030(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UniqueMechanic_Foretell_Component_C* CallFunc_GetComponentByClass_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSunAPGainMultiplier_ReturnValue;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun) == 0x000008, "Wrong alignment on BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun");
static_assert(sizeof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun) == 0x000058, "Wrong size on BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, EntryPoint) == 0x000000, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, K2Node_CustomEvent_TargetStats) == 0x000008, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::K2Node_CustomEvent_TargetStats' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, K2Node_CustomEvent_PreviousForetell) == 0x000010, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::K2Node_CustomEvent_PreviousForetell' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, K2Node_CustomEvent_ForetellConsumed) == 0x000014, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::K2Node_CustomEvent_ForetellConsumed' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, K2Node_CustomEvent_Reason) == 0x000018, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::K2Node_CustomEvent_Reason' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002C, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, K2Node_Event_CharacterStats) == 0x000030, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::K2Node_Event_CharacterStats' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000038, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, CallFunc_GetCharacterBattleBase_IsValid) == 0x000040, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, CallFunc_GetSunAPGainMultiplier_ReturnValue) == 0x000050, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::CallFunc_GetSunAPGainMultiplier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun, CallFunc_Multiply_IntInt_ReturnValue) == 0x000054, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_ExecuteUbergraph_BP_BattleBuff_Foretell_Charge_Sun::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");

// Function BP_BattleBuff_Foretell_Charge_Sun.BP_BattleBuff_Foretell_Charge_Sun_C.SunAPGainOnForetellConsumed
// 0x0018 (0x0018 - 0x0000)
struct BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        TargetStats;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousForetell;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ForetellConsumed;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleContext                                Reason;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed) == 0x000008, "Wrong alignment on BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed");
static_assert(sizeof(BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed) == 0x000018, "Wrong size on BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed, TargetStats) == 0x000000, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed::TargetStats' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed, PreviousForetell) == 0x000008, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed::PreviousForetell' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed, ForetellConsumed) == 0x00000C, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed::ForetellConsumed' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed, Reason) == 0x000010, "Member 'BP_BattleBuff_Foretell_Charge_Sun_C_SunAPGainOnForetellConsumed::Reason' has a wrong offset!");

}

