#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleBuff_Foretell_Charge_Twilight

#include "Basic.hpp"

#include "FDamageModifier_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleBuff_Foretell_Charge_Twilight.BP_BattleBuff_Foretell_Charge_Twilight_C.ProcessDealtRawDamages
// 0x0058 (0x0058 - 0x0000)
struct BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages final
{
public:
	class UBP_BattleDamages_C*                    BattleDamages;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Out;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UniqueMechanic_Foretell_Component_C* CallFunc_GetComponentByClass_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTwilightDamageBonusForChargeCount_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFDamageModifier                       K2Node_MakeStruct_FDamageModifier;                 // 0x0030(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages) == 0x000008, "Wrong alignment on BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages");
static_assert(sizeof(BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages) == 0x000058, "Wrong size on BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages, BattleDamages) == 0x000000, "Member 'BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages::BattleDamages' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages, Out) == 0x000008, "Member 'BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages::Out' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages, CallFunc_GetTwilightDamageBonusForChargeCount_ReturnValue) == 0x000020, "Member 'BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages::CallFunc_GetTwilightDamageBonusForChargeCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages, K2Node_MakeStruct_FDamageModifier) == 0x000030, "Member 'BP_BattleBuff_Foretell_Charge_Twilight_C_ProcessDealtRawDamages::K2Node_MakeStruct_FDamageModifier' has a wrong offset!");

}

