#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Boat_2

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Boat_2.BP_Boat_2_C
// 0x0020 (0x02B0 - 0x0290)
class ABP_Boat_2_C final : public AActor
{
public:
	class UBP_FluxDataComponent_C*                BP_FluxDataComponent;                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FluxInteractionComponent_C*         BP_FluxInteractionComponent;                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FluxBuoyancyComponent_C*            BP_FluxBuoyancyComponent;                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Boat;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Boat_2_C">();
	}
	static class ABP_Boat_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Boat_2_C>();
	}
};
static_assert(alignof(ABP_Boat_2_C) == 0x000008, "Wrong alignment on ABP_Boat_2_C");
static_assert(sizeof(ABP_Boat_2_C) == 0x0002B0, "Wrong size on ABP_Boat_2_C");
static_assert(offsetof(ABP_Boat_2_C, BP_FluxDataComponent) == 0x000290, "Member 'ABP_Boat_2_C::BP_FluxDataComponent' has a wrong offset!");
static_assert(offsetof(ABP_Boat_2_C, BP_FluxInteractionComponent) == 0x000298, "Member 'ABP_Boat_2_C::BP_FluxInteractionComponent' has a wrong offset!");
static_assert(offsetof(ABP_Boat_2_C, BP_FluxBuoyancyComponent) == 0x0002A0, "Member 'ABP_Boat_2_C::BP_FluxBuoyancyComponent' has a wrong offset!");
static_assert(offsetof(ABP_Boat_2_C, Boat) == 0x0002A8, "Member 'ABP_Boat_2_C::Boat' has a wrong offset!");

}

