#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Character_Camp_Lune_CivlianLumiereIntro

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Character_Camp_Lune_CivlianLumiereIntro.BP_Character_Camp_Lune_CivlianLumiereIntro_C.ExecuteUbergraph_BP_Character_Camp_Lune_CivlianLumiereIntro
// 0x0004 (0x0004 - 0x0000)
struct BP_Character_Camp_Lune_CivlianLumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Lune_CivlianLumiereIntro final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_Camp_Lune_CivlianLumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Lune_CivlianLumiereIntro) == 0x000004, "Wrong alignment on BP_Character_Camp_Lune_CivlianLumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Lune_CivlianLumiereIntro");
static_assert(sizeof(BP_Character_Camp_Lune_CivlianLumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Lune_CivlianLumiereIntro) == 0x000004, "Wrong size on BP_Character_Camp_Lune_CivlianLumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Lune_CivlianLumiereIntro");
static_assert(offsetof(BP_Character_Camp_Lune_CivlianLumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Lune_CivlianLumiereIntro, EntryPoint) == 0x000000, "Member 'BP_Character_Camp_Lune_CivlianLumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Lune_CivlianLumiereIntro::EntryPoint' has a wrong offset!");

// Function BP_Character_Camp_Lune_CivlianLumiereIntro.BP_Character_Camp_Lune_CivlianLumiereIntro_C.IsInteractionAvailable
// 0x0001 (0x0001 - 0x0000)
struct BP_Character_Camp_Lune_CivlianLumiereIntro_C_IsInteractionAvailable final
{
public:
	bool                                          Available;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_Camp_Lune_CivlianLumiereIntro_C_IsInteractionAvailable) == 0x000001, "Wrong alignment on BP_Character_Camp_Lune_CivlianLumiereIntro_C_IsInteractionAvailable");
static_assert(sizeof(BP_Character_Camp_Lune_CivlianLumiereIntro_C_IsInteractionAvailable) == 0x000001, "Wrong size on BP_Character_Camp_Lune_CivlianLumiereIntro_C_IsInteractionAvailable");
static_assert(offsetof(BP_Character_Camp_Lune_CivlianLumiereIntro_C_IsInteractionAvailable, Available) == 0x000000, "Member 'BP_Character_Camp_Lune_CivlianLumiereIntro_C_IsInteractionAvailable::Available' has a wrong offset!");

}

