#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Character_MaelleIntroRun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Character_MaelleIntroRun.BP_Character_MaelleIntroRun_C.ExecuteUbergraph_BP_Character_MaelleIntroRun
// 0x0458 (0x0458 - 0x0000)
struct BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_HorizontalCorrection;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_VerticalCorrection;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0088(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0290(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun) == 0x000008, "Wrong alignment on BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun");
static_assert(sizeof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun) == 0x000458, "Wrong size on BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, EntryPoint) == 0x000000, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000008, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, K2Node_CustomEvent_HorizontalCorrection) == 0x000010, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::K2Node_CustomEvent_HorizontalCorrection' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, K2Node_CustomEvent_VerticalCorrection) == 0x000018, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::K2Node_CustomEvent_VerticalCorrection' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000038, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000050, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_RandomFloatInRange_ReturnValue) == 0x000068, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_MakeRotator_ReturnValue) == 0x000070, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000088, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000180, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000198, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0001B0, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0001C8, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001D0, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_VSize_ReturnValue) == 0x0001E8, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Normal_ReturnValue) == 0x0001F0, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000208, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000210, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Add_VectorVector_ReturnValue) == 0x000228, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_FindLookAtRotation_ReturnValue) == 0x000240, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000258, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000260, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x000278, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000290, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_GetSocketRotation_ReturnValue) == 0x000388, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_GetRightVector_ReturnValue) == 0x0003A0, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_GetForwardVector_ReturnValue) == 0x0003B8, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0003D0, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0003E8, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000400, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000418, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000430, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x000448, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000450, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000454, "Member 'BP_Character_MaelleIntroRun_C_ExecuteUbergraph_BP_Character_MaelleIntroRun::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");

// Function BP_Character_MaelleIntroRun.BP_Character_MaelleIntroRun_C.Grappling FX
// 0x0010 (0x0010 - 0x0000)
struct BP_Character_MaelleIntroRun_C_Grappling_FX final
{
public:
	float                                         HorizontalCorrection;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        VerticalCorrection;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MaelleIntroRun_C_Grappling_FX) == 0x000008, "Wrong alignment on BP_Character_MaelleIntroRun_C_Grappling_FX");
static_assert(sizeof(BP_Character_MaelleIntroRun_C_Grappling_FX) == 0x000010, "Wrong size on BP_Character_MaelleIntroRun_C_Grappling_FX");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_Grappling_FX, HorizontalCorrection) == 0x000000, "Member 'BP_Character_MaelleIntroRun_C_Grappling_FX::HorizontalCorrection' has a wrong offset!");
static_assert(offsetof(BP_Character_MaelleIntroRun_C_Grappling_FX, VerticalCorrection) == 0x000008, "Member 'BP_Character_MaelleIntroRun_C_Grappling_FX::VerticalCorrection' has a wrong offset!");

}

