#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Character_MaelleIntroRun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Character_MaelleIntroRun.BP_Character_MaelleIntroRun_C
// 0x0068 (0x02F8 - 0x0290)
class ABP_Character_MaelleIntroRun_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        GrapplingFXHolder;                                 // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_GrappleRope02;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_GrappleRope01;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_GrappleRope03;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Maelle_Hair_skl;                                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Maelle_v2_FaceMesh;                                // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Maelle_Sophie_Skin;                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Grapple_Location;                                  // 0x02D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         XAlignment;                                        // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Character_MaelleIntroRun(int32 EntryPoint);
	void Grappling_FX(float HorizontalCorrection, double VerticalCorrection);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Character_MaelleIntroRun_C">();
	}
	static class ABP_Character_MaelleIntroRun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Character_MaelleIntroRun_C>();
	}
};
static_assert(alignof(ABP_Character_MaelleIntroRun_C) == 0x000008, "Wrong alignment on ABP_Character_MaelleIntroRun_C");
static_assert(sizeof(ABP_Character_MaelleIntroRun_C) == 0x0002F8, "Wrong size on ABP_Character_MaelleIntroRun_C");
static_assert(offsetof(ABP_Character_MaelleIntroRun_C, UberGraphFrame) == 0x000290, "Member 'ABP_Character_MaelleIntroRun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Character_MaelleIntroRun_C, GrapplingFXHolder) == 0x000298, "Member 'ABP_Character_MaelleIntroRun_C::GrapplingFXHolder' has a wrong offset!");
static_assert(offsetof(ABP_Character_MaelleIntroRun_C, FX_GrappleRope02) == 0x0002A0, "Member 'ABP_Character_MaelleIntroRun_C::FX_GrappleRope02' has a wrong offset!");
static_assert(offsetof(ABP_Character_MaelleIntroRun_C, FX_GrappleRope01) == 0x0002A8, "Member 'ABP_Character_MaelleIntroRun_C::FX_GrappleRope01' has a wrong offset!");
static_assert(offsetof(ABP_Character_MaelleIntroRun_C, FX_GrappleRope03) == 0x0002B0, "Member 'ABP_Character_MaelleIntroRun_C::FX_GrappleRope03' has a wrong offset!");
static_assert(offsetof(ABP_Character_MaelleIntroRun_C, Maelle_Hair_skl) == 0x0002B8, "Member 'ABP_Character_MaelleIntroRun_C::Maelle_Hair_skl' has a wrong offset!");
static_assert(offsetof(ABP_Character_MaelleIntroRun_C, Maelle_v2_FaceMesh) == 0x0002C0, "Member 'ABP_Character_MaelleIntroRun_C::Maelle_v2_FaceMesh' has a wrong offset!");
static_assert(offsetof(ABP_Character_MaelleIntroRun_C, SK_Maelle_Sophie_Skin) == 0x0002C8, "Member 'ABP_Character_MaelleIntroRun_C::SK_Maelle_Sophie_Skin' has a wrong offset!");
static_assert(offsetof(ABP_Character_MaelleIntroRun_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_Character_MaelleIntroRun_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Character_MaelleIntroRun_C, Grapple_Location) == 0x0002D8, "Member 'ABP_Character_MaelleIntroRun_C::Grapple_Location' has a wrong offset!");
static_assert(offsetof(ABP_Character_MaelleIntroRun_C, XAlignment) == 0x0002F0, "Member 'ABP_Character_MaelleIntroRun_C::XAlignment' has a wrong offset!");

}

