#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "E_QuestStatus_structs.hpp"


namespace SDK::Params
{

// Function BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro.BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C.ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro
// 0x0028 (0x0028 - 0x0000)
struct BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue; // 0x0010(0x0010)(NoDestructor)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro) == 0x000008, "Wrong alignment on BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro");
static_assert(sizeof(BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro) == 0x000028, "Wrong size on BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro");
static_assert(offsetof(BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro, EntryPoint) == 0x000000, "Member 'BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro, CallFunc_GetQuestSystem_QuestSystem) == 0x000008, "Member 'BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");
static_assert(offsetof(BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue) == 0x000010, "Member 'BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro, CallFunc_GetObjectiveStatus_Status) == 0x000020, "Member 'BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro::CallFunc_GetObjectiveStatus_Status' has a wrong offset!");
static_assert(offsetof(BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro_C_ExecuteUbergraph_BP_Character_Camp_Maelle_CivilianIntroSkin_LumiereIntro::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

