#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Character_Camp_Main

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "BP_jRPG_NPC_Dialog_Human_ManyCams_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Character_Camp_Main.BP_Character_Camp_Main_C
// 0x0040 (0x0C00 - 0x0BC0)
class ABP_Character_Camp_Main_C : public ABP_jRPG_NPC_Dialog_Human_ManyCams_C
{
public:
	class UBP_CharacterVisualAlterationsComponent_C* BP_CharacterVisualAlterationsComponent;         // 0x0BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Eyelashes;                                         // 0x0BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Beard;                                             // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Mustache;                                          // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Eyebrows;                                          // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Haircut;                                        // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Haircut;                                        // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Face_0;                                            // 0x0BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CharacterTag;                                      // 0x0BF8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Character_Camp_Main_C">();
	}
	static class ABP_Character_Camp_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Character_Camp_Main_C>();
	}
};
static_assert(alignof(ABP_Character_Camp_Main_C) == 0x000010, "Wrong alignment on ABP_Character_Camp_Main_C");
static_assert(sizeof(ABP_Character_Camp_Main_C) == 0x000C00, "Wrong size on ABP_Character_Camp_Main_C");
static_assert(offsetof(ABP_Character_Camp_Main_C, BP_CharacterVisualAlterationsComponent) == 0x000BB8, "Member 'ABP_Character_Camp_Main_C::BP_CharacterVisualAlterationsComponent' has a wrong offset!");
static_assert(offsetof(ABP_Character_Camp_Main_C, Eyelashes) == 0x000BC0, "Member 'ABP_Character_Camp_Main_C::Eyelashes' has a wrong offset!");
static_assert(offsetof(ABP_Character_Camp_Main_C, Beard) == 0x000BC8, "Member 'ABP_Character_Camp_Main_C::Beard' has a wrong offset!");
static_assert(offsetof(ABP_Character_Camp_Main_C, Mustache) == 0x000BD0, "Member 'ABP_Character_Camp_Main_C::Mustache' has a wrong offset!");
static_assert(offsetof(ABP_Character_Camp_Main_C, Eyebrows) == 0x000BD8, "Member 'ABP_Character_Camp_Main_C::Eyebrows' has a wrong offset!");
static_assert(offsetof(ABP_Character_Camp_Main_C, SM_Haircut) == 0x000BE0, "Member 'ABP_Character_Camp_Main_C::SM_Haircut' has a wrong offset!");
static_assert(offsetof(ABP_Character_Camp_Main_C, SK_Haircut) == 0x000BE8, "Member 'ABP_Character_Camp_Main_C::SK_Haircut' has a wrong offset!");
static_assert(offsetof(ABP_Character_Camp_Main_C, Face_0) == 0x000BF0, "Member 'ABP_Character_Camp_Main_C::Face_0' has a wrong offset!");
static_assert(offsetof(ABP_Character_Camp_Main_C, CharacterTag) == 0x000BF8, "Member 'ABP_Character_Camp_Main_C::CharacterTag' has a wrong offset!");

}

