#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Eugene

#include "Basic.hpp"

#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_Eugene.BP_Dialogue_Eugene_C.ExecuteUbergraph_BP_Dialogue_Eugene
// 0x0568 (0x0568 - 0x0000)
struct BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0008(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0150(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x0288(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x02C8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x03F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x0410(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x0548(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0558(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0564(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene) == 0x000008, "Wrong alignment on BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene");
static_assert(sizeof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene) == 0x000568, "Wrong size on BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, EntryPoint) == 0x000000, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, K2Node_MakeStruct_FRichDialogueLine) == 0x000008, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, K2Node_MakeArray_Array) == 0x000138, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000148, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, K2Node_MakeStruct_FRichDialogueLine_1) == 0x000150, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_GetPlayerController_ReturnValue) == 0x000280, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, K2Node_MakeArray_Array_1) == 0x000288, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_GetComponentByClass_ReturnValue) == 0x000298, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_GetPlayerController_ReturnValue_1) == 0x0002A0, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0002A8, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0002B0, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_GetPlayerController_ReturnValue_2) == 0x0002B8, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0002C0, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, K2Node_MakeStruct_FRichDialogueLine_2) == 0x0002C8, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::K2Node_MakeStruct_FRichDialogueLine_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, K2Node_MakeArray_Array_2) == 0x0003F8, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000408, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, K2Node_MakeStruct_FRichDialogueLine_3) == 0x000410, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::K2Node_MakeStruct_FRichDialogueLine_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_GetPlayerController_ReturnValue_3) == 0x000540, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, K2Node_MakeArray_Array_3) == 0x000548, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000558, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, CallFunc_GetDialogueStage_DialogueStage) == 0x000560, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::CallFunc_GetDialogueStage_DialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene, K2Node_SwitchInteger_CmpSuccess) == 0x000564, "Member 'BP_Dialogue_Eugene_C_ExecuteUbergraph_BP_Dialogue_Eugene::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

