#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_ManorCanvasFamily

#include "Basic.hpp"

#include "S_jRPG_Item_StaticData_structs.hpp"
#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_ManorCanvasFamily.BP_Dialogue_ManorCanvasFamily_C.ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily
// 0x0890 (0x0890 - 0x0000)
struct BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_HasItemInInventory_Result;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0148(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0280(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x02A8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x03E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_2;                          // 0x03F8(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0418(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_422[0x6];                                      // 0x0422(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x0428(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x0558(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x0688(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_4;                          // 0x0698(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_4;        // 0x06B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x06B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_5;        // 0x06C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_4;             // 0x06D0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_5;                          // 0x0800(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ABP_NPC_Manor_FamilyCanvas_C*           K2Node_DynamicCast_AsBP_NPC_Manor_Family_Canvas;   // 0x0810(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0818(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_819[0x7];                                      // 0x0819(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0820(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0828(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GPE_ManorInsideDoor_C*              K2Node_DynamicCast_AsBP_GPE_Manor_Inside_Door;     // 0x0830(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GPE_ManorFamilyCanvas_C*            K2Node_DynamicCast_AsBP_GPE_Manor_Family_Canvas;   // 0x0840(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_849[0x3];                                      // 0x0849(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x084C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_851[0x7];                                      // 0x0851(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0858(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0860(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_869[0x7];                                      // 0x0869(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interaction_C>    CallFunc_OnInteractionRequested_self_CastInput;    // 0x0870(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Interaction_C>    CallFunc_OnInteractionRequested_self_CastInput_1;  // 0x0880(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily) == 0x000008, "Wrong alignment on BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily");
static_assert(sizeof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily) == 0x000890, "Wrong size on BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, EntryPoint) == 0x000000, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_HasItemInInventory_Result) == 0x000138, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_HasItemInInventory_Result' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_MakeLiteralByte_ReturnValue) == 0x000139, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetPlayerController_ReturnValue) == 0x000140, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_MakeStruct_FRichDialogueLine) == 0x000148, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetComponentByClass_ReturnValue) == 0x000278, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_MakeArray_Array) == 0x000280, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetPlayerController_ReturnValue_1) == 0x000290, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000298, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0002A0, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0002A1, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_MakeStruct_FRichDialogueLine_1) == 0x0002A8, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetPlayerController_ReturnValue_2) == 0x0003D8, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_MakeArray_Array_1) == 0x0003E0, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0003F0, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_MakeArray_Array_2) == 0x0003F8, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000408, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetPlayerController_ReturnValue_3) == 0x000410, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000418, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000420, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000421, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_MakeStruct_FRichDialogueLine_2) == 0x000428, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_MakeStruct_FRichDialogueLine_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_MakeStruct_FRichDialogueLine_3) == 0x000558, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_MakeStruct_FRichDialogueLine_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_MakeArray_Array_3) == 0x000688, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_MakeArray_Array_4) == 0x000698, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetPlayerController_ReturnValue_4) == 0x0006A8, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetComponentByClass_ReturnValue_4) == 0x0006B0, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetPlayerController_ReturnValue_5) == 0x0006B8, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetComponentByClass_ReturnValue_5) == 0x0006C0, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetComponentByClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x0006C8, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_MakeStruct_FRichDialogueLine_4) == 0x0006D0, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_MakeStruct_FRichDialogueLine_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_MakeArray_Array_5) == 0x000800, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_DynamicCast_AsBP_NPC_Manor_Family_Canvas) == 0x000810, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_DynamicCast_AsBP_NPC_Manor_Family_Canvas' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_DynamicCast_bSuccess) == 0x000818, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000820, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000828, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_DynamicCast_AsBP_GPE_Manor_Inside_Door) == 0x000830, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_DynamicCast_AsBP_GPE_Manor_Inside_Door' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_DynamicCast_bSuccess_1) == 0x000838, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_DynamicCast_AsBP_GPE_Manor_Family_Canvas) == 0x000840, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_DynamicCast_AsBP_GPE_Manor_Family_Canvas' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_DynamicCast_bSuccess_2) == 0x000848, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetDialogueStage_DialogueStage) == 0x00084C, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetDialogueStage_DialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_SwitchInteger_CmpSuccess) == 0x000850, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000858, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000860, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, K2Node_DynamicCast_bSuccess_3) == 0x000868, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_OnInteractionRequested_self_CastInput) == 0x000870, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_OnInteractionRequested_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily, CallFunc_OnInteractionRequested_self_CastInput_1) == 0x000880, "Member 'BP_Dialogue_ManorCanvasFamily_C_ExecuteUbergraph_BP_Dialogue_ManorCanvasFamily::CallFunc_OnInteractionRequested_self_CastInput_1' has a wrong offset!");

}

