#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Henri

#include "Basic.hpp"

#include "S_Dialogue_AnimationParameters_structs.hpp"
#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_Henri.BP_Dialogue_Henri_C.ExecuteUbergraph_BP_Dialogue_Henri
// 0x0F00 (0x0F00 - 0x0000)
struct BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters;  // 0x0008(0x00C8)(HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0108(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0240(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_5;        // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_6;        // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_7;        // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_1; // 0x02D0(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_2; // 0x0398(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0460(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x0590(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x06C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x06D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_3; // 0x06E0(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_4; // 0x07A8(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x0870(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_4;             // 0x09A0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x0AD0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_4;                          // 0x0AE0(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_5; // 0x0AF0(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_6; // 0x0BB8(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_5;             // 0x0C80(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_6;             // 0x0DB0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_5;                          // 0x0EE0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_6;                          // 0x0EF0(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri) == 0x000008, "Wrong alignment on BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri");
static_assert(sizeof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri) == 0x000F00, "Wrong size on BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, EntryPoint) == 0x000000, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_S_Dialogue_AnimationParameters) == 0x000008, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_S_Dialogue_AnimationParameters' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000D0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetPlayerController_ReturnValue) == 0x0000D8, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetComponentByClass_ReturnValue) == 0x0000E0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0000E8, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000F0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0000F8, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000100, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_FRichDialogueLine) == 0x000108, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetPlayerController_ReturnValue_2) == 0x000238, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeArray_Array) == 0x000240, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000250, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000258, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetPlayerController_ReturnValue_3) == 0x000260, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000268, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000270, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetPlayerController_ReturnValue_4) == 0x000278, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetComponentByClass_ReturnValue_4) == 0x000280, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetPlayerController_ReturnValue_5) == 0x000288, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetComponentByClass_ReturnValue_5) == 0x000290, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetComponentByClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000298, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetPlayerController_ReturnValue_6) == 0x0002A0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetComponentByClass_ReturnValue_6) == 0x0002A8, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetComponentByClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetPlayerController_ReturnValue_7) == 0x0002B0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetPlayerController_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetComponentByClass_ReturnValue_7) == 0x0002B8, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetComponentByClass_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x0002C0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, CallFunc_GetDialogueStage_DialogueStage) == 0x0002C4, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::CallFunc_GetDialogueStage_DialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_SwitchInteger_CmpSuccess) == 0x0002C8, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_S_Dialogue_AnimationParameters_1) == 0x0002D0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_S_Dialogue_AnimationParameters_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_S_Dialogue_AnimationParameters_2) == 0x000398, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_S_Dialogue_AnimationParameters_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_FRichDialogueLine_1) == 0x000460, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_FRichDialogueLine_2) == 0x000590, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_FRichDialogueLine_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeArray_Array_1) == 0x0006C0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeArray_Array_2) == 0x0006D0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_S_Dialogue_AnimationParameters_3) == 0x0006E0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_S_Dialogue_AnimationParameters_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_S_Dialogue_AnimationParameters_4) == 0x0007A8, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_S_Dialogue_AnimationParameters_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_FRichDialogueLine_3) == 0x000870, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_FRichDialogueLine_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_FRichDialogueLine_4) == 0x0009A0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_FRichDialogueLine_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeArray_Array_3) == 0x000AD0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeArray_Array_4) == 0x000AE0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_S_Dialogue_AnimationParameters_5) == 0x000AF0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_S_Dialogue_AnimationParameters_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_S_Dialogue_AnimationParameters_6) == 0x000BB8, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_S_Dialogue_AnimationParameters_6' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_FRichDialogueLine_5) == 0x000C80, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_FRichDialogueLine_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeStruct_FRichDialogueLine_6) == 0x000DB0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeStruct_FRichDialogueLine_6' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeArray_Array_5) == 0x000EE0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri, K2Node_MakeArray_Array_6) == 0x000EF0, "Member 'BP_Dialogue_Henri_C_ExecuteUbergraph_BP_Dialogue_Henri::K2Node_MakeArray_Array_6' has a wrong offset!");

}

