#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Lumiere_ExpFestival_Maxime

#include "Basic.hpp"

#include "S_Dialogue_AnimationParameters_structs.hpp"
#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_Lumiere_ExpFestival_Maxime.BP_Dialogue_Lumiere_ExpFestival_Maxime_C.ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Maxime
// 0x1778 (0x1778 - 0x0000)
struct BP_Dialogue_Lumiere_ExpFestival_Maxime_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Maxime final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters;  // 0x0008(0x00C8)(HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_5;        // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_6;        // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_7;        // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_8;        // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_9;        // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_9;        // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_10;       // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_10;       // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_11;       // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_11;       // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DE[0x2];                                      // 0x01DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x01E0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0310(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_1; // 0x0328(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x03F0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_2; // 0x0520(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x05E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x05F8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x0728(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_3; // 0x0738(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x0800(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_4; // 0x0930(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x09F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_4;             // 0x0A08(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_4;                          // 0x0B38(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_5; // 0x0B48(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_5;             // 0x0C10(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_6; // 0x0D40(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_5;                          // 0x0E08(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_6;             // 0x0E18(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_6;                          // 0x0F48(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_7; // 0x0F58(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_7;             // 0x1020(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_8; // 0x1150(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_7;                          // 0x1218(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_8;             // 0x1228(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_8;                          // 0x1358(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_9; // 0x1368(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_9;             // 0x1430(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_10; // 0x1560(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_9;                          // 0x1628(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_10;            // 0x1638(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_10;                         // 0x1768(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Dialogue_Lumiere_ExpFestival_Maxime_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Maxime) == 0x000008, "Wrong alignment on BP_Dialogue_Lumiere_ExpFestival_Maxime_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Maxime");
static_assert(sizeof(BP_Dialogue_Lumiere_ExpFestival_Maxime_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Maxime) == 0x001778, "Wrong size on BP_Dialogue_Lumiere_ExpFestival_Maxime_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Maxime");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Maxime_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Maxime, EntryPoint) == 0x000000, "Member 'BP_Dialogue_Lumiere_ExpFestival_Maxime_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Maxime::EntryPoint' has a wrong offset!");
