#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Gardens_Maelle_SophieDownThere

#include "Basic.hpp"

#include "S_Dialogue_AnimationParameters_structs.hpp"
#include "FRichDialogueLine_structs.hpp"
#include "SandFall_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_Gardens_Maelle_SophieDownThere.BP_Dialogue_Gardens_Maelle_SophieDownThere_C.ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere
// 0x0BB8 (0x0BB8 - 0x0000)
struct BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_5;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Character_MaelleIntroRun_C*> CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0090(0x0010)(ReferenceParm)
	class ABP_Character_MaelleIntroRun_C*         CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters;  // 0x00B8(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_1; // 0x0180(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0248(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0378(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x04A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x04B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_2; // 0x04C8(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_3; // 0x0590(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x0658(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x0788(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x08B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x08C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_4; // 0x08D8(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_5; // 0x09A0(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_4;             // 0x0A68(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_4;                          // 0x0B98(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue; // 0x0BA8(0x0010)(NoDestructor)
};
static_assert(alignof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere) == 0x000008, "Wrong alignment on BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere");
static_assert(sizeof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere) == 0x000BB8, "Wrong size on BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, EntryPoint) == 0x000000, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_MakeLiteralByte_ReturnValue) == 0x000018, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000019, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetPlayerController_ReturnValue_1) == 0x000020, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000028, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000030, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetPlayerController_ReturnValue_2) == 0x000038, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000040, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetPlayerController_ReturnValue_3) == 0x000048, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000050, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000058, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetPlayerController_ReturnValue_4) == 0x000060, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetComponentByClass_ReturnValue_4) == 0x000068, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000070, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetPlayerController_ReturnValue_5) == 0x000078, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetComponentByClass_ReturnValue_5) == 0x000080, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetComponentByClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetDialogueStage_DialogueStage) == 0x000088, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetDialogueStage_DialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_SwitchInteger_CmpSuccess) == 0x00008C, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000090, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0000A8, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_GetQuestSystem_QuestSystem) == 0x0000B0, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeStruct_S_Dialogue_AnimationParameters) == 0x0000B8, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeStruct_S_Dialogue_AnimationParameters' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeStruct_S_Dialogue_AnimationParameters_1) == 0x000180, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeStruct_S_Dialogue_AnimationParameters_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeStruct_FRichDialogueLine) == 0x000248, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeStruct_FRichDialogueLine_1) == 0x000378, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeArray_Array) == 0x0004A8, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeArray_Array_1) == 0x0004B8, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeStruct_S_Dialogue_AnimationParameters_2) == 0x0004C8, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeStruct_S_Dialogue_AnimationParameters_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeStruct_S_Dialogue_AnimationParameters_3) == 0x000590, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeStruct_S_Dialogue_AnimationParameters_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeStruct_FRichDialogueLine_2) == 0x000658, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeStruct_FRichDialogueLine_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeStruct_FRichDialogueLine_3) == 0x000788, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeStruct_FRichDialogueLine_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeArray_Array_2) == 0x0008B8, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeArray_Array_3) == 0x0008C8, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeStruct_S_Dialogue_AnimationParameters_4) == 0x0008D8, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeStruct_S_Dialogue_AnimationParameters_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeStruct_S_Dialogue_AnimationParameters_5) == 0x0009A0, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeStruct_S_Dialogue_AnimationParameters_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeStruct_FRichDialogueLine_4) == 0x000A68, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeStruct_FRichDialogueLine_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, K2Node_MakeArray_Array_4) == 0x000B98, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue) == 0x000BA8, "Member 'BP_Dialogue_Gardens_Maelle_SophieDownThere_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_SophieDownThere::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue' has a wrong offset!");

}

