#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_MainPlaza_Trashcan_useless

#include "Basic.hpp"

#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_MainPlaza_Trashcan_useless.BP_Dialogue_MainPlaza_Trashcan_useless_C.ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless
// 0x0180 (0x0180 - 0x0000)
struct BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class FText                                   CallFunc_Array_Random_OutItem;                     // 0x0018(0x0010)()
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0038(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x0170(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless) == 0x000008, "Wrong alignment on BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless");
static_assert(sizeof(BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless) == 0x000180, "Wrong size on BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless");
static_assert(offsetof(BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless, EntryPoint) == 0x000000, "Member 'BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless, CallFunc_Array_Random_OutItem) == 0x000018, "Member 'BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless, CallFunc_Array_Random_OutIndex) == 0x000028, "Member 'BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless, CallFunc_MakeLiteralByte_ReturnValue) == 0x00002C, "Member 'BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless, K2Node_MakeStruct_FRichDialogueLine) == 0x000038, "Member 'BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless, CallFunc_GetComponentByClass_ReturnValue) == 0x000168, "Member 'BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless, K2Node_MakeArray_Array_1) == 0x000170, "Member 'BP_Dialogue_MainPlaza_Trashcan_useless_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan_useless::K2Node_MakeArray_Array_1' has a wrong offset!");

}

