#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Gardens_Maelle_FlowerReminder

#include "Basic.hpp"

#include "S_Dialogue_AnimationParameters_structs.hpp"
#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_Gardens_Maelle_FlowerReminder.BP_Dialogue_Gardens_Maelle_FlowerReminder_C.ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder
// 0x0458 (0x0458 - 0x0000)
struct BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters;  // 0x0008(0x00C8)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0100(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0238(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_1; // 0x0250(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0318(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x0448(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder) == 0x000008, "Wrong alignment on BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder");
static_assert(sizeof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder) == 0x000458, "Wrong size on BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, EntryPoint) == 0x000000, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, K2Node_MakeStruct_S_Dialogue_AnimationParameters) == 0x000008, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::K2Node_MakeStruct_S_Dialogue_AnimationParameters' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, CallFunc_GetPlayerController_ReturnValue) == 0x0000D0, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, CallFunc_GetComponentByClass_ReturnValue) == 0x0000D8, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000E0, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000E8, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0000F0, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0000F8, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, K2Node_MakeStruct_FRichDialogueLine) == 0x000100, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, CallFunc_GetDialogueStage_DialogueStage) == 0x000230, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::CallFunc_GetDialogueStage_DialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, K2Node_MakeArray_Array) == 0x000238, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, K2Node_SwitchInteger_CmpSuccess) == 0x000248, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, K2Node_MakeStruct_S_Dialogue_AnimationParameters_1) == 0x000250, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::K2Node_MakeStruct_S_Dialogue_AnimationParameters_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, K2Node_MakeStruct_FRichDialogueLine_1) == 0x000318, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder, K2Node_MakeArray_Array_1) == 0x000448, "Member 'BP_Dialogue_Gardens_Maelle_FlowerReminder_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FlowerReminder::K2Node_MakeArray_Array_1' has a wrong offset!");

}

