#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_TS_GrandisEngineer

#include "Basic.hpp"

#include "FRichDialogueLine_structs.hpp"
#include "S_Dialogue_CustomOptions_structs.hpp"
#include "S_InteractiveMusicParameters_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_TS_GrandisEngineer.BP_Dialogue_TS_GrandisEngineer_C.ExecuteUbergraph_BP_Dialogue_TS_GrandisEngineer
// 0x1A88 (0x1A88 - 0x0000)
struct BP_Dialogue_TS_GrandisEngineer_C_ExecuteUbergraph_BP_Dialogue_TS_GrandisEngineer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_CustomOptions              K2Node_MakeStruct_S_Dialogue_CustomOptions;        // 0x0008(0x0048)(ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0058(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x01A0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x02D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x02F8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x0428(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x0440(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x0578(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0588(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0598(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x05A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A2[0x6];                                      // 0x05A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_4;             // 0x05A8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_4;                          // 0x06D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x06E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0700(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0708(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_5;             // 0x0710(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_5;                          // 0x0840(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0850(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_5;        // 0x0858(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_861[0x7];                                      // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_6;             // 0x0868(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0998(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_6;                          // 0x09A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_6;        // 0x09B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x09B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_7;        // 0x09C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x09C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C9[0x7];                                      // 0x09C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x09D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_7;             // 0x09D8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_8;        // 0x0B08(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_7;                          // 0x0B10(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0B20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B21[0x7];                                      // 0x0B21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_8;             // 0x0B28(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_9;        // 0x0C58(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_8;                          // 0x0C60(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_9;        // 0x0C70(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0C78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C79[0x7];                                      // 0x0C79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_9;             // 0x0C80(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_9;                          // 0x0DB0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_10;       // 0x0DC0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_10;       // 0x0DC8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0DD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD1[0x7];                                      // 0x0DD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_11;       // 0x0DD8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_11;       // 0x0DE0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_10;            // 0x0DE8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_10;                         // 0x0F18(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x0F28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F29[0x7];                                      // 0x0F29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_11;            // 0x0F30(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_12;       // 0x1060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_11;                         // 0x1068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_12;       // 0x1078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_13;       // 0x1080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_13;       // 0x1088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x1090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1091[0x7];                                     // 0x1091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_14;       // 0x1098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_14;       // 0x10A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_12;            // 0x10A8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_12;                         // 0x11D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_14;           // 0x11E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E9[0x7];                                     // 0x11E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_15;       // 0x11F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_13;            // 0x11F8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_15;       // 0x1328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_13;                         // 0x1330(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_16;       // 0x1340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_16;       // 0x1348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_15;           // 0x1350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1351[0x7];                                     // 0x1351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_14;            // 0x1358(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_17;       // 0x1488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_14;                         // 0x1490(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_17;       // 0x14A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_16;           // 0x14A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A9[0x7];                                     // 0x14A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_18;       // 0x14B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_18;       // 0x14B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_15;            // 0x14C0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_15;                         // 0x15F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_19;       // 0x1600(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_19;       // 0x1608(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_17;           // 0x1610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_18;           // 0x1611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1612[0x6];                                     // 0x1612(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_16;            // 0x1618(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_17;            // 0x1748(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_16;                         // 0x1878(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_17;                         // 0x1888(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_20;       // 0x1898(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_20;       // 0x18A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractiveMusicSystem_C*           CallFunc_GetInteractiveMusicSystem_InteractiveMusicSystem; // 0x18A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_InteractiveMusicParameters          K2Node_MakeStruct_S_InteractiveMusicParameters;    // 0x18B0(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_19;           // 0x18C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C9[0x7];                                     // 0x18C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_18;                         // 0x18D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x18E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x18E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18E5[0x3];                                     // 0x18E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_19;                         // 0x18E8(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_20;           // 0x18F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18F9[0x7];                                     // 0x18F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_18;            // 0x1900(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_20;                         // 0x1A30(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_CustomOptions              K2Node_MakeStruct_S_Dialogue_CustomOptions_1;      // 0x1A40(0x0048)(ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_TS_GrandisEngineer_C_ExecuteUbergraph_BP_Dialogue_TS_GrandisEngineer) == 0x000008, "Wrong alignment on BP_Dialogue_TS_GrandisEngineer_C_ExecuteUbergraph_BP_Dialogue_TS_GrandisEngineer");
static_assert(sizeof(BP_Dialogue_TS_GrandisEngineer_C_ExecuteUbergraph_BP_Dialogue_TS_GrandisEngineer) == 0x001A88, "Wrong size on BP_Dialogue_TS_GrandisEngineer_C_ExecuteUbergraph_BP_Dialogue_TS_GrandisEngineer");
static_assert(offsetof(BP_Dialogue_TS_GrandisEngineer_C_ExecuteUbergraph_BP_Dialogue_TS_GrandisEngineer, EntryPoint) == 0x000000, "Member 'BP_Dialogue_TS_GrandisEngineer_C_ExecuteUbergraph_BP_Dialogue_TS_GrandisEngineer::EntryPoint' has a wrong offset!");
