#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Lumiere_WalkAct1_FlowerSeller

#include "Basic.hpp"

#include "S_Dialogue_AnimationParameters_structs.hpp"
#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_Lumiere_WalkAct1_FlowerSeller.BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C.ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller
// 0x0D60 (0x0D60 - 0x0000)
struct BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters;  // 0x0008(0x00C8)(HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x00D8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0208(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0250(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x0388(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_4;        // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_5;        // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_6;        // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x03F0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x0520(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_1; // 0x0540(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_2; // 0x0608(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x06D0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_4;             // 0x0800(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x0930(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_4;                          // 0x0940(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_3; // 0x0950(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_4; // 0x0A18(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_5;             // 0x0AE0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_6;             // 0x0C10(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_5;                          // 0x0D40(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_6;                          // 0x0D50(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller) == 0x000008, "Wrong alignment on BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller");
static_assert(sizeof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller) == 0x000D60, "Wrong size on BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, EntryPoint) == 0x000000, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeStruct_S_Dialogue_AnimationParameters) == 0x000008, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeStruct_S_Dialogue_AnimationParameters' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000D0, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeStruct_FRichDialogueLine) == 0x0000D8, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeArray_Array) == 0x000208, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000218, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetPlayerController_ReturnValue) == 0x000220, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetComponentByClass_ReturnValue) == 0x000228, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetPlayerController_ReturnValue_1) == 0x000230, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000238, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000240, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetPlayerController_ReturnValue_2) == 0x000248, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeStruct_FRichDialogueLine_1) == 0x000250, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000380, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeArray_Array_1) == 0x000388, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000398, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetPlayerController_ReturnValue_3) == 0x0003A0, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetComponentByClass_ReturnValue_3) == 0x0003A8, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetPlayerController_ReturnValue_4) == 0x0003B0, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetComponentByClass_ReturnValue_4) == 0x0003B8, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x0003C0, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetPlayerController_ReturnValue_5) == 0x0003C8, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetComponentByClass_ReturnValue_5) == 0x0003D0, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetComponentByClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x0003D8, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetPlayerController_ReturnValue_6) == 0x0003E0, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetComponentByClass_ReturnValue_6) == 0x0003E8, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetComponentByClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeStruct_FRichDialogueLine_2) == 0x0003F0, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeStruct_FRichDialogueLine_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeArray_Array_2) == 0x000520, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000530, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, CallFunc_GetDialogueStage_DialogueStage) == 0x000534, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::CallFunc_GetDialogueStage_DialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_SwitchInteger_CmpSuccess) == 0x000538, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeStruct_S_Dialogue_AnimationParameters_1) == 0x000540, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeStruct_S_Dialogue_AnimationParameters_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeStruct_S_Dialogue_AnimationParameters_2) == 0x000608, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeStruct_S_Dialogue_AnimationParameters_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeStruct_FRichDialogueLine_3) == 0x0006D0, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeStruct_FRichDialogueLine_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeStruct_FRichDialogueLine_4) == 0x000800, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeStruct_FRichDialogueLine_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeArray_Array_3) == 0x000930, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeArray_Array_4) == 0x000940, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeStruct_S_Dialogue_AnimationParameters_3) == 0x000950, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeStruct_S_Dialogue_AnimationParameters_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeStruct_S_Dialogue_AnimationParameters_4) == 0x000A18, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeStruct_S_Dialogue_AnimationParameters_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeStruct_FRichDialogueLine_5) == 0x000AE0, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeStruct_FRichDialogueLine_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeStruct_FRichDialogueLine_6) == 0x000C10, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeStruct_FRichDialogueLine_6' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeArray_Array_5) == 0x000D40, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller, K2Node_MakeArray_Array_6) == 0x000D50, "Member 'BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C_ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller::K2Node_MakeArray_Array_6' has a wrong offset!");

}

