#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_GV_VillageGate1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "S_jRPG_PartySlot_structs.hpp"
#include "FSoundEvent_structs.hpp"
#include "BP_Dialogue_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Dialogue_GV_VillageGate1.BP_Dialogue_GV_VillageGate1_C
// 0x0238 (0x0570 - 0x0338)
class ABP_Dialogue_GV_VillageGate1_C final : public ABP_Dialogue_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Dialogue_GV_VillageGate1_C;      // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Int;                                               // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstTimeTalking;                                  // 0x0344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDefeat;                                          // 0x0345(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346[0x2];                                      // 0x0346(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   As_BP_J_RPG_GI_Custom;                             // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSet<class FName>                             VendorItemsBasicStocks;                            // 0x0350(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<class FName>                             VendorItemsCompleteStocks;                         // 0x03A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_jRPG_PartySlot>              CurrentPartyCache_0;                               // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class ABP_BattleMap_C>         BattleMap_0;                                       // 0x0400(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         VendorItemID;                                      // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WeirdPictosBuyed;                                  // 0x042C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42D[0x3];                                      // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Weird_Pictos;                                      // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Weird_PictosAgain;                                 // 0x0440(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSoundEventDataTableRowHandle          SD_LootSound;                                      // 0x0450(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FFSoundEvent                           Sound_Event;                                       // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TMap<class FName, int32>                      Item_Type__Quantity;                               // 0x0468(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, int32>                      HealingTint;                                       // 0x04B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, int32>                      EnergyTint;                                        // 0x0508(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         HealingTintCost;                                   // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnergyTintCost;                                    // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LimonsolPictosCost;                                // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSoundEvent                           SD_Music;                                          // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void StartDialog();
	void ExecuteUbergraph_BP_Dialogue_GV_VillageGate1(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Dialogue_GV_VillageGate1_C">();
	}
	static class ABP_Dialogue_GV_VillageGate1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Dialogue_GV_VillageGate1_C>();
	}
};
static_assert(alignof(ABP_Dialogue_GV_VillageGate1_C) == 0x000008, "Wrong alignment on ABP_Dialogue_GV_VillageGate1_C");
static_assert(sizeof(ABP_Dialogue_GV_VillageGate1_C) == 0x000570, "Wrong size on ABP_Dialogue_GV_VillageGate1_C");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, UberGraphFrame_BP_Dialogue_GV_VillageGate1_C) == 0x000338, "Member 'ABP_Dialogue_GV_VillageGate1_C::UberGraphFrame_BP_Dialogue_GV_VillageGate1_C' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, Int) == 0x000340, "Member 'ABP_Dialogue_GV_VillageGate1_C::Int' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, FirstTimeTalking) == 0x000344, "Member 'ABP_Dialogue_GV_VillageGate1_C::FirstTimeTalking' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, IsDefeat) == 0x000345, "Member 'ABP_Dialogue_GV_VillageGate1_C::IsDefeat' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, As_BP_J_RPG_GI_Custom) == 0x000348, "Member 'ABP_Dialogue_GV_VillageGate1_C::As_BP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, VendorItemsBasicStocks) == 0x000350, "Member 'ABP_Dialogue_GV_VillageGate1_C::VendorItemsBasicStocks' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, VendorItemsCompleteStocks) == 0x0003A0, "Member 'ABP_Dialogue_GV_VillageGate1_C::VendorItemsCompleteStocks' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, CurrentPartyCache_0) == 0x0003F0, "Member 'ABP_Dialogue_GV_VillageGate1_C::CurrentPartyCache_0' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, BattleMap_0) == 0x000400, "Member 'ABP_Dialogue_GV_VillageGate1_C::BattleMap_0' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, VendorItemID) == 0x000428, "Member 'ABP_Dialogue_GV_VillageGate1_C::VendorItemID' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, WeirdPictosBuyed) == 0x00042C, "Member 'ABP_Dialogue_GV_VillageGate1_C::WeirdPictosBuyed' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, Weird_Pictos) == 0x000430, "Member 'ABP_Dialogue_GV_VillageGate1_C::Weird_Pictos' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, Weird_PictosAgain) == 0x000440, "Member 'ABP_Dialogue_GV_VillageGate1_C::Weird_PictosAgain' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, SD_LootSound) == 0x000450, "Member 'ABP_Dialogue_GV_VillageGate1_C::SD_LootSound' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, Sound_Event) == 0x000460, "Member 'ABP_Dialogue_GV_VillageGate1_C::Sound_Event' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, Item_Type__Quantity) == 0x000468, "Member 'ABP_Dialogue_GV_VillageGate1_C::Item_Type__Quantity' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, HealingTint) == 0x0004B8, "Member 'ABP_Dialogue_GV_VillageGate1_C::HealingTint' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, EnergyTint) == 0x000508, "Member 'ABP_Dialogue_GV_VillageGate1_C::EnergyTint' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, HealingTintCost) == 0x000558, "Member 'ABP_Dialogue_GV_VillageGate1_C::HealingTintCost' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, EnergyTintCost) == 0x00055C, "Member 'ABP_Dialogue_GV_VillageGate1_C::EnergyTintCost' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, LimonsolPictosCost) == 0x000560, "Member 'ABP_Dialogue_GV_VillageGate1_C::LimonsolPictosCost' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_GV_VillageGate1_C, SD_Music) == 0x000568, "Member 'ABP_Dialogue_GV_VillageGate1_C::SD_Music' has a wrong offset!");

}

