#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_GV_VillageGate1

#include "Basic.hpp"

#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_GV_VillageGate1.BP_Dialogue_GV_VillageGate1_C.ExecuteUbergraph_BP_Dialogue_GV_VillageGate1
// 0x0590 (0x0590 - 0x0000)
struct BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0018(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0168(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x02A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x02E8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0418(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x0420(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x0438(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x0568(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class FText>                           K2Node_MakeArray_Array_4;                          // 0x0578(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1) == 0x000008, "Wrong alignment on BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1");
static_assert(sizeof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1) == 0x000590, "Wrong size on BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, EntryPoint) == 0x000000, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, K2Node_MakeStruct_FRichDialogueLine) == 0x000018, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, K2Node_MakeArray_Array) == 0x000148, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000158, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_GetPlayerController_ReturnValue_1) == 0x000160, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, K2Node_MakeStruct_FRichDialogueLine_1) == 0x000168, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000298, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, K2Node_MakeArray_Array_1) == 0x0002A0, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_GetPlayerController_ReturnValue_2) == 0x0002B0, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0002B8, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0002C0, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_GetPlayerController_ReturnValue_3) == 0x0002C8, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_GetComponentByClass_ReturnValue_3) == 0x0002D0, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0002D8, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_GetPlayerController_ReturnValue_4) == 0x0002E0, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, K2Node_MakeStruct_FRichDialogueLine_2) == 0x0002E8, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::K2Node_MakeStruct_FRichDialogueLine_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_GetComponentByClass_ReturnValue_4) == 0x000418, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_GetComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, K2Node_MakeArray_Array_2) == 0x000420, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000430, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, K2Node_MakeStruct_FRichDialogueLine_3) == 0x000438, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::K2Node_MakeStruct_FRichDialogueLine_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, K2Node_MakeArray_Array_3) == 0x000568, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, K2Node_MakeArray_Array_4) == 0x000578, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, CallFunc_GetDialogueStage_DialogueStage) == 0x000588, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::CallFunc_GetDialogueStage_DialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1, K2Node_SwitchInteger_CmpSuccess) == 0x00058C, "Member 'BP_Dialogue_GV_VillageGate1_C_ExecuteUbergraph_BP_Dialogue_GV_VillageGate1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

