#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Lumiere_ExpFestival_Florian

#include "Basic.hpp"

#include "S_Dialogue_AnimationParameters_structs.hpp"
#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_Lumiere_ExpFestival_Florian.BP_Dialogue_Lumiere_ExpFestival_Florian_C.ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian
// 0x0448 (0x0448 - 0x0000)
struct BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters;  // 0x0008(0x00C8)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x00E8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0220(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_1; // 0x0240(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0308(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x0438(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian) == 0x000008, "Wrong alignment on BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian");
static_assert(sizeof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian) == 0x000448, "Wrong size on BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, EntryPoint) == 0x000000, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, K2Node_MakeStruct_S_Dialogue_AnimationParameters) == 0x000008, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::K2Node_MakeStruct_S_Dialogue_AnimationParameters' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, CallFunc_GetPlayerController_ReturnValue) == 0x0000D0, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, CallFunc_GetComponentByClass_ReturnValue) == 0x0000D8, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000E0, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, K2Node_MakeStruct_FRichDialogueLine) == 0x0000E8, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, CallFunc_GetPlayerController_ReturnValue_1) == 0x000218, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, K2Node_MakeArray_Array) == 0x000220, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000230, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000238, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, K2Node_MakeStruct_S_Dialogue_AnimationParameters_1) == 0x000240, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::K2Node_MakeStruct_S_Dialogue_AnimationParameters_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, K2Node_MakeStruct_FRichDialogueLine_1) == 0x000308, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian, K2Node_MakeArray_Array_1) == 0x000438, "Member 'BP_Dialogue_Lumiere_ExpFestival_Florian_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Florian::K2Node_MakeArray_Array_1' has a wrong offset!");

}

