#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Lumiere_WalkAct1_FlowerSeller

#include "Basic.hpp"

#include "BP_Dialogue_classes.hpp"
#include "SandFall_structs.hpp"
#include "FBattleStartParams_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Dialogue_Lumiere_WalkAct1_FlowerSeller.BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C
// 0x0170 (0x04A8 - 0x0338)
class ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C final : public ABP_Dialogue_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C; // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FFBattleStartParams                    maelleDuelBattleParams;                            // 0x0340(0x0158)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FGameAction_Wrapper                    gameActionFestivalEnd;                             // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)

public:
	void ExecuteUbergraph_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller(int32 EntryPoint);
	void StartDialog();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C">();
	}
	static class ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C>();
	}
};
static_assert(alignof(ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C) == 0x000008, "Wrong alignment on ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C");
static_assert(sizeof(ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C) == 0x0004A8, "Wrong size on ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C");
static_assert(offsetof(ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C, UberGraphFrame_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C) == 0x000338, "Member 'ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C::UberGraphFrame_BP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C, maelleDuelBattleParams) == 0x000340, "Member 'ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C::maelleDuelBattleParams' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C, gameActionFestivalEnd) == 0x000498, "Member 'ABP_Dialogue_Lumiere_WalkAct1_FlowerSeller_C::gameActionFestivalEnd' has a wrong offset!");

}

