#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Lumiere_ExpFestival_Victor

#include "Basic.hpp"

#include "S_Dialogue_AnimationParameters_structs.hpp"
#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_Lumiere_ExpFestival_Victor.BP_Dialogue_Lumiere_ExpFestival_Victor_C.ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor
// 0x0CC8 (0x0CC8 - 0x0000)
struct BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters;  // 0x0008(0x00C8)(HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_5;        // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E[0x2];                                      // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0160(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_1; // 0x0290(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0358(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0368(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x0498(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_2; // 0x04A8(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x0570(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_3; // 0x06A0(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x0768(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x0778(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x08A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_4; // 0x08B8(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_4;             // 0x0980(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_5; // 0x0AB0(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_4;                          // 0x0B78(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_5;             // 0x0B88(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_5;                          // 0x0CB8(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor) == 0x000008, "Wrong alignment on BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor");
static_assert(sizeof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor) == 0x000CC8, "Wrong size on BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, EntryPoint) == 0x000000, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeStruct_S_Dialogue_AnimationParameters) == 0x000008, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeStruct_S_Dialogue_AnimationParameters' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000D0, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetPlayerController_ReturnValue) == 0x0000D8, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetComponentByClass_ReturnValue) == 0x0000E0, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0000E8, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000F0, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0000F8, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000100, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetPlayerController_ReturnValue_2) == 0x000108, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000110, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetPlayerController_ReturnValue_3) == 0x000118, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000120, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000128, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetPlayerController_ReturnValue_4) == 0x000130, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetComponentByClass_ReturnValue_4) == 0x000138, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000140, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetPlayerController_ReturnValue_5) == 0x000148, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetComponentByClass_ReturnValue_5) == 0x000150, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetComponentByClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_GetDialogueStage_DialogueStage) == 0x000158, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_GetDialogueStage_DialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_SwitchInteger_CmpSuccess) == 0x00015C, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00015D, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeStruct_FRichDialogueLine) == 0x000160, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeStruct_S_Dialogue_AnimationParameters_1) == 0x000290, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeStruct_S_Dialogue_AnimationParameters_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeArray_Array) == 0x000358, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeStruct_FRichDialogueLine_1) == 0x000368, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeArray_Array_1) == 0x000498, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeStruct_S_Dialogue_AnimationParameters_2) == 0x0004A8, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeStruct_S_Dialogue_AnimationParameters_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeStruct_FRichDialogueLine_2) == 0x000570, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeStruct_FRichDialogueLine_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeStruct_S_Dialogue_AnimationParameters_3) == 0x0006A0, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeStruct_S_Dialogue_AnimationParameters_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeArray_Array_2) == 0x000768, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeStruct_FRichDialogueLine_3) == 0x000778, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeStruct_FRichDialogueLine_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeArray_Array_3) == 0x0008A8, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeStruct_S_Dialogue_AnimationParameters_4) == 0x0008B8, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeStruct_S_Dialogue_AnimationParameters_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeStruct_FRichDialogueLine_4) == 0x000980, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeStruct_FRichDialogueLine_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeStruct_S_Dialogue_AnimationParameters_5) == 0x000AB0, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeStruct_S_Dialogue_AnimationParameters_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeArray_Array_4) == 0x000B78, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeStruct_FRichDialogueLine_5) == 0x000B88, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeStruct_FRichDialogueLine_5' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor, K2Node_MakeArray_Array_5) == 0x000CB8, "Member 'BP_Dialogue_Lumiere_ExpFestival_Victor_C_ExecuteUbergraph_BP_Dialogue_Lumiere_ExpFestival_Victor::K2Node_MakeArray_Array_5' has a wrong offset!");

}

