#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Harbour_GommageStarts

#include "Basic.hpp"

#include "FRichDialogueLine_structs.hpp"
#include "S_GameFlowTransitionRequest_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_Harbour_GommageStarts.BP_Dialogue_Harbour_GommageStarts_C.ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts
// 0x0598 (0x0598 - 0x0000)
struct BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0028(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0188(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x02B8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x03E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x03F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_3;                          // 0x0418(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42A[0x6];                                      // 0x042A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x0438(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0568(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_4;                          // 0x0570(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_GameFlowTransitionSystem_C*         CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem; // 0x0580(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_GameFlowTransitionRequest           K2Node_MakeStruct_S_GameFlowTransitionRequest;     // 0x0588(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts) == 0x000008, "Wrong alignment on BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts");
static_assert(sizeof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts) == 0x000598, "Wrong size on BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, EntryPoint) == 0x000000, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000018, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_GetPlayerController_ReturnValue_1) == 0x000020, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, K2Node_MakeStruct_FRichDialogueLine) == 0x000028, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000158, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, K2Node_MakeArray_Array) == 0x000160, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_GetPlayerController_ReturnValue_2) == 0x000170, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000178, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000180, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000181, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, K2Node_MakeStruct_FRichDialogueLine_1) == 0x000188, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, K2Node_MakeStruct_FRichDialogueLine_2) == 0x0002B8, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::K2Node_MakeStruct_FRichDialogueLine_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, K2Node_MakeArray_Array_1) == 0x0003E8, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, K2Node_MakeArray_Array_2) == 0x0003F8, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_GetPlayerController_ReturnValue_3) == 0x000408, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000410, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, K2Node_MakeArray_Array_3) == 0x000418, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000428, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000429, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_GetPlayerController_ReturnValue_4) == 0x000430, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, K2Node_MakeStruct_FRichDialogueLine_3) == 0x000438, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::K2Node_MakeStruct_FRichDialogueLine_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_GetComponentByClass_ReturnValue_4) == 0x000568, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_GetComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, K2Node_MakeArray_Array_4) == 0x000570, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem) == 0x000580, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::CallFunc_GetGameFlowTransitionSystem_GameFlowTransitionSystem' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts, K2Node_MakeStruct_S_GameFlowTransitionRequest) == 0x000588, "Member 'BP_Dialogue_Harbour_GommageStarts_C_ExecuteUbergraph_BP_Dialogue_Harbour_GommageStarts::K2Node_MakeStruct_S_GameFlowTransitionRequest' has a wrong offset!");

}

