#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Gardens_GustaveFlower

#include "Basic.hpp"

#include "S_LootContext_structs.hpp"
#include "S_Dialogue_AnimationParameters_structs.hpp"
#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "FRichDialogueLine_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_Gardens_GustaveFlower.BP_Dialogue_Gardens_GustaveFlower_C.ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower
// 0x0630 (0x0630 - 0x0000)
struct BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters;  // 0x0008(0x00C8)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue; // 0x011C(0x0010)(NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0138(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1; // 0x0268(0x0010)(NoDestructor)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x0278(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_GetEncounterLevel_ReturnValue;            // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_LootContext                         K2Node_MakeStruct_S_LootContext;                   // 0x028C(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x02A0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x03D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x03F0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0528(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0540(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0588(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0598(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_AddItemToInventory_GeneratedItem;         // 0x05A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x05B0(0x0010)()
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem_1;             // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x05C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0610(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0620(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower) == 0x000008, "Wrong alignment on BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower");
static_assert(sizeof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower) == 0x000630, "Wrong size on BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, EntryPoint) == 0x000000, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, K2Node_MakeStruct_S_Dialogue_AnimationParameters) == 0x000008, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::K2Node_MakeStruct_S_Dialogue_AnimationParameters' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetPlayerController_ReturnValue) == 0x0000D0, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetComponentByClass_ReturnValue) == 0x0000D8, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000E0, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0000E8, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000F0, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000F8, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000100, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, K2Node_MakeArray_Array) == 0x000108, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000118, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue) == 0x00011C, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00012C, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetInventoryManager_ReturnValue) == 0x000130, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, K2Node_MakeStruct_FRichDialogueLine) == 0x000138, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1) == 0x000268, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, K2Node_MakeArray_Array_1) == 0x000278, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetEncounterLevel_ReturnValue) == 0x000288, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetEncounterLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, K2Node_MakeStruct_S_LootContext) == 0x00028C, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::K2Node_MakeStruct_S_LootContext' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000290, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetPlayerController_ReturnValue_3) == 0x000298, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, K2Node_MakeStruct_FRichDialogueLine_1) == 0x0002A0, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetComponentByClass_ReturnValue_3) == 0x0003D0, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, K2Node_MakeArray_Array_2) == 0x0003D8, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetQuestSystem_QuestSystem) == 0x0003E8, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetDataTableRowFromName_OutRow) == 0x0003F0, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000520, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_Conv_NameToText_ReturnValue) == 0x000528, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_IsValid_ReturnValue) == 0x000538, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, K2Node_MakeStruct_FormatArgumentData) == 0x000540, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetDisplayName_ReturnValue) == 0x000588, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_SelectString_ReturnValue) == 0x000598, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_AddItemToInventory_GeneratedItem) == 0x0005A8, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_AddItemToInventory_GeneratedItem' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_Conv_StringToText_ReturnValue) == 0x0005B0, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_GetQuestSystem_QuestSystem_1) == 0x0005C0, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_GetQuestSystem_QuestSystem_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, K2Node_MakeStruct_FormatArgumentData_1) == 0x0005C8, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, K2Node_MakeArray_Array_3) == 0x000610, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower, CallFunc_Format_ReturnValue) == 0x000620, "Member 'BP_Dialogue_Gardens_GustaveFlower_C_ExecuteUbergraph_BP_Dialogue_Gardens_GustaveFlower::CallFunc_Format_ReturnValue' has a wrong offset!");

}

