#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Benoit

#include "Basic.hpp"

#include "BP_Dialogue_classes.hpp"
#include "SandFall_structs.hpp"
#include "FBattleStartParams_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Dialogue_Benoit.BP_Dialogue_Benoit_C
// 0x0170 (0x04A8 - 0x0338)
class ABP_Dialogue_Benoit_C final : public ABP_Dialogue_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Dialogue_Benoit_C;               // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FFBattleStartParams                    Battle_Start_Params;                               // 0x0340(0x0158)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FItemDataTableRowHandle                Item_Data_Table_Row_Handle;                        // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_Dialogue_Benoit(int32 EntryPoint);
	void StartDialog();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Dialogue_Benoit_C">();
	}
	static class ABP_Dialogue_Benoit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Dialogue_Benoit_C>();
	}
};
static_assert(alignof(ABP_Dialogue_Benoit_C) == 0x000008, "Wrong alignment on ABP_Dialogue_Benoit_C");
static_assert(sizeof(ABP_Dialogue_Benoit_C) == 0x0004A8, "Wrong size on ABP_Dialogue_Benoit_C");
static_assert(offsetof(ABP_Dialogue_Benoit_C, UberGraphFrame_BP_Dialogue_Benoit_C) == 0x000338, "Member 'ABP_Dialogue_Benoit_C::UberGraphFrame_BP_Dialogue_Benoit_C' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_Benoit_C, Battle_Start_Params) == 0x000340, "Member 'ABP_Dialogue_Benoit_C::Battle_Start_Params' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_Benoit_C, Item_Data_Table_Row_Handle) == 0x000498, "Member 'ABP_Dialogue_Benoit_C::Item_Data_Table_Row_Handle' has a wrong offset!");

}

