#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_MainPlaza_Trashcan

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "S_LootContext_structs.hpp"
#include "FRichDialogueLine_structs.hpp"
#include "E_QuestStatus_structs.hpp"
#include "E_MainQuest_Step_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "E_CurrentAct_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_MainPlaza_Trashcan.BP_Dialogue_MainPlaza_Trashcan_C.ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan
// 0x1D70 (0x1D70 - 0x0000)
struct BP_Dialogue_MainPlaza_Trashcan_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0098(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x01C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x01E0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x0310(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x0328(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x0460(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x0470(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_4;                          // 0x05A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x05B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x05B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x05C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x05D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x05D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x05E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_4;        // 0x05F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0600(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_5;        // 0x0608(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0610(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_6;        // 0x0618(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0628(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_7;        // 0x0630(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_4;             // 0x0638(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_5;                          // 0x0768(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_779[0x7];                                      // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_5;             // 0x0780(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x08B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_6;                          // 0x08B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_8;        // 0x08C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_9;        // 0x08D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_9;        // 0x08D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x08E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E1[0x7];                                      // 0x08E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_10;       // 0x08E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_6;             // 0x08F0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_10;       // 0x0A20(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_7;                          // 0x0A28(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0A38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0A39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3A[0x6];                                      // 0x0A3A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_7;             // 0x0A40(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_8;             // 0x0B70(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_8;                          // 0x0CA0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_9;                          // 0x0CB0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0CC0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEncounterLevel_ReturnValue;            // 0x0CC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_LootContext                         K2Node_MakeStruct_S_LootContext;                   // 0x0CCC(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0CD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD1[0x7];                                      // 0x0CD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_11;       // 0x0CD8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_9;             // 0x0CE0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_11;       // 0x0E10(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_10;                         // 0x0E18(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_12;       // 0x0E28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_12;       // 0x0E30(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0E38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E39[0x7];                                      // 0x0E39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_10;            // 0x0E40(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_13;       // 0x0F70(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_11;                         // 0x0F78(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_13;       // 0x0F88(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0F90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F91[0x7];                                      // 0x0F91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_14;       // 0x0F98(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_11;            // 0x0FA0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_14;       // 0x10D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_12;                         // 0x10D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_15;       // 0x10E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_15;       // 0x10F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue; // 0x10F8(0x0010)(NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x1108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status;                // 0x1109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x110A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_110B[0x5];                                     // 0x110B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_12;            // 0x1110(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_13;                         // 0x1240(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1; // 0x1250(0x0010)(NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_16;       // 0x1260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_16;       // 0x1268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_17;       // 0x1270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_17;       // 0x1278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x1280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_14;           // 0x1281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1282[0x6];                                     // 0x1282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_13;            // 0x1288(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_14;                         // 0x13B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_14;            // 0x13C8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_15;                         // 0x14F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue_1;        // 0x1508(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEncounterLevel_ReturnValue_1;          // 0x1510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_LootContext                         K2Node_MakeStruct_S_LootContext_1;                 // 0x1514(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x1518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x151C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151D[0x3];                                     // 0x151D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x1520(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x1650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1651[0x7];                                     // 0x1651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x1658(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x1668(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x16B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16B1[0x7];                                     // 0x16B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_AddItemToInventory_GeneratedItem;         // 0x16B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x16C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_15;           // 0x16D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D1[0x7];                                     // 0x16D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x16D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x16E8(0x0010)()
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_15;            // 0x16F8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x1828(0x0048)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_16;                         // 0x1870(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_17;                         // 0x1880(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x1890(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x18A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_CurrentAct                                  CallFunc_GetCurrentMainPathStatus_CurrentAct;      // 0x18A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MainQuest_Step                              CallFunc_GetCurrentMainPathStatus_CurrentStep;     // 0x18A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x18AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_16;           // 0x18AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18AC[0x4];                                     // 0x18AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_16;            // 0x18B0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_18;                         // 0x19E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_GetDialogueStage_DialogueStage_1;         // 0x19F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x19F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_17;           // 0x19F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19F6[0x2];                                     // 0x19F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_17;            // 0x19F8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x1B28(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x1C58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C59[0x7];                                     // 0x1C59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_19;                         // 0x1C60(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_AddItemToInventory_GeneratedItem_1;       // 0x1C70(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x1C78(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x1C88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C89[0x7];                                     // 0x1C89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x1C90(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x1CD8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x1CE8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x1CF8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x1D08(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_20;                         // 0x1D50(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_2;                     // 0x1D60(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_MainPlaza_Trashcan_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan) == 0x000008, "Wrong alignment on BP_Dialogue_MainPlaza_Trashcan_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan");
static_assert(sizeof(BP_Dialogue_MainPlaza_Trashcan_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan) == 0x001D70, "Wrong size on BP_Dialogue_MainPlaza_Trashcan_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan");
static_assert(offsetof(BP_Dialogue_MainPlaza_Trashcan_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan, EntryPoint) == 0x000000, "Member 'BP_Dialogue_MainPlaza_Trashcan_C_ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan::EntryPoint' has a wrong offset!");
