#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_MainPlaza_Trashcan

#include "Basic.hpp"

#include "BP_Dialogue_classes.hpp"
#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "E_QuestStatus_structs.hpp"
#include "E_MainQuest_Step_structs.hpp"
#include "E_CurrentAct_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Dialogue_MainPlaza_Trashcan.BP_Dialogue_MainPlaza_Trashcan_C
// 0x0028 (0x0360 - 0x0338)
class ABP_Dialogue_MainPlaza_Trashcan_C final : public ABP_Dialogue_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Dialogue_MainPlaza_Trashcan_C;   // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FItemDataTableRowHandle                Reward_Act1;                                       // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FItemDataTableRowHandle                Reward_Act2;                                       // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_Dialogue_MainPlaza_Trashcan(int32 EntryPoint);
	void StartDialog();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Dialogue_MainPlaza_Trashcan_C">();
	}
	static class ABP_Dialogue_MainPlaza_Trashcan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Dialogue_MainPlaza_Trashcan_C>();
	}
};
static_assert(alignof(ABP_Dialogue_MainPlaza_Trashcan_C) == 0x000008, "Wrong alignment on ABP_Dialogue_MainPlaza_Trashcan_C");
static_assert(sizeof(ABP_Dialogue_MainPlaza_Trashcan_C) == 0x000360, "Wrong size on ABP_Dialogue_MainPlaza_Trashcan_C");
static_assert(offsetof(ABP_Dialogue_MainPlaza_Trashcan_C, UberGraphFrame_BP_Dialogue_MainPlaza_Trashcan_C) == 0x000338, "Member 'ABP_Dialogue_MainPlaza_Trashcan_C::UberGraphFrame_BP_Dialogue_MainPlaza_Trashcan_C' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_MainPlaza_Trashcan_C, Reward_Act1) == 0x000340, "Member 'ABP_Dialogue_MainPlaza_Trashcan_C::Reward_Act1' has a wrong offset!");
static_assert(offsetof(ABP_Dialogue_MainPlaza_Trashcan_C, Reward_Act2) == 0x000350, "Member 'ABP_Dialogue_MainPlaza_Trashcan_C::Reward_Act2' has a wrong offset!");

}

