#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogueCamp_Empty

#include "Basic.hpp"

#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_DialogueCamp_Empty.BP_DialogueCamp_Empty_C.ExecuteUbergraph_BP_DialogueCamp_Empty
// 0x0158 (0x0158 - 0x0000)
struct BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0010(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty) == 0x000008, "Wrong alignment on BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty");
static_assert(sizeof(BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty) == 0x000158, "Wrong size on BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty");
static_assert(offsetof(BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty, EntryPoint) == 0x000000, "Member 'BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty, K2Node_MakeStruct_FRichDialogueLine) == 0x000010, "Member 'BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty, CallFunc_GetComponentByClass_ReturnValue) == 0x000140, "Member 'BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty, K2Node_MakeArray_Array) == 0x000148, "Member 'BP_DialogueCamp_Empty_C_ExecuteUbergraph_BP_DialogueCamp_Empty::K2Node_MakeArray_Array' has a wrong offset!");

}

