#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialog_Merchant_TwilightSanctuary

#include "Basic.hpp"

#include "FRichDialogueLine_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialog_Merchant_TwilightSanctuary.BP_Dialog_Merchant_TwilightSanctuary_C.ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary
// 0x0590 (0x0590 - 0x0000)
struct BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0030(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x0178(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0190(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x02C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetDialogueSystemComponent_DialogueSystem; // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x0308(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x0438(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_OpenMerchantWindow_IsOpened;              // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0458(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_HasItemInInventory_Result;                // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary) == 0x000008, "Wrong alignment on BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary");
static_assert(sizeof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary) == 0x000590, "Wrong size on BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, EntryPoint) == 0x000000, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_MakeLiteralByte_ReturnValue) == 0x000018, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_GetPlayerController_ReturnValue_1) == 0x000020, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000028, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, K2Node_MakeStruct_FRichDialogueLine) == 0x000030, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, K2Node_MakeArray_Array) == 0x000160, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000170, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, K2Node_MakeArray_Array_1) == 0x000178, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000188, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, K2Node_MakeStruct_FRichDialogueLine_1) == 0x000190, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, K2Node_MakeArray_Array_2) == 0x0002C0, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_GetDialogueSystemComponent_DialogueSystem) == 0x0002D0, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_GetDialogueSystemComponent_DialogueSystem' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_GetPlayerController_ReturnValue_2) == 0x0002D8, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0002E0, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0002E8, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_GetPlayerController_ReturnValue_3) == 0x0002F0, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_GetComponentByClass_ReturnValue_3) == 0x0002F8, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000300, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, K2Node_MakeStruct_FRichDialogueLine_2) == 0x000308, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::K2Node_MakeStruct_FRichDialogueLine_2' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, K2Node_MakeArray_Array_3) == 0x000438, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_OpenMerchantWindow_IsOpened) == 0x000448, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_OpenMerchantWindow_IsOpened' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_GetDialogueStage_DialogueStage) == 0x00044C, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_GetDialogueStage_DialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000450, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_GetDataTableRowFromName_OutRow) == 0x000458, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary, CallFunc_HasItemInInventory_Result) == 0x000588, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_ExecuteUbergraph_BP_Dialog_Merchant_TwilightSanctuary::CallFunc_HasItemInInventory_Result' has a wrong offset!");

// Function BP_Dialog_Merchant_TwilightSanctuary.BP_Dialog_Merchant_TwilightSanctuary_C.CheckForErrors
// 0x0018 (0x0018 - 0x0000)
struct BP_Dialog_Merchant_TwilightSanctuary_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialog_Merchant_TwilightSanctuary_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_Dialog_Merchant_TwilightSanctuary_C_CheckForErrors");
static_assert(sizeof(BP_Dialog_Merchant_TwilightSanctuary_C_CheckForErrors) == 0x000018, "Wrong size on BP_Dialog_Merchant_TwilightSanctuary_C_CheckForErrors");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_Dialog_Merchant_TwilightSanctuary_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_Dialog_Merchant_TwilightSanctuary_C_CheckForErrors::ReturnValue' has a wrong offset!");

}

