#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialog_MerchantGeneric

#include "Basic.hpp"

#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialog_MerchantGeneric.BP_Dialog_MerchantGeneric_C.ExecuteUbergraph_BP_Dialog_MerchantGeneric
// 0x0450 (0x0450 - 0x0000)
struct BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x0018(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0168(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x02A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class FText>                           K2Node_MakeArray_Array_2;                          // 0x02B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DialogueSystemComponent_C*          CallFunc_GetDialogueSystemComponent_DialogueSystem; // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x02F8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0428(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x0430(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_OpenMerchantWindow_IsOpened;              // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric) == 0x000008, "Wrong alignment on BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric");
static_assert(sizeof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric) == 0x000450, "Wrong size on BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, EntryPoint) == 0x000000, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, K2Node_MakeStruct_FRichDialogueLine) == 0x000018, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::K2Node_MakeStruct_FRichDialogueLine' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, K2Node_MakeArray_Array) == 0x000148, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000158, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_GetPlayerController_ReturnValue_1) == 0x000160, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, K2Node_MakeStruct_FRichDialogueLine_1) == 0x000168, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::K2Node_MakeStruct_FRichDialogueLine_1' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000298, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, K2Node_MakeArray_Array_1) == 0x0002A0, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, K2Node_MakeArray_Array_2) == 0x0002B0, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002C0, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_GetDialogueSystemComponent_DialogueSystem) == 0x0002C8, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_GetDialogueSystemComponent_DialogueSystem' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0002D0, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_GetPlayerController_ReturnValue_2) == 0x0002D8, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0002E0, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0002E8, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_GetPlayerController_ReturnValue_3) == 0x0002F0, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, K2Node_MakeStruct_FRichDialogueLine_2) == 0x0002F8, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::K2Node_MakeStruct_FRichDialogueLine_2' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000428, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, K2Node_MakeArray_Array_3) == 0x000430, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_OpenMerchantWindow_IsOpened) == 0x000440, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_OpenMerchantWindow_IsOpened' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_GetDialogueStage_DialogueStage) == 0x000444, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_GetDialogueStage_DialogueStage' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000448, "Member 'BP_Dialog_MerchantGeneric_C_ExecuteUbergraph_BP_Dialog_MerchantGeneric::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Dialog_MerchantGeneric.BP_Dialog_MerchantGeneric_C.CheckForErrors
// 0x0018 (0x0018 - 0x0000)
struct BP_Dialog_MerchantGeneric_C_CheckForErrors final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialog_MerchantGeneric_C_CheckForErrors) == 0x000008, "Wrong alignment on BP_Dialog_MerchantGeneric_C_CheckForErrors");
static_assert(sizeof(BP_Dialog_MerchantGeneric_C_CheckForErrors) == 0x000018, "Wrong size on BP_Dialog_MerchantGeneric_C_CheckForErrors");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_CheckForErrors, ErrorMessages) == 0x000000, "Member 'BP_Dialog_MerchantGeneric_C_CheckForErrors::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_Dialog_MerchantGeneric_C_CheckForErrors, ReturnValue) == 0x000010, "Member 'BP_Dialog_MerchantGeneric_C_CheckForErrors::ReturnValue' has a wrong offset!");

}

