#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Plazza_MaelleAndSophie

#include "Basic.hpp"

#include "S_Dialogue_AnimationParameters_structs.hpp"
#include "FRichDialogueLine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_Plazza_MaelleAndSophie.BP_Dialogue_Plazza_MaelleAndSophie_C.ExecuteUbergraph_BP_Dialogue_Plazza_MaelleAndSophie
// 0x1A68 (0x1A68 - 0x0000)
struct BP_Dialogue_Plazza_MaelleAndSophie_C_ExecuteUbergraph_BP_Dialogue_Plazza_MaelleAndSophie final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters;  // 0x0008(0x00C8)(HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x00D8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array;                            // 0x0210(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_5;        // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_6;        // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_7;        // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_8;        // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_9;        // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_9;        // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_10;       // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_10;       // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_11;       // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_11;       // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_12;       // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_12;       // 0x0328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_13;       // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_13;       // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDialogueStage_DialogueStage;           // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0345(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346[0x2];                                      // 0x0346(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0348(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x0478(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_1; // 0x0488(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_2; // 0x0550(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x0618(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x0748(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_2;                          // 0x0878(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x0888(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_3; // 0x0898(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_4; // 0x0960(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_4;             // 0x0A28(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_5; // 0x0B58(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_4;                          // 0x0C20(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_5;             // 0x0C30(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_5;                          // 0x0D60(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_6; // 0x0D70(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_6;             // 0x0E38(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_7; // 0x0F68(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_6;                          // 0x1030(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_7;             // 0x1040(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_7;                          // 0x1170(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_8; // 0x1180(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_8;             // 0x1248(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_9; // 0x1378(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_8;                          // 0x1440(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_9;             // 0x1450(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_9;                          // 0x1580(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_10; // 0x1590(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_10;            // 0x1658(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_11; // 0x1788(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_10;                         // 0x1850(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_11;            // 0x1860(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_11;                         // 0x1990(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_12; // 0x19A0(0x00C8)(HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_Plazza_MaelleAndSophie_C_ExecuteUbergraph_BP_Dialogue_Plazza_MaelleAndSophie) == 0x000008, "Wrong alignment on BP_Dialogue_Plazza_MaelleAndSophie_C_ExecuteUbergraph_BP_Dialogue_Plazza_MaelleAndSophie");
static_assert(sizeof(BP_Dialogue_Plazza_MaelleAndSophie_C_ExecuteUbergraph_BP_Dialogue_Plazza_MaelleAndSophie) == 0x001A68, "Wrong size on BP_Dialogue_Plazza_MaelleAndSophie_C_ExecuteUbergraph_BP_Dialogue_Plazza_MaelleAndSophie");
static_assert(offsetof(BP_Dialogue_Plazza_MaelleAndSophie_C_ExecuteUbergraph_BP_Dialogue_Plazza_MaelleAndSophie, EntryPoint) == 0x000000, "Member 'BP_Dialogue_Plazza_MaelleAndSophie_C_ExecuteUbergraph_BP_Dialogue_Plazza_MaelleAndSophie::EntryPoint' has a wrong offset!");
