#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialogue_Gardens_Maelle_FirstDuel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FBattleStartParams_structs.hpp"
#include "SandFall_structs.hpp"
#include "FRichDialogueLine_structs.hpp"
#include "S_Dialogue_AnimationParameters_structs.hpp"
#include "S_LootContext_structs.hpp"
#include "S_Dialogue_EndParameters_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"


namespace SDK::Params
{

// Function BP_Dialogue_Gardens_Maelle_FirstDuel.BP_Dialogue_Gardens_Maelle_FirstDuel_C.ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FirstDuel
// 0x2C38 (0x2C38 - 0x0000)
struct BP_Dialogue_Gardens_Maelle_FirstDuel_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FirstDuel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue; // 0x0004(0x0010)(NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_5;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_6;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_7;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_8;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_9;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_9;        // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_10;       // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_10;       // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_11;       // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_11;       // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_12;       // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_12;       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_13;       // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_13;       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_14;       // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_14;       // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_15;       // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_15;       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_16;       // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_16;       // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_17;       // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_17;       // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEncounterLevel_ReturnValue;            // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LootContext                         K2Node_MakeStruct_S_LootContext;                   // 0x01B0(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_18;       // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_18;       // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_19;       // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_19;       // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_20;       // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_20;       // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_21;       // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_21;       // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_22;       // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_22;       // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_23;       // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_23;       // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_24;       // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DialogueSystemComponent_C*          CallFunc_GetComponentByClass_ReturnValue_24;       // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_14;           // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_1; // 0x0264(0x0010)(NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_15;           // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_16;           // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_276[0x2];                                      // 0x0276(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFBattleStartParams                    K2Node_Select_Default;                             // 0x0278(0x0158)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine;               // 0x03D0(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_1;                          // 0x0500(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class ABP_Character_MaelleIntroRun_C*> CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0510(0x0010)(ReferenceParm)
	TArray<class ABP_Character_MaelleIntroRun_C*> CallFunc_GetAllActorsOfClassWithTag_OutActors_1;   // 0x0520(0x0010)(ReferenceParm)
	class ABP_Character_MaelleIntroRun_C*         CallFunc_Array_Get_Item;                           // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_MaelleIntroRun_C*         CallFunc_Array_Get_Item_1;                         // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Dialogue_EndParameters              K2Node_MakeStruct_S_Dialogue_EndParameters;        // 0x054A(0x0002)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0558(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0690(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x06A0(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_AddItemToInventory_GeneratedItem;         // 0x06F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x06F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0708(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0718(0x0010)()
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters;  // 0x0728(0x00C8)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x07F0(0x0048)(HasGetValueTypeHash)
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue_2; // 0x0838(0x0010)(NoDestructor)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0848(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0858(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_1; // 0x0868(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_1;             // 0x0930(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_2; // 0x0A60(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_3;                          // 0x0B28(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_2;             // 0x0B38(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_4;                          // 0x0C68(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_3; // 0x0C78(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_3;             // 0x0D40(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_4; // 0x0E70(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_5;                          // 0x0F38(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_4;             // 0x0F48(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_6;                          // 0x1078(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_5; // 0x1088(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_5;             // 0x1150(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_6; // 0x1280(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_7;                          // 0x1348(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_6;             // 0x1358(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_8;                          // 0x1488(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_7; // 0x1498(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_7;             // 0x1560(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_17;           // 0x1690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1691[0x7];                                     // 0x1691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_9;                          // 0x1698(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_8;             // 0x16A8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_10;                         // 0x17D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_8; // 0x17E8(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_9; // 0x18B0(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_10; // 0x1978(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_9;             // 0x1A40(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_11; // 0x1B70(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_11;                         // 0x1C38(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_10;            // 0x1C48(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_12;                         // 0x1D78(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_12; // 0x1D88(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_11;            // 0x1E50(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_13; // 0x1F80(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_13;                         // 0x2048(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_12;            // 0x2058(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_14;                         // 0x2188(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_14; // 0x2198(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_13;            // 0x2260(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_15; // 0x2390(0x00C8)(HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_15;                         // 0x2458(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_14;            // 0x2468(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_16;                         // 0x2598(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_16; // 0x25A8(0x00C8)(HasGetValueTypeHash)
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_15;            // 0x2670(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_HasAlreadyFinishedGame_Result;            // 0x27A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A1[0x7];                                     // 0x27A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_17;                         // 0x27A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_AreTutorialsEnabled_ReturnValue;          // 0x27B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x27B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27BA[0x6];                                     // 0x27BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_17; // 0x27C0(0x00C8)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x2888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2889[0x7];                                     // 0x2889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFRichDialogueLine                     K2Node_MakeStruct_FRichDialogueLine_16;            // 0x2890(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FFRichDialogueLine>             K2Node_MakeArray_Array_18;                         // 0x29C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_18; // 0x29D0(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_19; // 0x2A98(0x00C8)(HasGetValueTypeHash)
	struct FS_Dialogue_AnimationParameters        K2Node_MakeStruct_S_Dialogue_AnimationParameters_20; // 0x2B60(0x00C8)(HasGetValueTypeHash)
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem_1;             // 0x2C28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem_2;             // 0x2C30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Dialogue_Gardens_Maelle_FirstDuel_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FirstDuel) == 0x000008, "Wrong alignment on BP_Dialogue_Gardens_Maelle_FirstDuel_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FirstDuel");
static_assert(sizeof(BP_Dialogue_Gardens_Maelle_FirstDuel_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FirstDuel) == 0x002C38, "Wrong size on BP_Dialogue_Gardens_Maelle_FirstDuel_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FirstDuel");
static_assert(offsetof(BP_Dialogue_Gardens_Maelle_FirstDuel_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FirstDuel, EntryPoint) == 0x000000, "Member 'BP_Dialogue_Gardens_Maelle_FirstDuel_C_ExecuteUbergraph_BP_Dialogue_Gardens_Maelle_FirstDuel::EntryPoint' has a wrong offset!");
