#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight

#include "Basic.hpp"

#include "BP_EnemyWorld_AS_Potatobag_Mage_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight.BP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C
// 0x0020 (0x0D10 - 0x0CF0)
class ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C final : public ABP_EnemyWorld_AS_Potatobag_Mage_C
{
public:
	class UNiagaraComponent*                      Niagara;                                           // 0x0CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0CF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Lantern_SeaCliff_C_02;                          // 0x0D00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C">();
	}
	static class ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C>();
	}
};
static_assert(alignof(ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C) == 0x000010, "Wrong alignment on ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C");
static_assert(sizeof(ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C) == 0x000D10, "Wrong size on ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C");
static_assert(offsetof(ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C, Niagara) == 0x000CF0, "Member 'ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C, PointLight) == 0x000CF8, "Member 'ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C, SM_Lantern_SeaCliff_C_02) == 0x000D00, "Member 'ABP_EnemyWorld_AS_Potatobag_Mage_Alt_Twilight_C::SM_Lantern_SeaCliff_C_02' has a wrong offset!");

}

