#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FluxOceanWave

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_FluxOceanWave_C_UserConstructionScript final
{
public:
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetActorTickInterval_TickInterval_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_FluxOceanWave_C_UserConstructionScript");
static_assert(sizeof(BP_FluxOceanWave_C_UserConstructionScript) == 0x000010, "Wrong size on BP_FluxOceanWave_C_UserConstructionScript");
static_assert(offsetof(BP_FluxOceanWave_C_UserConstructionScript, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_FluxOceanWave_C_UserConstructionScript::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_UserConstructionScript, CallFunc_SetActorTickInterval_TickInterval_ImplicitCast) == 0x000008, "Member 'BP_FluxOceanWave_C_UserConstructionScript::CallFunc_SetActorTickInterval_TickInterval_ImplicitCast' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.UpdateTexture
// 0x0048 (0x0048 - 0x0000)
struct BP_FluxOceanWave_C_UpdateTexture final
{
public:
	double                                        Delta;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_UpdateTexture) == 0x000008, "Wrong alignment on BP_FluxOceanWave_C_UpdateTexture");
static_assert(sizeof(BP_FluxOceanWave_C_UpdateTexture) == 0x000048, "Wrong size on BP_FluxOceanWave_C_UpdateTexture");
static_assert(offsetof(BP_FluxOceanWave_C_UpdateTexture, Delta) == 0x000000, "Member 'BP_FluxOceanWave_C_UpdateTexture::Delta' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_UpdateTexture, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000008, "Member 'BP_FluxOceanWave_C_UpdateTexture::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_UpdateTexture, CallFunc_BreakVector2D_X) == 0x000018, "Member 'BP_FluxOceanWave_C_UpdateTexture::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_UpdateTexture, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'BP_FluxOceanWave_C_UpdateTexture::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_UpdateTexture, K2Node_MakeStruct_LinearColor) == 0x000028, "Member 'BP_FluxOceanWave_C_UpdateTexture::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_UpdateTexture, K2Node_MakeStruct_B_ImplicitCast) == 0x000038, "Member 'BP_FluxOceanWave_C_UpdateTexture::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_UpdateTexture, K2Node_MakeStruct_R_ImplicitCast) == 0x00003C, "Member 'BP_FluxOceanWave_C_UpdateTexture::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_UpdateTexture, K2Node_MakeStruct_G_ImplicitCast) == 0x000040, "Member 'BP_FluxOceanWave_C_UpdateTexture::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.UpdateModifierMaterials
// 0x0018 (0x0018 - 0x0000)
struct BP_FluxOceanWave_C_UpdateModifierMaterials final
{
public:
	TArray<class UMaterialInstanceDynamic*>       Materials;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          UseVelocityMap;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_UpdateModifierMaterials) == 0x000008, "Wrong alignment on BP_FluxOceanWave_C_UpdateModifierMaterials");
static_assert(sizeof(BP_FluxOceanWave_C_UpdateModifierMaterials) == 0x000018, "Wrong size on BP_FluxOceanWave_C_UpdateModifierMaterials");
static_assert(offsetof(BP_FluxOceanWave_C_UpdateModifierMaterials, Materials) == 0x000000, "Member 'BP_FluxOceanWave_C_UpdateModifierMaterials::Materials' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_UpdateModifierMaterials, UseVelocityMap) == 0x000010, "Member 'BP_FluxOceanWave_C_UpdateModifierMaterials::UseVelocityMap' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.SetZLocation
// 0x0158 (0x0158 - 0x0000)
struct BP_FluxOceanWave_C_SetZLocation final
{
public:
	double                                        New_Location_Z;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplyToSurface;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0058(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_SetZLocation) == 0x000008, "Wrong alignment on BP_FluxOceanWave_C_SetZLocation");
static_assert(sizeof(BP_FluxOceanWave_C_SetZLocation) == 0x000158, "Wrong size on BP_FluxOceanWave_C_SetZLocation");
static_assert(offsetof(BP_FluxOceanWave_C_SetZLocation, New_Location_Z) == 0x000000, "Member 'BP_FluxOceanWave_C_SetZLocation::New_Location_Z' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetZLocation, ApplyToSurface) == 0x000008, "Member 'BP_FluxOceanWave_C_SetZLocation::ApplyToSurface' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetZLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_FluxOceanWave_C_SetZLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetZLocation, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_FluxOceanWave_C_SetZLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetZLocation, CallFunc_BreakVector_Y) == 0x000030, "Member 'BP_FluxOceanWave_C_SetZLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetZLocation, CallFunc_BreakVector_Z) == 0x000038, "Member 'BP_FluxOceanWave_C_SetZLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetZLocation, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'BP_FluxOceanWave_C_SetZLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetZLocation, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000058, "Member 'BP_FluxOceanWave_C_SetZLocation::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetZLocation, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000150, "Member 'BP_FluxOceanWave_C_SetZLocation::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.SetWaveTextureAndArea
// 0x0018 (0x0018 - 0x0000)
struct BP_FluxOceanWave_C_SetWaveTextureAndArea final
{
public:
	class UTextureRenderTarget2D*                 Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Area;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_SetWaveTextureAndArea) == 0x000008, "Wrong alignment on BP_FluxOceanWave_C_SetWaveTextureAndArea");
static_assert(sizeof(BP_FluxOceanWave_C_SetWaveTextureAndArea) == 0x000018, "Wrong size on BP_FluxOceanWave_C_SetWaveTextureAndArea");
static_assert(offsetof(BP_FluxOceanWave_C_SetWaveTextureAndArea, Texture) == 0x000000, "Member 'BP_FluxOceanWave_C_SetWaveTextureAndArea::Texture' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetWaveTextureAndArea, Area) == 0x000008, "Member 'BP_FluxOceanWave_C_SetWaveTextureAndArea::Area' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.SetWaveProfile
// 0x0008 (0x0008 - 0x0000)
struct BP_FluxOceanWave_C_SetWaveProfile final
{
public:
	class UPDA_FluxWaveProfile_C*                 Profile;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_SetWaveProfile) == 0x000008, "Wrong alignment on BP_FluxOceanWave_C_SetWaveProfile");
static_assert(sizeof(BP_FluxOceanWave_C_SetWaveProfile) == 0x000008, "Wrong size on BP_FluxOceanWave_C_SetWaveProfile");
static_assert(offsetof(BP_FluxOceanWave_C_SetWaveProfile, Profile) == 0x000000, "Member 'BP_FluxOceanWave_C_SetWaveProfile::Profile' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.SetNiagaraData
// 0x00E0 (0x00E0 - 0x0000)
struct BP_FluxOceanWave_C_SetNiagaraData final
{
public:
	class UNiagaraComponent*                      System;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          RequreWave;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0040(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_1;                // 0x0060(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetSurfaceHeight_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_2;                // 0x0090(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_1;   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_2;   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_3;   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_X_ImplicitCast;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_Y_ImplicitCast;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_Z_ImplicitCast;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_W_ImplicitCast;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_SetNiagaraData) == 0x000010, "Wrong alignment on BP_FluxOceanWave_C_SetNiagaraData");
static_assert(sizeof(BP_FluxOceanWave_C_SetNiagaraData) == 0x0000E0, "Wrong size on BP_FluxOceanWave_C_SetNiagaraData");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, System) == 0x000000, "Member 'BP_FluxOceanWave_C_SetNiagaraData::System' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, RequreWave) == 0x000008, "Member 'BP_FluxOceanWave_C_SetNiagaraData::RequreWave' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000018, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_BreakVector2D_X) == 0x000030, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_BreakVector2D_Y) == 0x000038, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_MakeVector4_ReturnValue) == 0x000040, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_MakeVector4_ReturnValue_1) == 0x000060, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_MakeVector4_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_GetSurfaceHeight_ReturnValue) == 0x000080, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_GetSurfaceHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_MakeVector4_ReturnValue_2) == 0x000090, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_MakeVector4_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x0000B0, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_SetFloatParameter_Param_ImplicitCast_1) == 0x0000B4, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_SetFloatParameter_Param_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_SetFloatParameter_Param_ImplicitCast_2) == 0x0000B8, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_SetFloatParameter_Param_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_SetFloatParameter_Param_ImplicitCast_3) == 0x0000BC, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_SetFloatParameter_Param_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_MakeVector4_X_ImplicitCast) == 0x0000C0, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_MakeVector4_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_MakeVector4_Y_ImplicitCast) == 0x0000C8, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_MakeVector4_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_MakeVector4_Z_ImplicitCast) == 0x0000D0, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_MakeVector4_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_SetNiagaraData, CallFunc_MakeVector4_W_ImplicitCast) == 0x0000D8, "Member 'BP_FluxOceanWave_C_SetNiagaraData::CallFunc_MakeVector4_W_ImplicitCast' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FluxOceanWave_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FluxOceanWave_C_ReceiveTick");
static_assert(sizeof(BP_FluxOceanWave_C_ReceiveTick) == 0x000004, "Wrong size on BP_FluxOceanWave_C_ReceiveTick");
static_assert(offsetof(BP_FluxOceanWave_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FluxOceanWave_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.OnEditorSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_FluxOceanWave_C_OnEditorSelectionChanged final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_OnEditorSelectionChanged) == 0x000001, "Wrong alignment on BP_FluxOceanWave_C_OnEditorSelectionChanged");
static_assert(sizeof(BP_FluxOceanWave_C_OnEditorSelectionChanged) == 0x000001, "Wrong size on BP_FluxOceanWave_C_OnEditorSelectionChanged");
static_assert(offsetof(BP_FluxOceanWave_C_OnEditorSelectionChanged, Selected) == 0x000000, "Member 'BP_FluxOceanWave_C_OnEditorSelectionChanged::Selected' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.OnEditorIterateSimulation
// 0x0004 (0x0004 - 0x0000)
struct BP_FluxOceanWave_C_OnEditorIterateSimulation final
{
public:
	int32                                         Iterations;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_OnEditorIterateSimulation) == 0x000004, "Wrong alignment on BP_FluxOceanWave_C_OnEditorIterateSimulation");
static_assert(sizeof(BP_FluxOceanWave_C_OnEditorIterateSimulation) == 0x000004, "Wrong size on BP_FluxOceanWave_C_OnEditorIterateSimulation");
static_assert(offsetof(BP_FluxOceanWave_C_OnEditorIterateSimulation, Iterations) == 0x000000, "Member 'BP_FluxOceanWave_C_OnEditorIterateSimulation::Iterations' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.InitializeMaterials
// 0x01F8 (0x01F8 - 0x0000)
struct BP_FluxOceanWave_C_InitializeMaterials final
{
public:
	bool                                          ApplyToSurface;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0020(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast;                  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_InitializeMaterials) == 0x000008, "Wrong alignment on BP_FluxOceanWave_C_InitializeMaterials");
static_assert(sizeof(BP_FluxOceanWave_C_InitializeMaterials) == 0x0001F8, "Wrong size on BP_FluxOceanWave_C_InitializeMaterials");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, ApplyToSurface) == 0x000000, "Member 'BP_FluxOceanWave_C_InitializeMaterials::ApplyToSurface' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000020, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, K2Node_MakeArray_Array) == 0x000118, "Member 'BP_FluxOceanWave_C_InitializeMaterials::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000128, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000130, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000148, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_BreakVector_X) == 0x000150, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_BreakVector_Y) == 0x000158, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_BreakVector_Z) == 0x000160, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, K2Node_MakeStruct_LinearColor) == 0x000168, "Member 'BP_FluxOceanWave_C_InitializeMaterials::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000178, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000180, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_BreakVector_X_1) == 0x000198, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_BreakVector_Y_1) == 0x0001A0, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_BreakVector_Z_1) == 0x0001A8, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001B0, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_MakeVector_ReturnValue_1) == 0x0001C8, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001E0, "Member 'BP_FluxOceanWave_C_InitializeMaterials::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, K2Node_MakeStruct_B_ImplicitCast) == 0x0001E8, "Member 'BP_FluxOceanWave_C_InitializeMaterials::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, K2Node_MakeStruct_A_ImplicitCast) == 0x0001EC, "Member 'BP_FluxOceanWave_C_InitializeMaterials::K2Node_MakeStruct_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, K2Node_MakeStruct_R_ImplicitCast) == 0x0001F0, "Member 'BP_FluxOceanWave_C_InitializeMaterials::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeMaterials, K2Node_MakeStruct_G_ImplicitCast) == 0x0001F4, "Member 'BP_FluxOceanWave_C_InitializeMaterials::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.InitializeGenerator
// 0x0018 (0x0018 - 0x0000)
struct BP_FluxOceanWave_C_InitializeGenerator final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextureRenderTargetFormat                    Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextureRenderTargetFormat                    Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextureRenderTargetFormat                    K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_RecreateRenderTarget_NewTexture;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_InitializeGenerator) == 0x000008, "Wrong alignment on BP_FluxOceanWave_C_InitializeGenerator");
static_assert(sizeof(BP_FluxOceanWave_C_InitializeGenerator) == 0x000018, "Wrong size on BP_FluxOceanWave_C_InitializeGenerator");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeGenerator, Temp_bool_Variable) == 0x000000, "Member 'BP_FluxOceanWave_C_InitializeGenerator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeGenerator, Temp_byte_Variable) == 0x000001, "Member 'BP_FluxOceanWave_C_InitializeGenerator::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeGenerator, Temp_byte_Variable_1) == 0x000002, "Member 'BP_FluxOceanWave_C_InitializeGenerator::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeGenerator, K2Node_Select_Default) == 0x000003, "Member 'BP_FluxOceanWave_C_InitializeGenerator::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeGenerator, CallFunc_RecreateRenderTarget_NewTexture) == 0x000008, "Member 'BP_FluxOceanWave_C_InitializeGenerator::CallFunc_RecreateRenderTarget_NewTexture' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeGenerator, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_FluxOceanWave_C_InitializeGenerator::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.InitializeEditor
// 0x00C0 (0x00C0 - 0x0000)
struct BP_FluxOceanWave_C_InitializeEditor final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_FluxTickableEditorEvents_C> K2Node_DynamicCast_AsBPI_Flux_Tickable_Editor_Events; // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_InitializeEditor) == 0x000010, "Wrong alignment on BP_FluxOceanWave_C_InitializeEditor");
static_assert(sizeof(BP_FluxOceanWave_C_InitializeEditor) == 0x0000C0, "Wrong size on BP_FluxOceanWave_C_InitializeEditor");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, Temp_struct_Variable) == 0x000000, "Member 'BP_FluxOceanWave_C_InitializeEditor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_FluxOceanWave_C_InitializeEditor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, CallFunc_AddComponent_ReturnValue) == 0x000068, "Member 'BP_FluxOceanWave_C_InitializeEditor::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, K2Node_MakeArray_Array) == 0x000070, "Member 'BP_FluxOceanWave_C_InitializeEditor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000080, "Member 'BP_FluxOceanWave_C_InitializeEditor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000088, "Member 'BP_FluxOceanWave_C_InitializeEditor::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_FluxOceanWave_C_InitializeEditor::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, K2Node_DynamicCast_AsStatic_Mesh) == 0x000098, "Member 'BP_FluxOceanWave_C_InitializeEditor::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_FluxOceanWave_C_InitializeEditor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A1, "Member 'BP_FluxOceanWave_C_InitializeEditor::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, CallFunc_IsValid_ReturnValue_1) == 0x0000A2, "Member 'BP_FluxOceanWave_C_InitializeEditor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, K2Node_DynamicCast_AsBPI_Flux_Tickable_Editor_Events) == 0x0000A8, "Member 'BP_FluxOceanWave_C_InitializeEditor::K2Node_DynamicCast_AsBPI_Flux_Tickable_Editor_Events' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_InitializeEditor, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'BP_FluxOceanWave_C_InitializeEditor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.GetWaveTextureMaterials
// 0x0028 (0x0028 - 0x0000)
struct BP_FluxOceanWave_C_GetWaveTextureMaterials final
{
public:
	TArray<class UMaterialInstanceDynamic*>       MaterialInstances;                                 // 0x0000(0x0010)(Parm, OutParm)
	TArray<class UMaterialInstanceDynamic*>       K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_GetWaveTextureMaterials) == 0x000008, "Wrong alignment on BP_FluxOceanWave_C_GetWaveTextureMaterials");
static_assert(sizeof(BP_FluxOceanWave_C_GetWaveTextureMaterials) == 0x000028, "Wrong size on BP_FluxOceanWave_C_GetWaveTextureMaterials");
static_assert(offsetof(BP_FluxOceanWave_C_GetWaveTextureMaterials, MaterialInstances) == 0x000000, "Member 'BP_FluxOceanWave_C_GetWaveTextureMaterials::MaterialInstances' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_GetWaveTextureMaterials, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_FluxOceanWave_C_GetWaveTextureMaterials::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_GetWaveTextureMaterials, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_FluxOceanWave_C_GetWaveTextureMaterials::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.ExecuteUbergraph_BP_FluxOceanWave
// 0x0060 (0x0060 - 0x0000)
struct BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Iterations;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Selected;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       K2Node_Event_Materials;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_UseVelocityMap;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_Event_Texture;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_Area;                                 // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPDA_FluxWaveProfile_C*                 K2Node_Event_Profile;                              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateTexture_Delta_ImplicitCast;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave) == 0x000008, "Wrong alignment on BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave");
static_assert(sizeof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave) == 0x000060, "Wrong size on BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave");
static_assert(offsetof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave, EntryPoint) == 0x000000, "Member 'BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave, K2Node_Event_Iterations) == 0x000004, "Member 'BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave::K2Node_Event_Iterations' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave, K2Node_Event_Selected) == 0x000008, "Member 'BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave::K2Node_Event_Selected' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave, K2Node_Event_Materials) == 0x000010, "Member 'BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave::K2Node_Event_Materials' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave, K2Node_Event_UseVelocityMap) == 0x000020, "Member 'BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave::K2Node_Event_UseVelocityMap' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave, K2Node_Event_Texture) == 0x000028, "Member 'BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave::K2Node_Event_Texture' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave, K2Node_Event_Area) == 0x000030, "Member 'BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave::K2Node_Event_Area' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave, K2Node_Event_Profile) == 0x000050, "Member 'BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave::K2Node_Event_Profile' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave, CallFunc_UpdateTexture_Delta_ImplicitCast) == 0x000058, "Member 'BP_FluxOceanWave_C_ExecuteUbergraph_BP_FluxOceanWave::CallFunc_UpdateTexture_Delta_ImplicitCast' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.CanRenderWave
// 0x0001 (0x0001 - 0x0000)
struct BP_FluxOceanWave_C_CanRenderWave final
{
public:
	bool                                          CanRender;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_CanRenderWave) == 0x000001, "Wrong alignment on BP_FluxOceanWave_C_CanRenderWave");
static_assert(sizeof(BP_FluxOceanWave_C_CanRenderWave) == 0x000001, "Wrong size on BP_FluxOceanWave_C_CanRenderWave");
static_assert(offsetof(BP_FluxOceanWave_C_CanRenderWave, CanRender) == 0x000000, "Member 'BP_FluxOceanWave_C_CanRenderWave::CanRender' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.ApplyToSurfaces
// 0x0048 (0x0048 - 0x0000)
struct BP_FluxOceanWave_C_ApplyToSurfaces final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_FluxWaveRenderer_C> K2Node_DynamicCast_AsBPI_Flux_Wave_Renderer;     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxOceanWave_C_ApplyToSurfaces) == 0x000008, "Wrong alignment on BP_FluxOceanWave_C_ApplyToSurfaces");
static_assert(sizeof(BP_FluxOceanWave_C_ApplyToSurfaces) == 0x000048, "Wrong size on BP_FluxOceanWave_C_ApplyToSurfaces");
static_assert(offsetof(BP_FluxOceanWave_C_ApplyToSurfaces, Temp_int_Variable) == 0x000000, "Member 'BP_FluxOceanWave_C_ApplyToSurfaces::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ApplyToSurfaces, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000008, "Member 'BP_FluxOceanWave_C_ApplyToSurfaces::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ApplyToSurfaces, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_FluxOceanWave_C_ApplyToSurfaces::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ApplyToSurfaces, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_FluxOceanWave_C_ApplyToSurfaces::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ApplyToSurfaces, K2Node_DynamicCast_AsBPI_Flux_Wave_Renderer) == 0x000028, "Member 'BP_FluxOceanWave_C_ApplyToSurfaces::K2Node_DynamicCast_AsBPI_Flux_Wave_Renderer' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ApplyToSurfaces, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_FluxOceanWave_C_ApplyToSurfaces::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ApplyToSurfaces, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_FluxOceanWave_C_ApplyToSurfaces::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxOceanWave_C_ApplyToSurfaces, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_FluxOceanWave_C_ApplyToSurfaces::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_FluxOceanWave.BP_FluxOceanWave_C.SetMaterialData
// 0x02A8 (0x02A8 - 0x0000)
struct BP_FluxOceanWave_C_SetMaterialData final
{
public:
	TArray<class UMaterialInstanceDynamic*>       Materials;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_11;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
