#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FluxSurface

#include "Basic.hpp"

#include "BS_FluxSplashData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BS_MeshDefinition_structs.hpp"
#include "Engine_structs.hpp"
#include "BE_UnderwaterVisibility_structs.hpp"


namespace SDK::Params
{

// Function BP_FluxSurface.BP_FluxSurface_C.UserConstructionScript
// 0x0068 (0x0068 - 0x0000)
struct BP_FluxSurface_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBE_UnderwaterVisibility                      Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASkyLight*>                      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	EBE_UnderwaterVisibility                      Temp_byte_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkyLight*                              CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ASkyLight>               CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0030(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_FluxSurface_C_UserConstructionScript");
static_assert(sizeof(BP_FluxSurface_C_UserConstructionScript) == 0x000068, "Wrong size on BP_FluxSurface_C_UserConstructionScript");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'BP_FluxSurface_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, Temp_bool_Variable_1) == 0x000001, "Member 'BP_FluxSurface_C_UserConstructionScript::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, Temp_bool_Variable_2) == 0x000002, "Member 'BP_FluxSurface_C_UserConstructionScript::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, Temp_byte_Variable) == 0x000003, "Member 'BP_FluxSurface_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, Temp_bool_Variable_3) == 0x000004, "Member 'BP_FluxSurface_C_UserConstructionScript::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, Temp_bool_Variable_4) == 0x000005, "Member 'BP_FluxSurface_C_UserConstructionScript::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, Temp_bool_Variable_5) == 0x000006, "Member 'BP_FluxSurface_C_UserConstructionScript::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, Temp_bool_Variable_6) == 0x000007, "Member 'BP_FluxSurface_C_UserConstructionScript::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000008, "Member 'BP_FluxSurface_C_UserConstructionScript::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_FluxSurface_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, Temp_bool_Variable_7) == 0x00000A, "Member 'BP_FluxSurface_C_UserConstructionScript::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, K2Node_Select_Default) == 0x00000B, "Member 'BP_FluxSurface_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_FluxSurface_C_UserConstructionScript::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, Temp_byte_Variable_1) == 0x000020, "Member 'BP_FluxSurface_C_UserConstructionScript::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_FluxSurface_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000030, "Member 'BP_FluxSurface_C_UserConstructionScript::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000058, "Member 'BP_FluxSurface_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'BP_FluxSurface_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'BP_FluxSurface_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.UpdateHeightMap
// 0x0020 (0x0020 - 0x0000)
struct BP_FluxSurface_C_UpdateHeightMap final
{
public:
	class UTexture*                               Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_UpdateHeightMap) == 0x000008, "Wrong alignment on BP_FluxSurface_C_UpdateHeightMap");
static_assert(sizeof(BP_FluxSurface_C_UpdateHeightMap) == 0x000020, "Wrong size on BP_FluxSurface_C_UpdateHeightMap");
static_assert(offsetof(BP_FluxSurface_C_UpdateHeightMap, Value) == 0x000000, "Member 'BP_FluxSurface_C_UpdateHeightMap::Value' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateHeightMap, Temp_int_Variable) == 0x000008, "Member 'BP_FluxSurface_C_UpdateHeightMap::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateHeightMap, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_FluxSurface_C_UpdateHeightMap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateHeightMap, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_FluxSurface_C_UpdateHeightMap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateHeightMap, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_FluxSurface_C_UpdateHeightMap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateHeightMap, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_FluxSurface_C_UpdateHeightMap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.UpdateCamera
// 0x00D0 (0x00D0 - 0x0000)
struct BP_FluxSurface_C_UpdateCamera final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AudioNearSurface;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             NewAmbientAudio;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LCameraComponent;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CamraNearSurface;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetUndefiniedHeight_NewParam;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBE_UnderwaterVisibility                      Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast_1; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_UpdateCamera) == 0x000008, "Wrong alignment on BP_FluxSurface_C_UpdateCamera");
static_assert(sizeof(BP_FluxSurface_C_UpdateCamera) == 0x0000D0, "Wrong size on BP_FluxSurface_C_UpdateCamera");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, DeltaTime) == 0x000000, "Member 'BP_FluxSurface_C_UpdateCamera::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, AudioNearSurface) == 0x000008, "Member 'BP_FluxSurface_C_UpdateCamera::AudioNearSurface' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, NewAmbientAudio) == 0x000010, "Member 'BP_FluxSurface_C_UpdateCamera::NewAmbientAudio' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, LCameraComponent) == 0x000018, "Member 'BP_FluxSurface_C_UpdateCamera::LCameraComponent' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CamraNearSurface) == 0x000020, "Member 'BP_FluxSurface_C_UpdateCamera::CamraNearSurface' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00002A, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_IsValid_ReturnValue_2) == 0x00002B, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, K2Node_SwitchEnum_CmpSuccess) == 0x00002C, "Member 'BP_FluxSurface_C_UpdateCamera::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, K2Node_SwitchEnum_CmpSuccess_1) == 0x00002D, "Member 'BP_FluxSurface_C_UpdateCamera::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, Temp_bool_Variable) == 0x00002E, "Member 'BP_FluxSurface_C_UpdateCamera::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_Lerp_ReturnValue) == 0x000030, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_GetUndefiniedHeight_NewParam) == 0x000038, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_GetUndefiniedHeight_NewParam' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000041, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000042, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_Not_PreBool_ReturnValue) == 0x000043, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, Temp_byte_Variable) == 0x000050, "Member 'BP_FluxSurface_C_UpdateCamera::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x000051, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_BooleanAND_ReturnValue) == 0x000052, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, K2Node_Select_Default) == 0x000053, "Member 'BP_FluxSurface_C_UpdateCamera::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000054, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_IsValid_ReturnValue_3) == 0x000055, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000058, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000060, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_GetCameraLocation_ReturnValue) == 0x000068, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_BreakVector_X) == 0x000080, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_BreakVector_Y) == 0x000088, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_BreakVector_Z) == 0x000090, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_BreakVector_X_1) == 0x000098, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_BreakVector_Y_1) == 0x0000A0, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_BreakVector_Z_1) == 0x0000A8, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x0000B8, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_SetFloatParameter_InFloat_ImplicitCast_1) == 0x0000BC, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_SetFloatParameter_InFloat_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_Lerp_A_ImplicitCast) == 0x0000C0, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_Lerp_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast) == 0x0000C8, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_UpdateCamera, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000CC, "Member 'BP_FluxSurface_C_UpdateCamera::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.SpawnSplashAtLocation
// 0x0020 (0x0020 - 0x0000)
struct BP_FluxSurface_C_SpawnSplashAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_SpawnSplashAtLocation) == 0x000008, "Wrong alignment on BP_FluxSurface_C_SpawnSplashAtLocation");
static_assert(sizeof(BP_FluxSurface_C_SpawnSplashAtLocation) == 0x000020, "Wrong size on BP_FluxSurface_C_SpawnSplashAtLocation");
static_assert(offsetof(BP_FluxSurface_C_SpawnSplashAtLocation, Location) == 0x000000, "Member 'BP_FluxSurface_C_SpawnSplashAtLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SpawnSplashAtLocation, Type) == 0x000018, "Member 'BP_FluxSurface_C_SpawnSplashAtLocation::Type' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.SpawnSplash
// 0x0030 (0x0030 - 0x0000)
struct BP_FluxSurface_C_SpawnSplash final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBS_FluxSplashData                     BS_FluxSplashData;                                 // 0x0018(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_SpawnSplash) == 0x000008, "Wrong alignment on BP_FluxSurface_C_SpawnSplash");
static_assert(sizeof(BP_FluxSurface_C_SpawnSplash) == 0x000030, "Wrong size on BP_FluxSurface_C_SpawnSplash");
static_assert(offsetof(BP_FluxSurface_C_SpawnSplash, Location) == 0x000000, "Member 'BP_FluxSurface_C_SpawnSplash::Location' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SpawnSplash, BS_FluxSplashData) == 0x000018, "Member 'BP_FluxSurface_C_SpawnSplash::BS_FluxSplashData' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SpawnSplash, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000028, "Member 'BP_FluxSurface_C_SpawnSplash::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.SetWaveTextureAndArea
// 0x0018 (0x0018 - 0x0000)
struct BP_FluxSurface_C_SetWaveTextureAndArea final
{
public:
	class UTextureRenderTarget2D*                 Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Area;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_SetWaveTextureAndArea) == 0x000008, "Wrong alignment on BP_FluxSurface_C_SetWaveTextureAndArea");
static_assert(sizeof(BP_FluxSurface_C_SetWaveTextureAndArea) == 0x000018, "Wrong size on BP_FluxSurface_C_SetWaveTextureAndArea");
static_assert(offsetof(BP_FluxSurface_C_SetWaveTextureAndArea, Texture) == 0x000000, "Member 'BP_FluxSurface_C_SetWaveTextureAndArea::Texture' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetWaveTextureAndArea, Area) == 0x000008, "Member 'BP_FluxSurface_C_SetWaveTextureAndArea::Area' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.SetWaveProfile
// 0x0008 (0x0008 - 0x0000)
struct BP_FluxSurface_C_SetWaveProfile final
{
public:
	class UPDA_FluxWaveProfile_C*                 Profile;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_SetWaveProfile) == 0x000008, "Wrong alignment on BP_FluxSurface_C_SetWaveProfile");
static_assert(sizeof(BP_FluxSurface_C_SetWaveProfile) == 0x000008, "Wrong size on BP_FluxSurface_C_SetWaveProfile");
static_assert(offsetof(BP_FluxSurface_C_SetWaveProfile, Profile) == 0x000000, "Member 'BP_FluxSurface_C_SetWaveProfile::Profile' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.SetStateHeightWetMap
// 0x0008 (0x0008 - 0x0000)
struct BP_FluxSurface_C_SetStateHeightWetMap final
{
public:
	class UTexture*                               Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_SetStateHeightWetMap) == 0x000008, "Wrong alignment on BP_FluxSurface_C_SetStateHeightWetMap");
static_assert(sizeof(BP_FluxSurface_C_SetStateHeightWetMap) == 0x000008, "Wrong size on BP_FluxSurface_C_SetStateHeightWetMap");
static_assert(offsetof(BP_FluxSurface_C_SetStateHeightWetMap, Texture) == 0x000000, "Member 'BP_FluxSurface_C_SetStateHeightWetMap::Texture' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.SetSimulationState
// 0x0008 (0x0008 - 0x0000)
struct BP_FluxSurface_C_SetSimulationState final
{
public:
	class UPDA_FluxSimulationState_C*             State;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_SetSimulationState) == 0x000008, "Wrong alignment on BP_FluxSurface_C_SetSimulationState");
static_assert(sizeof(BP_FluxSurface_C_SetSimulationState) == 0x000008, "Wrong size on BP_FluxSurface_C_SetSimulationState");
static_assert(offsetof(BP_FluxSurface_C_SetSimulationState, State) == 0x000000, "Member 'BP_FluxSurface_C_SetSimulationState::State' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.SetNiagaraData
// 0x0060 (0x0060 - 0x0000)
struct BP_FluxSurface_C_SetNiagaraData final
{
public:
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          RequiredGround;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RequiredWave;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetSurfaceHeight_SurfaceHeight;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetSurfaceHeight_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_Get_Cut_Mask_Mask;                        // 0x0030(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_1;   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_SetNiagaraData) == 0x000010, "Wrong alignment on BP_FluxSurface_C_SetNiagaraData");
static_assert(sizeof(BP_FluxSurface_C_SetNiagaraData) == 0x000060, "Wrong size on BP_FluxSurface_C_SetNiagaraData");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, NiagaraSystem) == 0x000000, "Member 'BP_FluxSurface_C_SetNiagaraData::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, RequiredGround) == 0x000008, "Member 'BP_FluxSurface_C_SetNiagaraData::RequiredGround' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, RequiredWave) == 0x000009, "Member 'BP_FluxSurface_C_SetNiagaraData::RequiredWave' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'BP_FluxSurface_C_SetNiagaraData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, CallFunc_IsValid_ReturnValue_1) == 0x00000B, "Member 'BP_FluxSurface_C_SetNiagaraData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, CallFunc_GetSurfaceHeight_SurfaceHeight) == 0x000010, "Member 'BP_FluxSurface_C_SetNiagaraData::CallFunc_GetSurfaceHeight_SurfaceHeight' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, CallFunc_IsValid_ReturnValue_2) == 0x000018, "Member 'BP_FluxSurface_C_SetNiagaraData::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, CallFunc_IsValid_ReturnValue_3) == 0x000019, "Member 'BP_FluxSurface_C_SetNiagaraData::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, CallFunc_GetSurfaceHeight_ReturnValue) == 0x000020, "Member 'BP_FluxSurface_C_SetNiagaraData::CallFunc_GetSurfaceHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, CallFunc_Get_Cut_Mask_Mask) == 0x000030, "Member 'BP_FluxSurface_C_SetNiagaraData::CallFunc_Get_Cut_Mask_Mask' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, CallFunc_IsValid_ReturnValue_4) == 0x000050, "Member 'BP_FluxSurface_C_SetNiagaraData::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000054, "Member 'BP_FluxSurface_C_SetNiagaraData::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetNiagaraData, CallFunc_SetFloatParameter_Param_ImplicitCast_1) == 0x000058, "Member 'BP_FluxSurface_C_SetNiagaraData::CallFunc_SetFloatParameter_Param_ImplicitCast_1' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.SetInteractionsTexture
// 0x0008 (0x0008 - 0x0000)
struct BP_FluxSurface_C_SetInteractionsTexture final
{
public:
	class UTextureRenderTarget2D*                 Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_SetInteractionsTexture) == 0x000008, "Wrong alignment on BP_FluxSurface_C_SetInteractionsTexture");
static_assert(sizeof(BP_FluxSurface_C_SetInteractionsTexture) == 0x000008, "Wrong size on BP_FluxSurface_C_SetInteractionsTexture");
static_assert(offsetof(BP_FluxSurface_C_SetInteractionsTexture, Texture) == 0x000000, "Member 'BP_FluxSurface_C_SetInteractionsTexture::Texture' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.SetInteractionsArea
// 0x0010 (0x0010 - 0x0000)
struct BP_FluxSurface_C_SetInteractionsArea final
{
public:
	struct FLinearColor                           Area;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_SetInteractionsArea) == 0x000004, "Wrong alignment on BP_FluxSurface_C_SetInteractionsArea");
static_assert(sizeof(BP_FluxSurface_C_SetInteractionsArea) == 0x000010, "Wrong size on BP_FluxSurface_C_SetInteractionsArea");
static_assert(offsetof(BP_FluxSurface_C_SetInteractionsArea, Area) == 0x000000, "Member 'BP_FluxSurface_C_SetInteractionsArea::Area' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.SetColorPreset
// 0x0010 (0x0010 - 0x0000)
struct BP_FluxSurface_C_SetColorPreset final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPDA_FluxSurfacePreset_C*               Preset;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_SetColorPreset) == 0x000008, "Wrong alignment on BP_FluxSurface_C_SetColorPreset");
static_assert(sizeof(BP_FluxSurface_C_SetColorPreset) == 0x000010, "Wrong size on BP_FluxSurface_C_SetColorPreset");
static_assert(offsetof(BP_FluxSurface_C_SetColorPreset, Index_0) == 0x000000, "Member 'BP_FluxSurface_C_SetColorPreset::Index_0' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetColorPreset, Preset) == 0x000008, "Member 'BP_FluxSurface_C_SetColorPreset::Preset' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.SetCoastlineState
// 0x0008 (0x0008 - 0x0000)
struct BP_FluxSurface_C_SetCoastlineState final
{
public:
	class UPDA_FluxCoastlineState_C*              State;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_SetCoastlineState) == 0x000008, "Wrong alignment on BP_FluxSurface_C_SetCoastlineState");
static_assert(sizeof(BP_FluxSurface_C_SetCoastlineState) == 0x000008, "Wrong size on BP_FluxSurface_C_SetCoastlineState");
static_assert(offsetof(BP_FluxSurface_C_SetCoastlineState, State) == 0x000000, "Member 'BP_FluxSurface_C_SetCoastlineState::State' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.SetCameraUnderVisibility
// 0x0078 (0x0078 - 0x0000)
struct BP_FluxSurface_C_SetCameraUnderVisibility final
{
public:
	bool                                          PostProcessVolume;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BottomSurface;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      Controller;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ViewTargetActor;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_FluxCameraEvents_C> K2Node_DynamicCast_AsBPI_Flux_Camera_Events;     // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_SetCameraUnderVisibility) == 0x000008, "Wrong alignment on BP_FluxSurface_C_SetCameraUnderVisibility");
static_assert(sizeof(BP_FluxSurface_C_SetCameraUnderVisibility) == 0x000078, "Wrong size on BP_FluxSurface_C_SetCameraUnderVisibility");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, PostProcessVolume) == 0x000000, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::PostProcessVolume' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, BottomSurface) == 0x000001, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::BottomSurface' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, Controller) == 0x000008, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::Controller' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, ViewTargetActor) == 0x000010, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::ViewTargetActor' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, Temp_int_Variable) == 0x000018, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, Temp_int_Variable_1) == 0x000024, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x00003D, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_IsValid_ReturnValue_2) == 0x00003E, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_GetViewTarget_ReturnValue) == 0x000040, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, K2Node_DynamicCast_AsBPI_Flux_Camera_Events) == 0x000050, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::K2Node_DynamicCast_AsBPI_Flux_Camera_Events' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_Array_Length_ReturnValue_1) == 0x000064, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_SetCameraUnderVisibility, CallFunc_Less_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_FluxSurface_C_SetCameraUnderVisibility::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.RemovePostprocess
// 0x0068 (0x0068 - 0x0000)
struct BP_FluxSurface_C_RemovePostprocess final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     CallFunc_Array_Get_Item;                           // 0x0018(0x0010)(NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0030(0x0010)(NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxSurface_C_RemovePostprocess) == 0x000008, "Wrong alignment on BP_FluxSurface_C_RemovePostprocess");
static_assert(sizeof(BP_FluxSurface_C_RemovePostprocess) == 0x000068, "Wrong size on BP_FluxSurface_C_RemovePostprocess");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_FluxSurface_C_RemovePostprocess::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BP_FluxSurface_C_RemovePostprocess::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_FluxSurface_C_RemovePostprocess::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_FluxSurface_C_RemovePostprocess::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_FluxSurface_C_RemovePostprocess::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_FluxSurface_C_RemovePostprocess::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_FluxSurface_C_RemovePostprocess::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, CallFunc_Max_ReturnValue) == 0x00002C, "Member 'BP_FluxSurface_C_RemovePostprocess::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, K2Node_MakeStruct_WeightedBlendable) == 0x000030, "Member 'BP_FluxSurface_C_RemovePostprocess::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, CallFunc_Array_RemoveItem_ReturnValue) == 0x000040, "Member 'BP_FluxSurface_C_RemovePostprocess::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, K2Node_DynamicCast_AsMaterial_Instance) == 0x000048, "Member 'BP_FluxSurface_C_RemovePostprocess::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_FluxSurface_C_RemovePostprocess::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FluxSurface_C_RemovePostprocess, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000058, "Member 'BP_FluxSurface_C_RemovePostprocess::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");

// Function BP_FluxSurface.BP_FluxSurface_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FluxSurface_C_ReceiveTick final
{
public:
