#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FluxMeshGenerator

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FluxMeshGenerator.BP_FluxMeshGenerator_C
// 0x0020 (0x00C0 - 0x00A0)
class UBP_FluxMeshGenerator_C final : public UActorComponent
{
public:
	class UTextureRenderTarget2D*                 HeightBuffer;                                      // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 VelocityBuffer;                                    // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ReadHeightMaterial;                                // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ReadVelocityMaterial;                              // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ReadWater(const struct FVector2D& UV, struct FVector2D* Velocity, double* Water, double* Foam);
	void InitializeBuffers(class UPDA_FluxSimulationState_C* State, uint8 EdgePadding, double FoamScale);
	void GetTriangle(TArray<int32>& Array, int32 Index_0, int32* One, int32* Two, int32* Three);
	void GenerateMesh(class UProceduralMeshComponent* InitMesh, class UPDA_FluxSimulationState_C* InitState, int32 LOD, class UMaterialInterface* Material, uint8 Padding, int32* Vetticles, int32* Polygons);

	void ReadHeight(struct FVector2D& UV, double* Height) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FluxMeshGenerator_C">();
	}
	static class UBP_FluxMeshGenerator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FluxMeshGenerator_C>();
	}
};
static_assert(alignof(UBP_FluxMeshGenerator_C) == 0x000008, "Wrong alignment on UBP_FluxMeshGenerator_C");
static_assert(sizeof(UBP_FluxMeshGenerator_C) == 0x0000C0, "Wrong size on UBP_FluxMeshGenerator_C");
static_assert(offsetof(UBP_FluxMeshGenerator_C, HeightBuffer) == 0x0000A0, "Member 'UBP_FluxMeshGenerator_C::HeightBuffer' has a wrong offset!");
static_assert(offsetof(UBP_FluxMeshGenerator_C, VelocityBuffer) == 0x0000A8, "Member 'UBP_FluxMeshGenerator_C::VelocityBuffer' has a wrong offset!");
static_assert(offsetof(UBP_FluxMeshGenerator_C, ReadHeightMaterial) == 0x0000B0, "Member 'UBP_FluxMeshGenerator_C::ReadHeightMaterial' has a wrong offset!");
static_assert(offsetof(UBP_FluxMeshGenerator_C, ReadVelocityMaterial) == 0x0000B8, "Member 'UBP_FluxMeshGenerator_C::ReadVelocityMaterial' has a wrong offset!");

}

