#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FluxInteractionComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BS_InteractionSource_structs.hpp"
#include "BS_FluxInteractionData_structs.hpp"


namespace SDK::Params
{

// Function BP_FluxInteractionComponent.BP_FluxInteractionComponent_C.DrawDebugInteractions
// 0x00B0 (0x00B0 - 0x0000)
struct BP_FluxInteractionComponent_C_DrawDebugInteractions final
{
public:
	struct FLinearColor                           DebugColor;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnerTouchingFluid_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxInteractionComponent_C_DrawDebugInteractions) == 0x000008, "Wrong alignment on BP_FluxInteractionComponent_C_DrawDebugInteractions");
static_assert(sizeof(BP_FluxInteractionComponent_C_DrawDebugInteractions) == 0x0000B0, "Wrong size on BP_FluxInteractionComponent_C_DrawDebugInteractions");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, DebugColor) == 0x000000, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::DebugColor' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, Temp_bool_Variable) == 0x000010, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, Temp_struct_Variable) == 0x000014, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, Temp_struct_Variable_1) == 0x000024, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, CallFunc_IsOwnerTouchingFluid_ReturnValue) == 0x000040, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::CallFunc_IsOwnerTouchingFluid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, CallFunc_GetComponentBounds_Origin) == 0x000048, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, CallFunc_GetComponentBounds_BoxExtent) == 0x000060, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, CallFunc_GetComponentBounds_SphereRadius) == 0x000078, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, K2Node_Select_Default) == 0x00007C, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_DrawDebugInteractions, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_FluxInteractionComponent_C_DrawDebugInteractions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_FluxInteractionComponent.BP_FluxInteractionComponent_C.ExecuteUbergraph_BP_FluxInteractionComponent
// 0x0078 (0x0078 - 0x0000)
struct BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UActorComponent* Component, bool bReset)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UActorComponent* Component)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_FluxDataComponent_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetOwnerComponent_SceneComponent;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_CustomEvent_Component_1;                    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bReset;                         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_CustomEvent_Component;                      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent) == 0x000008, "Wrong alignment on BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent");
static_assert(sizeof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent) == 0x000078, "Wrong size on BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, EntryPoint) == 0x000000, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, CallFunc_IsActive_ReturnValue) == 0x000038, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, K2Node_Event_DeltaSeconds) == 0x00003C, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, CallFunc_GetOwnerComponent_SceneComponent) == 0x000048, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::CallFunc_GetOwnerComponent_SceneComponent' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000050, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, K2Node_CustomEvent_Component_1) == 0x000058, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::K2Node_CustomEvent_Component_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, K2Node_CustomEvent_bReset) == 0x000060, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::K2Node_CustomEvent_bReset' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, K2Node_CustomEvent_Component) == 0x000068, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::K2Node_CustomEvent_Component' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_FluxInteractionComponent_C_ExecuteUbergraph_BP_FluxInteractionComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");

// Function BP_FluxInteractionComponent.BP_FluxInteractionComponent_C.OnComponentActivatedEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_FluxInteractionComponent_C_OnComponentActivatedEvent final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxInteractionComponent_C_OnComponentActivatedEvent) == 0x000008, "Wrong alignment on BP_FluxInteractionComponent_C_OnComponentActivatedEvent");
static_assert(sizeof(BP_FluxInteractionComponent_C_OnComponentActivatedEvent) == 0x000010, "Wrong size on BP_FluxInteractionComponent_C_OnComponentActivatedEvent");
static_assert(offsetof(BP_FluxInteractionComponent_C_OnComponentActivatedEvent, Component) == 0x000000, "Member 'BP_FluxInteractionComponent_C_OnComponentActivatedEvent::Component' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_OnComponentActivatedEvent, bReset) == 0x000008, "Member 'BP_FluxInteractionComponent_C_OnComponentActivatedEvent::bReset' has a wrong offset!");

// Function BP_FluxInteractionComponent.BP_FluxInteractionComponent_C.OnComponentDeactivatedEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_FluxInteractionComponent_C_OnComponentDeactivatedEvent final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxInteractionComponent_C_OnComponentDeactivatedEvent) == 0x000008, "Wrong alignment on BP_FluxInteractionComponent_C_OnComponentDeactivatedEvent");
static_assert(sizeof(BP_FluxInteractionComponent_C_OnComponentDeactivatedEvent) == 0x000008, "Wrong size on BP_FluxInteractionComponent_C_OnComponentDeactivatedEvent");
static_assert(offsetof(BP_FluxInteractionComponent_C_OnComponentDeactivatedEvent, Component) == 0x000000, "Member 'BP_FluxInteractionComponent_C_OnComponentDeactivatedEvent::Component' has a wrong offset!");

// Function BP_FluxInteractionComponent.BP_FluxInteractionComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FluxInteractionComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxInteractionComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FluxInteractionComponent_C_ReceiveTick");
static_assert(sizeof(BP_FluxInteractionComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_FluxInteractionComponent_C_ReceiveTick");
static_assert(offsetof(BP_FluxInteractionComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FluxInteractionComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FluxInteractionComponent.BP_FluxInteractionComponent_C.ResizeArrays
// 0x0004 (0x0004 - 0x0000)
struct BP_FluxInteractionComponent_C_ResizeArrays final
{
public:
	int32                                         Size;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxInteractionComponent_C_ResizeArrays) == 0x000004, "Wrong alignment on BP_FluxInteractionComponent_C_ResizeArrays");
static_assert(sizeof(BP_FluxInteractionComponent_C_ResizeArrays) == 0x000004, "Wrong size on BP_FluxInteractionComponent_C_ResizeArrays");
static_assert(offsetof(BP_FluxInteractionComponent_C_ResizeArrays, Size) == 0x000000, "Member 'BP_FluxInteractionComponent_C_ResizeArrays::Size' has a wrong offset!");

// Function BP_FluxInteractionComponent.BP_FluxInteractionComponent_C.Set Sources
// 0x0018 (0x0018 - 0x0000)
struct BP_FluxInteractionComponent_C_Set_Sources final
{
public:
	TArray<struct FBS_InteractionSource>          Sources_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxInteractionComponent_C_Set_Sources) == 0x000008, "Wrong alignment on BP_FluxInteractionComponent_C_Set_Sources");
static_assert(sizeof(BP_FluxInteractionComponent_C_Set_Sources) == 0x000018, "Wrong size on BP_FluxInteractionComponent_C_Set_Sources");
static_assert(offsetof(BP_FluxInteractionComponent_C_Set_Sources, Sources_0) == 0x000000, "Member 'BP_FluxInteractionComponent_C_Set_Sources::Sources_0' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_Set_Sources, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_FluxInteractionComponent_C_Set_Sources::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BP_FluxInteractionComponent.BP_FluxInteractionComponent_C.UpdateAttachmentsAndSplashes
// 0x01B0 (0x01B0 - 0x0000)
struct BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes final
{
public:
	bool                                          IsOverSurface;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0034(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnerTouchingFluid_ReturnValue;         // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_FluxSurface_C>    K2Node_DynamicCast_AsBPI_Flux_Surface;             // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_3;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0xE];                                       // 0x00E2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBS_InteractionSource                  CallFunc_Array_Get_Item;                           // 0x00F0(0x0090)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocation_Location;                     // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes) == 0x000010, "Wrong alignment on BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes");
static_assert(sizeof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes) == 0x0001B0, "Wrong size on BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, IsOverSurface) == 0x000000, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::IsOverSurface' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, Location) == 0x000008, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::Location' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, Index_0) == 0x000020, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::Index_0' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, Temp_bool_Variable) == 0x000024, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, Temp_bool_Variable_1) == 0x000034, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000035, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_IsOwnerTouchingFluid_ReturnValue) == 0x000036, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_IsOwnerTouchingFluid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_BreakVector_X) == 0x000040, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_BreakVector_Y) == 0x000048, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_BreakVector_Z) == 0x000050, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_BreakVector_X_1) == 0x000058, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_BreakVector_Y_1) == 0x000060, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_BreakVector_Z_1) == 0x000068, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_BreakVector_X_2) == 0x000070, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_BreakVector_Y_2) == 0x000078, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_BreakVector_Z_2) == 0x000080, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, K2Node_DynamicCast_AsBPI_Flux_Surface) == 0x000088, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::K2Node_DynamicCast_AsBPI_Flux_Surface' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_MakeVector_ReturnValue) == 0x0000A0, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_BreakVector_X_3) == 0x0000C0, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_BreakVector_Y_3) == 0x0000C8, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_BreakVector_Z_3) == 0x0000D0, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000E0, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000E1, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_Array_Length_ReturnValue) == 0x000180, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_GetLocation_Location) == 0x000188, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_GetLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes, CallFunc_Less_IntInt_ReturnValue) == 0x0001A0, "Member 'BP_FluxInteractionComponent_C_UpdateAttachmentsAndSplashes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_FluxInteractionComponent.BP_FluxInteractionComponent_C.CalculateInteractionData
// 0x0360 (0x0360 - 0x0000)
struct BP_FluxInteractionComponent_C_CalculateInteractionData final
{
public:
	double                                        TimeRatio;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Iteration;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBS_FluxInteractionData>        Interactions;                                      // 0x0010(0x0010)(Parm, OutParm)
	double                                        Force;                                             // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBS_InteractionSource                  Source;                                            // 0x0030(0x0090)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x00D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBS_FluxInteractionData>        Result;                                            // 0x00F0(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBS_FluxInteractionData                K2Node_MakeStruct_BS_FluxInteractionData;          // 0x01D0(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0xC];                                      // 0x0284(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBS_InteractionSource                  CallFunc_Array_Get_Item_2;                         // 0x0290(0x0090)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawDebugSphere_Radius_ImplicitCast;      // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_2;   // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Force_8_20A6B7304C8BF8E070FC6BAF4DE3DF6F_ImplicitCast; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Radius_9_EC5FD1B14AF3F247D25442B53A6EC366_ImplicitCast; // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FluxInteractionComponent_C_CalculateInteractionData) == 0x000010, "Wrong alignment on BP_FluxInteractionComponent_C_CalculateInteractionData");
static_assert(sizeof(BP_FluxInteractionComponent_C_CalculateInteractionData) == 0x000360, "Wrong size on BP_FluxInteractionComponent_C_CalculateInteractionData");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, TimeRatio) == 0x000000, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::TimeRatio' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, Iteration) == 0x000008, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::Iteration' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, Interactions) == 0x000010, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::Interactions' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, Force) == 0x000020, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::Force' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, Source) == 0x000030, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::Source' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, Velocity) == 0x0000C0, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::Velocity' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, Location) == 0x0000D8, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::Location' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, Result) == 0x0000F0, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::Result' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000100, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, Temp_int_Array_Index_Variable) == 0x000104, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, Temp_int_Loop_Counter_Variable) == 0x000108, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Add_IntInt_ReturnValue) == 0x00010C, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000110, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000118, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000120, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000128, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000130, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000138, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Array_Get_Item) == 0x000150, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Add_VectorVector_ReturnValue) == 0x000168, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Array_Get_Item_1) == 0x000180, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000198, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0001A0, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0001A8, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_BreakVector_X) == 0x0001B8, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_BreakVector_Y) == 0x0001C0, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_BreakVector_Z) == 0x0001C8, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, K2Node_MakeStruct_BS_FluxInteractionData) == 0x0001D0, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::K2Node_MakeStruct_BS_FluxInteractionData' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Array_Add_ReturnValue) == 0x0001F0, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_BreakVector_X_1) == 0x0001F8, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_BreakVector_Y_1) == 0x000200, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_BreakVector_Z_1) == 0x000208, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000210, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_VSize_ReturnValue) == 0x000218, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Abs_ReturnValue) == 0x000220, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000228, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_MapRangeClamped_ReturnValue) == 0x000230, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_FClamp_ReturnValue) == 0x000238, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000240, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000248, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FluxInteractionComponent_C_CalculateInteractionData, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000250, "Member 'BP_FluxInteractionComponent_C_CalculateInteractionData::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
