#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameAction_PlayCharacterAnimation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_CharacterAnimationParameters_structs.hpp"


namespace SDK::Params
{

// Function BP_GameAction_PlayCharacterAnimation.BP_GameAction_PlayCharacterAnimation_C.GetInstanceClass
// 0x0008 (0x0008 - 0x0000)
struct BP_GameAction_PlayCharacterAnimation_C_GetInstanceClass final
{
public:
	TSubclassOf<class UGameActionInstance>        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameAction_PlayCharacterAnimation_C_GetInstanceClass) == 0x000008, "Wrong alignment on BP_GameAction_PlayCharacterAnimation_C_GetInstanceClass");
static_assert(sizeof(BP_GameAction_PlayCharacterAnimation_C_GetInstanceClass) == 0x000008, "Wrong size on BP_GameAction_PlayCharacterAnimation_C_GetInstanceClass");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_GetInstanceClass, ReturnValue) == 0x000000, "Member 'BP_GameAction_PlayCharacterAnimation_C_GetInstanceClass::ReturnValue' has a wrong offset!");

// Function BP_GameAction_PlayCharacterAnimation.BP_GameAction_PlayCharacterAnimation_C.ValidateGameAction
// 0x0180 (0x0180 - 0x0000)
struct BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 PropertyPath;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	bool                                          ExploreAssetChildren;                              // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_AppendPropertyPath_ReturnValue;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CharacterAnimationParameters        CallFunc_Array_Get_Item;                           // 0x0128(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0177(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction) == 0x000008, "Wrong alignment on BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction");
static_assert(sizeof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction) == 0x000180, "Wrong size on BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, ErrorMessages) == 0x000000, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, PropertyPath) == 0x000010, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::PropertyPath' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, ExploreAssetChildren) == 0x000020, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::ExploreAssetChildren' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_AppendPropertyPath_ReturnValue) == 0x000028, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_AppendPropertyPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000040, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000048, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, K2Node_MakeArray_Array) == 0x0000E0, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, K2Node_MakeArray_Array_1) == 0x0000F0, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_Format_ReturnValue) == 0x000100, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_Format_ReturnValue_1) == 0x000110, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, Temp_int_Loop_Counter_Variable) == 0x000120, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_Array_Get_Item) == 0x000128, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_Array_Length_ReturnValue) == 0x000170, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_Less_IntInt_ReturnValue) == 0x000174, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_IsValid_ReturnValue) == 0x000175, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_Not_PreBool_ReturnValue) == 0x000176, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000177, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_Not_PreBool_ReturnValue_1) == 0x000178, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction, CallFunc_Add_IntInt_ReturnValue) == 0x00017C, "Member 'BP_GameAction_PlayCharacterAnimation_C_ValidateGameAction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

