#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GPE_ManorFamilyCanvas

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_jRPG_InteractionObject_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GPE_ManorFamilyCanvas.BP_GPE_ManorFamilyCanvas_C
// 0x0028 (0x0318 - 0x02F0)
class ABP_GPE_ManorFamilyCanvas_C final : public ABP_jRPG_InteractionObject_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_GPE_ManorFamilyCanvas_C;         // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Frame_C;                                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_86E322B2437692A991C7E49E09C2E2BC; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_86E322B2437692A991C7E49E09C2E2BC; // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsManorVersion;                                    // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CanvasChangePicture();
	void ExecuteUbergraph_BP_GPE_ManorFamilyCanvas(int32 EntryPoint);
	void IsInteractionAvailable(bool* Available);
	void OnInteractionRequested(class ABP_jRPG_Character_World_C* InteractingWorldCharacter, bool Instant);
	void OnObjectInteractionStateLoaded(bool InteractionState);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GPE_ManorFamilyCanvas_C">();
	}
	static class ABP_GPE_ManorFamilyCanvas_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GPE_ManorFamilyCanvas_C>();
	}
};
static_assert(alignof(ABP_GPE_ManorFamilyCanvas_C) == 0x000008, "Wrong alignment on ABP_GPE_ManorFamilyCanvas_C");
static_assert(sizeof(ABP_GPE_ManorFamilyCanvas_C) == 0x000318, "Wrong size on ABP_GPE_ManorFamilyCanvas_C");
static_assert(offsetof(ABP_GPE_ManorFamilyCanvas_C, UberGraphFrame_BP_GPE_ManorFamilyCanvas_C) == 0x0002F0, "Member 'ABP_GPE_ManorFamilyCanvas_C::UberGraphFrame_BP_GPE_ManorFamilyCanvas_C' has a wrong offset!");
static_assert(offsetof(ABP_GPE_ManorFamilyCanvas_C, Frame_C) == 0x0002F8, "Member 'ABP_GPE_ManorFamilyCanvas_C::Frame_C' has a wrong offset!");
static_assert(offsetof(ABP_GPE_ManorFamilyCanvas_C, Timeline_NewTrack_0_86E322B2437692A991C7E49E09C2E2BC) == 0x000300, "Member 'ABP_GPE_ManorFamilyCanvas_C::Timeline_NewTrack_0_86E322B2437692A991C7E49E09C2E2BC' has a wrong offset!");
static_assert(offsetof(ABP_GPE_ManorFamilyCanvas_C, Timeline__Direction_86E322B2437692A991C7E49E09C2E2BC) == 0x000304, "Member 'ABP_GPE_ManorFamilyCanvas_C::Timeline__Direction_86E322B2437692A991C7E49E09C2E2BC' has a wrong offset!");
static_assert(offsetof(ABP_GPE_ManorFamilyCanvas_C, Timeline) == 0x000308, "Member 'ABP_GPE_ManorFamilyCanvas_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_GPE_ManorFamilyCanvas_C, IsManorVersion) == 0x000310, "Member 'ABP_GPE_ManorFamilyCanvas_C::IsManorVersion' has a wrong offset!");

}

