#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_PlayCharacterAnimation

#include "Basic.hpp"

#include "S_CharacterAnimationParameters_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_PlayCharacterAnimation.BP_GameActionInstance_PlayCharacterAnimation_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_PlayCharacterAnimation.BP_GameActionInstance_PlayCharacterAnimation_C.ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation
// 0x01A0 (0x01A0 - 0x0000)
struct BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_CharacterAnimationParameters> Temp_wildcard_Variable;                           // 0x0030(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CharacterAnimationParameters        CallFunc_Array_Get_Item;                           // 0x0048(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetComponentsByTag_ReturnValue;           // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Temp_wildcard_Variable_1;                          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerController*                K2Node_Event_Controller;                           // 0x00F0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAlphaBlendArgs                        K2Node_MakeStruct_AlphaBlendArgs;                  // 0x00F8(0x0010)(NoDestructor)
	struct FMontageBlendSettings                  K2Node_MakeStruct_MontageBlendSettings;            // 0x0108(0x0020)(NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_CreateSlotAnimationAsDynamicMontage_WithBlendSettings_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_CharacterAnimationParameters> CallFunc_GetAnimationParameters_CharacterAnimationParameters; // 0x0140(0x0010)(ReferenceParm)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x017C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_Rate_ImplicitCast;            // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast; // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation) == 0x000008, "Wrong alignment on BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation");
static_assert(sizeof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation) == 0x0001A0, "Wrong size on BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_CustomEvent_NotifyName_1) == 0x000004, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_CustomEvent_NotifyName) == 0x00000C, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, Temp_name_Variable) == 0x000024, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, Temp_wildcard_Variable) == 0x000030, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000098, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_DynamicCast_AsActor) == 0x0000A0, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_Array_Length_ReturnValue) == 0x0000AC, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_Less_IntInt_ReturnValue) == 0x0000B1, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_GetComponentsByTag_ReturnValue) == 0x0000B8, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D0, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, Temp_wildcard_Variable_1) == 0x0000E0, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_IsValid_ReturnValue_1) == 0x0000E8, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_Event_Controller) == 0x0000F0, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_Event_Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_MakeStruct_AlphaBlendArgs) == 0x0000F8, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_MakeStruct_AlphaBlendArgs' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_MakeStruct_MontageBlendSettings) == 0x000108, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_MakeStruct_MontageBlendSettings' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_CreateDelegate_OutputDelegate_2) == 0x000128, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_CreateSlotAnimationAsDynamicMontage_WithBlendSettings_ReturnValue) == 0x000138, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_CreateSlotAnimationAsDynamicMontage_WithBlendSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_GetAnimationParameters_CharacterAnimationParameters) == 0x000140, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_GetAnimationParameters_CharacterAnimationParameters' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000150, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_IsValid_ReturnValue_2) == 0x000158, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_CustomEvent_NotifyName_2) == 0x00015C, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_CustomEvent_NotifyName_3) == 0x000164, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_CreateDelegate_OutputDelegate_3) == 0x00016C, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_CustomEvent_NotifyName_4) == 0x00017C, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, K2Node_CreateDelegate_OutputDelegate_4) == 0x000184, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_SetPlayRate_Rate_ImplicitCast) == 0x000194, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_SetPlayRate_Rate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation, CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast) == 0x000198, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_ExecuteUbergraph_BP_GameActionInstance_PlayCharacterAnimation::CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast' has a wrong offset!");

// Function BP_GameActionInstance_PlayCharacterAnimation.BP_GameActionInstance_PlayCharacterAnimation_C.GetAnimationParameters
// 0x0020 (0x0020 - 0x0000)
struct BP_GameActionInstance_PlayCharacterAnimation_C_GetAnimationParameters final
{
public:
	TArray<struct FS_CharacterAnimationParameters> CharacterAnimationParameters;                     // 0x0000(0x0010)(Parm, OutParm)
	class UBP_GameAction_PlayCharacterAnimation_C* K2Node_DynamicCast_AsBP_Game_Action_Play_Character_Animation; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayCharacterAnimation_C_GetAnimationParameters) == 0x000008, "Wrong alignment on BP_GameActionInstance_PlayCharacterAnimation_C_GetAnimationParameters");
static_assert(sizeof(BP_GameActionInstance_PlayCharacterAnimation_C_GetAnimationParameters) == 0x000020, "Wrong size on BP_GameActionInstance_PlayCharacterAnimation_C_GetAnimationParameters");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_GetAnimationParameters, CharacterAnimationParameters) == 0x000000, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_GetAnimationParameters::CharacterAnimationParameters' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_GetAnimationParameters, K2Node_DynamicCast_AsBP_Game_Action_Play_Character_Animation) == 0x000010, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_GetAnimationParameters::K2Node_DynamicCast_AsBP_Game_Action_Play_Character_Animation' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_GetAnimationParameters, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_GetAnimationParameters::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_GameActionInstance_PlayCharacterAnimation.BP_GameActionInstance_PlayCharacterAnimation_C.OnBlendOut_59E1B9894783BC83F05507AF42E2EC74
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_PlayCharacterAnimation_C_OnBlendOut_59E1B9894783BC83F05507AF42E2EC74 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayCharacterAnimation_C_OnBlendOut_59E1B9894783BC83F05507AF42E2EC74) == 0x000004, "Wrong alignment on BP_GameActionInstance_PlayCharacterAnimation_C_OnBlendOut_59E1B9894783BC83F05507AF42E2EC74");
static_assert(sizeof(BP_GameActionInstance_PlayCharacterAnimation_C_OnBlendOut_59E1B9894783BC83F05507AF42E2EC74) == 0x000008, "Wrong size on BP_GameActionInstance_PlayCharacterAnimation_C_OnBlendOut_59E1B9894783BC83F05507AF42E2EC74");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_OnBlendOut_59E1B9894783BC83F05507AF42E2EC74, NotifyName) == 0x000000, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_OnBlendOut_59E1B9894783BC83F05507AF42E2EC74::NotifyName' has a wrong offset!");

// Function BP_GameActionInstance_PlayCharacterAnimation.BP_GameActionInstance_PlayCharacterAnimation_C.OnCompleted_59E1B9894783BC83F05507AF42E2EC74
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_PlayCharacterAnimation_C_OnCompleted_59E1B9894783BC83F05507AF42E2EC74 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayCharacterAnimation_C_OnCompleted_59E1B9894783BC83F05507AF42E2EC74) == 0x000004, "Wrong alignment on BP_GameActionInstance_PlayCharacterAnimation_C_OnCompleted_59E1B9894783BC83F05507AF42E2EC74");
static_assert(sizeof(BP_GameActionInstance_PlayCharacterAnimation_C_OnCompleted_59E1B9894783BC83F05507AF42E2EC74) == 0x000008, "Wrong size on BP_GameActionInstance_PlayCharacterAnimation_C_OnCompleted_59E1B9894783BC83F05507AF42E2EC74");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_OnCompleted_59E1B9894783BC83F05507AF42E2EC74, NotifyName) == 0x000000, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_OnCompleted_59E1B9894783BC83F05507AF42E2EC74::NotifyName' has a wrong offset!");

// Function BP_GameActionInstance_PlayCharacterAnimation.BP_GameActionInstance_PlayCharacterAnimation_C.OnInterrupted_59E1B9894783BC83F05507AF42E2EC74
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_PlayCharacterAnimation_C_OnInterrupted_59E1B9894783BC83F05507AF42E2EC74 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayCharacterAnimation_C_OnInterrupted_59E1B9894783BC83F05507AF42E2EC74) == 0x000004, "Wrong alignment on BP_GameActionInstance_PlayCharacterAnimation_C_OnInterrupted_59E1B9894783BC83F05507AF42E2EC74");
static_assert(sizeof(BP_GameActionInstance_PlayCharacterAnimation_C_OnInterrupted_59E1B9894783BC83F05507AF42E2EC74) == 0x000008, "Wrong size on BP_GameActionInstance_PlayCharacterAnimation_C_OnInterrupted_59E1B9894783BC83F05507AF42E2EC74");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_OnInterrupted_59E1B9894783BC83F05507AF42E2EC74, NotifyName) == 0x000000, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_OnInterrupted_59E1B9894783BC83F05507AF42E2EC74::NotifyName' has a wrong offset!");

// Function BP_GameActionInstance_PlayCharacterAnimation.BP_GameActionInstance_PlayCharacterAnimation_C.OnNotifyBegin_59E1B9894783BC83F05507AF42E2EC74
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyBegin_59E1B9894783BC83F05507AF42E2EC74 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyBegin_59E1B9894783BC83F05507AF42E2EC74) == 0x000004, "Wrong alignment on BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyBegin_59E1B9894783BC83F05507AF42E2EC74");
static_assert(sizeof(BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyBegin_59E1B9894783BC83F05507AF42E2EC74) == 0x000008, "Wrong size on BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyBegin_59E1B9894783BC83F05507AF42E2EC74");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyBegin_59E1B9894783BC83F05507AF42E2EC74, NotifyName) == 0x000000, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyBegin_59E1B9894783BC83F05507AF42E2EC74::NotifyName' has a wrong offset!");

// Function BP_GameActionInstance_PlayCharacterAnimation.BP_GameActionInstance_PlayCharacterAnimation_C.OnNotifyEnd_59E1B9894783BC83F05507AF42E2EC74
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyEnd_59E1B9894783BC83F05507AF42E2EC74 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyEnd_59E1B9894783BC83F05507AF42E2EC74) == 0x000004, "Wrong alignment on BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyEnd_59E1B9894783BC83F05507AF42E2EC74");
static_assert(sizeof(BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyEnd_59E1B9894783BC83F05507AF42E2EC74) == 0x000008, "Wrong size on BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyEnd_59E1B9894783BC83F05507AF42E2EC74");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyEnd_59E1B9894783BC83F05507AF42E2EC74, NotifyName) == 0x000000, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_OnNotifyEnd_59E1B9894783BC83F05507AF42E2EC74::NotifyName' has a wrong offset!");

// Function BP_GameActionInstance_PlayCharacterAnimation.BP_GameActionInstance_PlayCharacterAnimation_C.GetDebugString
// 0x00A8 (0x00A8 - 0x0000)
struct BP_GameActionInstance_PlayCharacterAnimation_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class UBP_GameAction_PlayCharacterAnimation_C* K2Node_DynamicCast_AsBP_Game_Action_Play_Character_Animation; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_PlayCharacterAnimation_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_PlayCharacterAnimation_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_PlayCharacterAnimation_C_GetDebugString) == 0x0000A8, "Wrong size on BP_GameActionInstance_PlayCharacterAnimation_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_PlayCharacterAnimation_C_GetDebugString, K2Node_DynamicCast_AsBP_Game_Action_Play_Character_Animation) == 0x000010, "Member 'BP_GameActionInstance_PlayCharacterAnimation_C_GetDebugString::K2Node_DynamicCast_AsBP_Game_Action_Play_Character_Animation' has a wrong offset!");
