#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_CharacterJoinGroup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_jRPG_CharacterSaveState_structs.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_CharacterJoinGroup.BP_GameActionInstance_CharacterJoinGroup_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_CharacterJoinGroup_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_CharacterJoinGroup_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_CharacterJoinGroup_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_CharacterJoinGroup.BP_GameActionInstance_CharacterJoinGroup_C.ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup
// 0x05A0 (0x05A0 - 0x0000)
struct BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameAction_CharacterJoinGroup_C*    K2Node_DynamicCast_As_GROUP__Character_Join;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_CharacterSaveState             Temp_wildcard_Variable;                            // 0x0048(0x01C0)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_CharacterSaveState             K2Node_SetFieldsInStruct_StructOut;                // 0x0210(0x01C0)(HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_CharacterSaveState             CallFunc_GetDataTableRowFromName_OutRow;           // 0x03D8(0x01C0)(HasGetValueTypeHash)
	bool                                          CallFunc_HasCharacterInCollectionByID_ReturnValue; // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup) == 0x000008, "Wrong alignment on BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup");
static_assert(sizeof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup) == 0x0005A0, "Wrong size on BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, CallFunc_GetCustomGI_ReturnValue) == 0x000008, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, K2Node_Event_Controller) == 0x000010, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::K2Node_Event_Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000018, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, K2Node_DynamicCast_As_GROUP__Character_Join) == 0x000028, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::K2Node_DynamicCast_As_GROUP__Character_Join' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, Temp_wildcard_Variable) == 0x000048, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, Temp_int_Array_Index_Variable) == 0x000208, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, K2Node_SetFieldsInStruct_StructOut) == 0x000210, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, CallFunc_Array_Get_Item) == 0x0003D0, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, CallFunc_GetDataTableRowFromName_OutRow) == 0x0003D8, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, CallFunc_HasCharacterInCollectionByID_ReturnValue) == 0x000598, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::CallFunc_HasCharacterInCollectionByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup, CallFunc_Not_PreBool_ReturnValue) == 0x000599, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_ExecuteUbergraph_BP_GameActionInstance_CharacterJoinGroup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_GameActionInstance_CharacterJoinGroup.BP_GameActionInstance_CharacterJoinGroup_C.GetDebugString
// 0x0098 (0x0098 - 0x0000)
struct BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString) == 0x000098, "Wrong size on BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_GameActionInstance_CharacterJoinGroup_C_GetDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");

}

