#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_QueueDialogue

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_QueueDialogue.BP_GameActionInstance_QueueDialogue_C.OnDialogueFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_QueueDialogue_C_OnDialogueFinished final
{
public:
	class ABP_Dialogue_C*                         Dialogue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_QueueDialogue_C_OnDialogueFinished) == 0x000008, "Wrong alignment on BP_GameActionInstance_QueueDialogue_C_OnDialogueFinished");
static_assert(sizeof(BP_GameActionInstance_QueueDialogue_C_OnDialogueFinished) == 0x000008, "Wrong size on BP_GameActionInstance_QueueDialogue_C_OnDialogueFinished");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_OnDialogueFinished, Dialogue) == 0x000000, "Member 'BP_GameActionInstance_QueueDialogue_C_OnDialogueFinished::Dialogue' has a wrong offset!");

// Function BP_GameActionInstance_QueueDialogue.BP_GameActionInstance_QueueDialogue_C.ExecuteUbergraph_BP_GameActionInstance_QueueDialogue
// 0x0060 (0x0060 - 0x0000)
struct BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Dialogue_C*                         K2Node_CustomEvent_Dialogue;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameAction_QueueDialogue_C*         K2Node_DynamicCast_As_DIALOGUE__Queue_Dialogue;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABP_Dialogue_C* Dialogue)> K2Node_CreateDelegate_OutputDelegate;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_NPC_Dialog_C*                  K2Node_DynamicCast_AsBP_J_RPG_NPC_Dialog;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue) == 0x000008, "Wrong alignment on BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue");
static_assert(sizeof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue) == 0x000060, "Wrong size on BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue, K2Node_Event_Controller) == 0x000008, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue::K2Node_Event_Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000010, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue, K2Node_CustomEvent_Dialogue) == 0x000020, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue::K2Node_CustomEvent_Dialogue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue, K2Node_DynamicCast_As_DIALOGUE__Queue_Dialogue) == 0x000028, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue::K2Node_DynamicCast_As_DIALOGUE__Queue_Dialogue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000048, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue, K2Node_DynamicCast_AsBP_J_RPG_NPC_Dialog) == 0x000050, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue::K2Node_DynamicCast_AsBP_J_RPG_NPC_Dialog' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000059, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteUbergraph_BP_GameActionInstance_QueueDialogue::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_GameActionInstance_QueueDialogue.BP_GameActionInstance_QueueDialogue_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_QueueDialogue_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_QueueDialogue_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_QueueDialogue_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_QueueDialogue_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_QueueDialogue_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_QueueDialogue_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_QueueDialogue.BP_GameActionInstance_QueueDialogue_C.GetDebugString
// 0x0110 (0x0110 - 0x0000)
struct BP_GameActionInstance_QueueDialogue_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_GameAction_QueueDialogue_C*         K2Node_DynamicCast_As_DIALOGUE__Queue_Dialogue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0098(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_QueueDialogue_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_QueueDialogue_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_QueueDialogue_C_GetDebugString) == 0x000110, "Wrong size on BP_GameActionInstance_QueueDialogue_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_QueueDialogue_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'BP_GameActionInstance_QueueDialogue_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_GetDebugString, K2Node_DynamicCast_As_DIALOGUE__Queue_Dialogue) == 0x000020, "Member 'BP_GameActionInstance_QueueDialogue_C_GetDebugString::K2Node_DynamicCast_As_DIALOGUE__Queue_Dialogue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_GetDebugString, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GameActionInstance_QueueDialogue_C_GetDebugString::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'BP_GameActionInstance_QueueDialogue_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_GameActionInstance_QueueDialogue_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_GetDebugString, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000088, "Member 'BP_GameActionInstance_QueueDialogue_C_GetDebugString::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000098, "Member 'BP_GameActionInstance_QueueDialogue_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'BP_GameActionInstance_QueueDialogue_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_GetDebugString, K2Node_MakeArray_Array) == 0x0000F0, "Member 'BP_GameActionInstance_QueueDialogue_C_GetDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_QueueDialogue_C_GetDebugString, CallFunc_Format_ReturnValue) == 0x000100, "Member 'BP_GameActionInstance_QueueDialogue_C_GetDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");

}

