#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_GPEActivation

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_GPEActivation.BP_GameActionInstance_GPEActivation_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_GPEActivation_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_GPEActivation_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_GPEActivation_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_GPEActivation_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_GPEActivation_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_GPEActivation_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_GPEActivation.BP_GameActionInstance_GPEActivation_C.ExecuteUbergraph_BP_GameActionInstance_GPEActivation
// 0x0010 (0x0010 - 0x0000)
struct BP_GameActionInstance_GPEActivation_C_ExecuteUbergraph_BP_GameActionInstance_GPEActivation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_GPEActivation_C_ExecuteUbergraph_BP_GameActionInstance_GPEActivation) == 0x000008, "Wrong alignment on BP_GameActionInstance_GPEActivation_C_ExecuteUbergraph_BP_GameActionInstance_GPEActivation");
static_assert(sizeof(BP_GameActionInstance_GPEActivation_C_ExecuteUbergraph_BP_GameActionInstance_GPEActivation) == 0x000010, "Wrong size on BP_GameActionInstance_GPEActivation_C_ExecuteUbergraph_BP_GameActionInstance_GPEActivation");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ExecuteUbergraph_BP_GameActionInstance_GPEActivation, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_GPEActivation_C_ExecuteUbergraph_BP_GameActionInstance_GPEActivation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ExecuteUbergraph_BP_GameActionInstance_GPEActivation, K2Node_Event_Controller) == 0x000008, "Member 'BP_GameActionInstance_GPEActivation_C_ExecuteUbergraph_BP_GameActionInstance_GPEActivation::K2Node_Event_Controller' has a wrong offset!");

// Function BP_GameActionInstance_GPEActivation.BP_GameActionInstance_GPEActivation_C.OnGPEBehaviorExecuted
// 0x0018 (0x0018 - 0x0000)
struct BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted) == 0x000008, "Wrong alignment on BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted");
static_assert(sizeof(BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted) == 0x000018, "Wrong size on BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted, Temp_int_Variable) == 0x000008, "Member 'BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_GameActionInstance_GPEActivation_C_OnGPEBehaviorExecuted::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_GameActionInstance_GPEActivation.BP_GameActionInstance_GPEActivation_C.ProcessGPEsActivations
// 0x0120 (0x0120 - 0x0000)
struct BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameAction_GPEActivation_C*         K2Node_DynamicCast_AsGameplay_Element___GPE_Activation; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0040(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GPE_Interface_C>  K2Node_DynamicCast_AsBPI_GPE_Interface;            // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GPE_InternalActivationComponent_C*  CallFunc_GPE_GetActivationComponent_ActivationComponent; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GPE_Interface_C>  K2Node_DynamicCast_AsBPI_GPE_Interface_1;          // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GPE_InternalActivationComponent_C*  CallFunc_GPE_GetActivationComponent_ActivationComponent_1; // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations) == 0x000008, "Wrong alignment on BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations");
static_assert(sizeof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations) == 0x000120, "Wrong size on BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, Controller) == 0x000000, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, K2Node_DynamicCast_AsGameplay_Element___GPE_Activation) == 0x000030, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::K2Node_DynamicCast_AsGameplay_Element___GPE_Activation' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000070, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, K2Node_DynamicCast_AsActor) == 0x000080, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, K2Node_DynamicCast_AsBPI_GPE_Interface) == 0x000090, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::K2Node_DynamicCast_AsBPI_GPE_Interface' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_GPE_GetActivationComponent_ActivationComponent) == 0x0000A8, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_GPE_GetActivationComponent_ActivationComponent' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_Array_Length_ReturnValue_1) == 0x0000B4, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E0, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0000E8, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, K2Node_DynamicCast_AsActor_1) == 0x0000F0, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::K2Node_DynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, K2Node_DynamicCast_AsBPI_GPE_Interface_1) == 0x000100, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::K2Node_DynamicCast_AsBPI_GPE_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, K2Node_DynamicCast_bSuccess_4) == 0x000110, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations, CallFunc_GPE_GetActivationComponent_ActivationComponent_1) == 0x000118, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsActivations::CallFunc_GPE_GetActivationComponent_ActivationComponent_1' has a wrong offset!");

// Function BP_GameActionInstance_GPEActivation.BP_GameActionInstance_GPEActivation_C.ProcessGPEsDeactivations
// 0x0120 (0x0120 - 0x0000)
struct BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameAction_GPEActivation_C*         K2Node_DynamicCast_AsGameplay_Element___GPE_Activation; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameAction_GPEActivation_C*         K2Node_DynamicCast_AsGameplay_Element___GPE_Activation_1; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0050(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item_1;                         // 0x0078(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GPE_Interface_C>  K2Node_DynamicCast_AsBPI_GPE_Interface;            // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GPE_Interface_C>  K2Node_DynamicCast_AsBPI_GPE_Interface_1;          // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GPE_InternalActivationComponent_C*  CallFunc_GPE_GetActivationComponent_ActivationComponent; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GPE_InternalActivationComponent_C*  CallFunc_GPE_GetActivationComponent_ActivationComponent_1; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations) == 0x000008, "Wrong alignment on BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations");
static_assert(sizeof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations) == 0x000120, "Wrong size on BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, Controller) == 0x000000, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_DynamicCast_AsGameplay_Element___GPE_Activation) == 0x000018, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_DynamicCast_AsGameplay_Element___GPE_Activation' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_DynamicCast_AsGameplay_Element___GPE_Activation_1) == 0x000040, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_DynamicCast_AsGameplay_Element___GPE_Activation_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000A0, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0000A8, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_DynamicCast_AsActor) == 0x0000B0, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_DynamicCast_AsActor_1) == 0x0000C0, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_DynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_DynamicCast_AsBPI_GPE_Interface) == 0x0000D0, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_DynamicCast_AsBPI_GPE_Interface' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_DynamicCast_bSuccess_4) == 0x0000E0, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_DynamicCast_AsBPI_GPE_Interface_1) == 0x0000E8, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_DynamicCast_AsBPI_GPE_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, K2Node_DynamicCast_bSuccess_5) == 0x0000F8, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, CallFunc_GPE_GetActivationComponent_ActivationComponent) == 0x000100, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::CallFunc_GPE_GetActivationComponent_ActivationComponent' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, CallFunc_GPE_GetActivationComponent_ActivationComponent_1) == 0x000108, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::CallFunc_GPE_GetActivationComponent_ActivationComponent_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, CallFunc_Array_Length_ReturnValue_1) == 0x000114, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, CallFunc_Less_IntInt_ReturnValue) == 0x000118, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations, CallFunc_Less_IntInt_ReturnValue_1) == 0x000119, "Member 'BP_GameActionInstance_GPEActivation_C_ProcessGPEsDeactivations::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_GameActionInstance_GPEActivation.BP_GameActionInstance_GPEActivation_C.UpdateGPECount
// 0x00F0 (0x00F0 - 0x0000)
struct BP_GameActionInstance_GPEActivation_C_UpdateGPECount final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameAction_GPEActivation_C*         K2Node_DynamicCast_AsGameplay_Element___GPE_Activation; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0038(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item_1;                         // 0x0060(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GPE_Interface_C>  K2Node_DynamicCast_AsBPI_GPE_Interface;            // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GPE_Interface_C>  K2Node_DynamicCast_AsBPI_GPE_Interface_1;          // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_GPEActivation_C_UpdateGPECount) == 0x000008, "Wrong alignment on BP_GameActionInstance_GPEActivation_C_UpdateGPECount");
static_assert(sizeof(BP_GameActionInstance_GPEActivation_C_UpdateGPECount) == 0x0000F0, "Wrong size on BP_GameActionInstance_GPEActivation_C_UpdateGPECount");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_UpdateGPECount, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_GameActionInstance_GPEActivation_C_UpdateGPECount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_GPEActivation_C_UpdateGPECount, Temp_int_Variable) == 0x000004, "Member 'BP_GameActionInstance_GPEActivation_C_UpdateGPECount::Temp_int_Variable' has a wrong offset!");
