#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GPE_ManorFamilyCanvas

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GPE_ManorFamilyCanvas.BP_GPE_ManorFamilyCanvas_C.ExecuteUbergraph_BP_GPE_ManorFamilyCanvas
// 0x0030 (0x0030 - 0x0000)
struct BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_Event_InteractingWorldCharacter;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Instant;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InteractionState;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1; // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas) == 0x000008, "Wrong alignment on BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas");
static_assert(sizeof(BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas) == 0x000030, "Wrong size on BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas");
static_assert(offsetof(BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas, EntryPoint) == 0x000000, "Member 'BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas, K2Node_Event_InteractingWorldCharacter) == 0x000008, "Member 'BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas::K2Node_Event_InteractingWorldCharacter' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas, K2Node_Event_Instant) == 0x000010, "Member 'BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas::K2Node_Event_Instant' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas, K2Node_Event_InteractionState) == 0x000011, "Member 'BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas::K2Node_Event_InteractionState' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas, CallFunc_SelectFloat_ReturnValue_1) == 0x000020, "Member 'BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000028, "Member 'BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1) == 0x00002C, "Member 'BP_GPE_ManorFamilyCanvas_C_ExecuteUbergraph_BP_GPE_ManorFamilyCanvas::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1' has a wrong offset!");

// Function BP_GPE_ManorFamilyCanvas.BP_GPE_ManorFamilyCanvas_C.IsInteractionAvailable
// 0x0001 (0x0001 - 0x0000)
struct BP_GPE_ManorFamilyCanvas_C_IsInteractionAvailable final
{
public:
	bool                                          Available;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GPE_ManorFamilyCanvas_C_IsInteractionAvailable) == 0x000001, "Wrong alignment on BP_GPE_ManorFamilyCanvas_C_IsInteractionAvailable");
static_assert(sizeof(BP_GPE_ManorFamilyCanvas_C_IsInteractionAvailable) == 0x000001, "Wrong size on BP_GPE_ManorFamilyCanvas_C_IsInteractionAvailable");
static_assert(offsetof(BP_GPE_ManorFamilyCanvas_C_IsInteractionAvailable, Available) == 0x000000, "Member 'BP_GPE_ManorFamilyCanvas_C_IsInteractionAvailable::Available' has a wrong offset!");

// Function BP_GPE_ManorFamilyCanvas.BP_GPE_ManorFamilyCanvas_C.OnInteractionRequested
// 0x0010 (0x0010 - 0x0000)
struct BP_GPE_ManorFamilyCanvas_C_OnInteractionRequested final
{
public:
	class ABP_jRPG_Character_World_C*             InteractingWorldCharacter;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Instant;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GPE_ManorFamilyCanvas_C_OnInteractionRequested) == 0x000008, "Wrong alignment on BP_GPE_ManorFamilyCanvas_C_OnInteractionRequested");
static_assert(sizeof(BP_GPE_ManorFamilyCanvas_C_OnInteractionRequested) == 0x000010, "Wrong size on BP_GPE_ManorFamilyCanvas_C_OnInteractionRequested");
static_assert(offsetof(BP_GPE_ManorFamilyCanvas_C_OnInteractionRequested, InteractingWorldCharacter) == 0x000000, "Member 'BP_GPE_ManorFamilyCanvas_C_OnInteractionRequested::InteractingWorldCharacter' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorFamilyCanvas_C_OnInteractionRequested, Instant) == 0x000008, "Member 'BP_GPE_ManorFamilyCanvas_C_OnInteractionRequested::Instant' has a wrong offset!");

// Function BP_GPE_ManorFamilyCanvas.BP_GPE_ManorFamilyCanvas_C.OnObjectInteractionStateLoaded
// 0x0001 (0x0001 - 0x0000)
struct BP_GPE_ManorFamilyCanvas_C_OnObjectInteractionStateLoaded final
{
public:
	bool                                          InteractionState;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GPE_ManorFamilyCanvas_C_OnObjectInteractionStateLoaded) == 0x000001, "Wrong alignment on BP_GPE_ManorFamilyCanvas_C_OnObjectInteractionStateLoaded");
static_assert(sizeof(BP_GPE_ManorFamilyCanvas_C_OnObjectInteractionStateLoaded) == 0x000001, "Wrong size on BP_GPE_ManorFamilyCanvas_C_OnObjectInteractionStateLoaded");
static_assert(offsetof(BP_GPE_ManorFamilyCanvas_C_OnObjectInteractionStateLoaded, InteractionState) == 0x000000, "Member 'BP_GPE_ManorFamilyCanvas_C_OnObjectInteractionStateLoaded::InteractionState' has a wrong offset!");

}

