#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_ForceNPCDialogue

#include "Basic.hpp"

#include "S_DialogueParameters_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_ForceNPCDialogue.BP_GameActionInstance_ForceNPCDialogue_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_ForceNPCDialogue_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_ForceNPCDialogue_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_ForceNPCDialogue_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_ForceNPCDialogue.BP_GameActionInstance_ForceNPCDialogue_C.ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue
// 0x0050 (0x0050 - 0x0000)
struct BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             CallFunc_GetPlayerCharacter_AsBP_J_RPG_Character_World; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_NPC_Dialog_C*                  CallFunc_GetDialogueSettings_NPCDialog;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_DialogueParameters                  CallFunc_GetDialogueSettings_DialogueParameters;   // 0x0040(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue) == 0x000008, "Wrong alignment on BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue");
static_assert(sizeof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue) == 0x000050, "Wrong size on BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue, K2Node_Event_Controller) == 0x000008, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue::K2Node_Event_Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000020, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue, CallFunc_GetPlayerCharacter_AsBP_J_RPG_Character_World) == 0x000030, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue::CallFunc_GetPlayerCharacter_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue, CallFunc_GetDialogueSettings_NPCDialog) == 0x000038, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue::CallFunc_GetDialogueSettings_NPCDialog' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue, CallFunc_GetDialogueSettings_DialogueParameters) == 0x000040, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue::CallFunc_GetDialogueSettings_DialogueParameters' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_ExecuteUbergraph_BP_GameActionInstance_ForceNPCDialogue::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_GameActionInstance_ForceNPCDialogue.BP_GameActionInstance_ForceNPCDialogue_C.GetDialogueSettings
// 0x0038 (0x0038 - 0x0000)
struct BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings final
{
public:
	class ABP_jRPG_NPC_Dialog_C*                  NPCDialog;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_DialogueParameters                  DialogueParameters;                                // 0x0008(0x0008)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameAction_ForceNPCDialogue_C*      K2Node_DynamicCast_AsPlay_Dialogue__Force_;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_NPC_Dialog_C*                  K2Node_DynamicCast_AsBP_J_RPG_NPC_Dialog;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings) == 0x000008, "Wrong alignment on BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings");
static_assert(sizeof(BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings) == 0x000038, "Wrong size on BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings, NPCDialog) == 0x000000, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings::NPCDialog' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings, DialogueParameters) == 0x000008, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings::DialogueParameters' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings, K2Node_DynamicCast_AsPlay_Dialogue__Force_) == 0x000010, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings::K2Node_DynamicCast_AsPlay_Dialogue__Force_' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000020, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings, K2Node_DynamicCast_AsBP_J_RPG_NPC_Dialog) == 0x000028, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings::K2Node_DynamicCast_AsBP_J_RPG_NPC_Dialog' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDialogueSettings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_GameActionInstance_ForceNPCDialogue.BP_GameActionInstance_ForceNPCDialogue_C.GetDebugString
// 0x0110 (0x0110 - 0x0000)
struct BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class UBP_GameAction_ForceNPCDialogue_C*      K2Node_DynamicCast_AsPlay_Dialogue__Force_;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0098(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString) == 0x000110, "Wrong size on BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString, K2Node_DynamicCast_AsPlay_Dialogue__Force_) == 0x000010, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString::K2Node_DynamicCast_AsPlay_Dialogue__Force_' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000040, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000098, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString, K2Node_MakeArray_Array) == 0x0000F0, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString, CallFunc_Format_ReturnValue) == 0x000100, "Member 'BP_GameActionInstance_ForceNPCDialogue_C_GetDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");

}

