#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GroupInstance_UniqueMechanic_Masks

#include "Basic.hpp"

#include "E_Transform_Masks_Mechanic_structs.hpp"
#include "BP_GroupInstance_Skill_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GroupInstance_UniqueMechanic_Masks.BP_GroupInstance_UniqueMechanic_Masks_C
// 0x0008 (0x0040 - 0x0038)
class UBP_GroupInstance_UniqueMechanic_Masks_C final : public UBP_GroupInstance_Skill_Base_C
{
public:
	E_Transform_Masks_Mechanic                    MatchingMask;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          OnlyExotic;                                        // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          UnsetOnly;                                         // 0x003A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void DoesSkillMatch(class UBP_DataAsset_Skill_C* SkillData, bool* MatchesGroup);
	class FText GetGroupDisplayName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GroupInstance_UniqueMechanic_Masks_C">();
	}
	static class UBP_GroupInstance_UniqueMechanic_Masks_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GroupInstance_UniqueMechanic_Masks_C>();
	}
};
static_assert(alignof(UBP_GroupInstance_UniqueMechanic_Masks_C) == 0x000008, "Wrong alignment on UBP_GroupInstance_UniqueMechanic_Masks_C");
static_assert(sizeof(UBP_GroupInstance_UniqueMechanic_Masks_C) == 0x000040, "Wrong size on UBP_GroupInstance_UniqueMechanic_Masks_C");
static_assert(offsetof(UBP_GroupInstance_UniqueMechanic_Masks_C, MatchingMask) == 0x000038, "Member 'UBP_GroupInstance_UniqueMechanic_Masks_C::MatchingMask' has a wrong offset!");
static_assert(offsetof(UBP_GroupInstance_UniqueMechanic_Masks_C, OnlyExotic) == 0x000039, "Member 'UBP_GroupInstance_UniqueMechanic_Masks_C::OnlyExotic' has a wrong offset!");
static_assert(offsetof(UBP_GroupInstance_UniqueMechanic_Masks_C, UnsetOnly) == 0x00003A, "Member 'UBP_GroupInstance_UniqueMechanic_Masks_C::UnsetOnly' has a wrong offset!");

}

