#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_LoadLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_LoadLevel.BP_GameActionInstance_LoadLevel_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_LoadLevel_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_LoadLevel_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_LoadLevel_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_LoadLevel_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_LoadLevel_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_LoadLevel_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_LoadLevel.BP_GameActionInstance_LoadLevel_C.ExecuteUbergraph_BP_GameActionInstance_LoadLevel
// 0x0028 (0x0028 - 0x0000)
struct BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_PDT_GameAction_LoadLevel_C*         K2Node_DynamicCast_AsChange_Map__by_Name_;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDataRowHandleSet_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x001C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel) == 0x000008, "Wrong alignment on BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel");
static_assert(sizeof(BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel) == 0x000028, "Wrong size on BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel, Temp_bool_Variable) == 0x000004, "Member 'BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel, K2Node_Event_Controller) == 0x000008, "Member 'BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel::K2Node_Event_Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel, K2Node_DynamicCast_AsChange_Map__by_Name_) == 0x000010, "Member 'BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel::K2Node_DynamicCast_AsChange_Map__by_Name_' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel, CallFunc_IsDataRowHandleSet_ReturnValue) == 0x000019, "Member 'BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel::CallFunc_IsDataRowHandleSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel, K2Node_Select_Default) == 0x00001C, "Member 'BP_GameActionInstance_LoadLevel_C_ExecuteUbergraph_BP_GameActionInstance_LoadLevel::K2Node_Select_Default' has a wrong offset!");

// Function BP_GameActionInstance_LoadLevel.BP_GameActionInstance_LoadLevel_C.GetDebugString
// 0x0198 (0x0198 - 0x0000)
struct BP_GameActionInstance_LoadLevel_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugString_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_PDT_GameAction_LoadLevel_C*         K2Node_DynamicCast_AsChange_Map__by_Name_;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_PadString_Result;                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0050(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0110(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0120(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_LoadLevel_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_LoadLevel_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_LoadLevel_C_GetDebugString) == 0x000198, "Wrong size on BP_GameActionInstance_LoadLevel_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, CallFunc_GetDebugString_ReturnValue) == 0x000010, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::CallFunc_GetDebugString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, K2Node_DynamicCast_AsChange_Map__by_Name_) == 0x000020, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::K2Node_DynamicCast_AsChange_Map__by_Name_' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, CallFunc_PadString_Result) == 0x000030, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::CallFunc_PadString_Result' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, CallFunc_GetDebugStringFromGameplayTag_ReturnValue) == 0x000040, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::CallFunc_GetDebugStringFromGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, CallFunc_Conv_NameToText_ReturnValue) == 0x000050, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000100, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000110, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_2) == 0x000120, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, K2Node_MakeArray_Array) == 0x000168, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, CallFunc_Format_ReturnValue) == 0x000178, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_GetDebugString, CallFunc_Concat_StrStr_ReturnValue) == 0x000188, "Member 'BP_GameActionInstance_LoadLevel_C_GetDebugString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_GameActionInstance_LoadLevel.BP_GameActionInstance_LoadLevel_C.ShouldTriggerAutoSaveAfterExecution
// 0x0001 (0x0001 - 0x0000)
struct BP_GameActionInstance_LoadLevel_C_ShouldTriggerAutoSaveAfterExecution final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_LoadLevel_C_ShouldTriggerAutoSaveAfterExecution) == 0x000001, "Wrong alignment on BP_GameActionInstance_LoadLevel_C_ShouldTriggerAutoSaveAfterExecution");
static_assert(sizeof(BP_GameActionInstance_LoadLevel_C_ShouldTriggerAutoSaveAfterExecution) == 0x000001, "Wrong size on BP_GameActionInstance_LoadLevel_C_ShouldTriggerAutoSaveAfterExecution");
static_assert(offsetof(BP_GameActionInstance_LoadLevel_C_ShouldTriggerAutoSaveAfterExecution, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_LoadLevel_C_ShouldTriggerAutoSaveAfterExecution::ReturnValue' has a wrong offset!");

}

