#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GroupInstance_UniqueMechanic_Masks

#include "Basic.hpp"

#include "E_Transform_Masks_Mechanic_structs.hpp"


namespace SDK::Params
{

// Function BP_GroupInstance_UniqueMechanic_Masks.BP_GroupInstance_UniqueMechanic_Masks_C.DoesSkillMatch
// 0x0060 (0x0060 - 0x0000)
struct BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          MatchesGroup;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_Transform_Masks_Mechanic>            local_masksInSkill;                                // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UBP_SkillDataComponent_Base_C*>  CallFunc_FindSkillComponentsByClass_Array;         // 0x0020(0x0010)(ReferenceParm)
	E_Transform_Masks_Mechanic                    CallFunc_Array_Get_Item;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SkillDataComponent_Base_C*          CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SkillDataComponent_MaskMechanic_C*  K2Node_DynamicCast_AsBP_Skill_Data_Component_Mask_Mechanic; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Transform_Masks_Mechanic                    Temp_byte_Variable;                                // 0x005C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch) == 0x000008, "Wrong alignment on BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch");
static_assert(sizeof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch) == 0x000060, "Wrong size on BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, SkillData) == 0x000000, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::SkillData' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, MatchesGroup) == 0x000008, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::MatchesGroup' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, local_masksInSkill) == 0x000010, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::local_masksInSkill' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, CallFunc_FindSkillComponentsByClass_Array) == 0x000020, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::CallFunc_FindSkillComponentsByClass_Array' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000040, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, K2Node_DynamicCast_AsBP_Skill_Data_Component_Mask_Mechanic) == 0x000048, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::K2Node_DynamicCast_AsBP_Skill_Data_Component_Mask_Mechanic' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000059, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00005A, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, CallFunc_BooleanAND_ReturnValue) == 0x00005B, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, Temp_byte_Variable) == 0x00005C, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch, CallFunc_Array_RemoveItem_ReturnValue) == 0x00005D, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_DoesSkillMatch::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function BP_GroupInstance_UniqueMechanic_Masks.BP_GroupInstance_UniqueMechanic_Masks_C.GetGroupDisplayName
// 0x0030 (0x0030 - 0x0000)
struct BP_GroupInstance_UniqueMechanic_Masks_C_GetGroupDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
};
static_assert(alignof(BP_GroupInstance_UniqueMechanic_Masks_C_GetGroupDisplayName) == 0x000008, "Wrong alignment on BP_GroupInstance_UniqueMechanic_Masks_C_GetGroupDisplayName");
static_assert(sizeof(BP_GroupInstance_UniqueMechanic_Masks_C_GetGroupDisplayName) == 0x000030, "Wrong size on BP_GroupInstance_UniqueMechanic_Masks_C_GetGroupDisplayName");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_GetGroupDisplayName, ReturnValue) == 0x000000, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_GetGroupDisplayName::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_GetGroupDisplayName, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_GetGroupDisplayName::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Masks_C_GetGroupDisplayName, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_GroupInstance_UniqueMechanic_Masks_C_GetGroupDisplayName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

