#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameAction_AddItemToInventory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_ItemOperationData_structs.hpp"


namespace SDK::Params
{

// Function BP_GameAction_AddItemToInventory.BP_GameAction_AddItemToInventory_C.GetInstanceClass
// 0x0008 (0x0008 - 0x0000)
struct BP_GameAction_AddItemToInventory_C_GetInstanceClass final
{
public:
	TSubclassOf<class UGameActionInstance>        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameAction_AddItemToInventory_C_GetInstanceClass) == 0x000008, "Wrong alignment on BP_GameAction_AddItemToInventory_C_GetInstanceClass");
static_assert(sizeof(BP_GameAction_AddItemToInventory_C_GetInstanceClass) == 0x000008, "Wrong size on BP_GameAction_AddItemToInventory_C_GetInstanceClass");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_GetInstanceClass, ReturnValue) == 0x000000, "Member 'BP_GameAction_AddItemToInventory_C_GetInstanceClass::ReturnValue' has a wrong offset!");

// Function BP_GameAction_AddItemToInventory.BP_GameAction_AddItemToInventory_C.ValidateGameAction
// 0x0170 (0x0170 - 0x0000)
struct BP_GameAction_AddItemToInventory_C_ValidateGameAction final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 PropertyPath;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	bool                                          ExploreAssetChildren;                              // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_AppendPropertyPath_ReturnValue;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendPropertyPath_ReturnValue_1;         // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendPropertyPath_ReturnValue_2;         // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_ItemOperationData                   CallFunc_Array_Get_Item;                           // 0x0140(0x0018)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameAction_AddItemToInventory_C_ValidateGameAction) == 0x000008, "Wrong alignment on BP_GameAction_AddItemToInventory_C_ValidateGameAction");
static_assert(sizeof(BP_GameAction_AddItemToInventory_C_ValidateGameAction) == 0x000170, "Wrong size on BP_GameAction_AddItemToInventory_C_ValidateGameAction");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, ErrorMessages) == 0x000000, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, PropertyPath) == 0x000010, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::PropertyPath' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, ExploreAssetChildren) == 0x000020, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::ExploreAssetChildren' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_AppendPropertyPath_ReturnValue) == 0x000028, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_AppendPropertyPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000040, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000048, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, K2Node_MakeArray_Array) == 0x0000E0, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, K2Node_MakeArray_Array_1) == 0x0000F0, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_Format_ReturnValue) == 0x000100, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_Format_ReturnValue_1) == 0x000110, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_AppendPropertyPath_ReturnValue_1) == 0x000120, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_AppendPropertyPath_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_AppendPropertyPath_ReturnValue_2) == 0x000130, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_AppendPropertyPath_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_Array_Get_Item) == 0x000140, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_Array_Length_ReturnValue) == 0x000158, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, Temp_int_Loop_Counter_Variable) == 0x00015C, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000160, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_Less_IntInt_ReturnValue) == 0x000161, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_Add_IntInt_ReturnValue) == 0x000164, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_Array_IsEmpty_ReturnValue) == 0x000168, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000169, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_IsValid_ReturnValue) == 0x00016A, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_Not_PreBool_ReturnValue) == 0x00016B, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_AddItemToInventory_C_ValidateGameAction, CallFunc_BooleanOR_ReturnValue) == 0x00016C, "Member 'BP_GameAction_AddItemToInventory_C_ValidateGameAction::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

