#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GPE_ManorInsideDoor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GPE_ManorInsideDoor.BP_GPE_ManorInsideDoor_C.ExecuteUbergraph_BP_GPE_ManorInsideDoor
// 0x0258 (0x0258 - 0x0000)
struct BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_Event_InteractingWorldCharacter;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Instant;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InteractionState;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0058(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0150(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_UpdateLeftDoorRotation_Alpha_ImplicitCast; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateRightDoorRotation_Value_ImplicitCast; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor) == 0x000008, "Wrong alignment on BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor");
static_assert(sizeof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor) == 0x000258, "Wrong size on BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, EntryPoint) == 0x000000, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, K2Node_Event_InteractingWorldCharacter) == 0x000008, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::K2Node_Event_InteractingWorldCharacter' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, K2Node_Event_Instant) == 0x000010, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::K2Node_Event_Instant' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, K2Node_Event_InteractionState) == 0x000012, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::K2Node_Event_InteractionState' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, CallFunc_IsOverlappingActor_ReturnValue) == 0x000013, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::CallFunc_IsOverlappingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, CallFunc_GetPlayerController_ReturnValue_1) == 0x000038, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000040, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000058, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000150, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, CallFunc_UpdateLeftDoorRotation_Alpha_ImplicitCast) == 0x000248, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::CallFunc_UpdateLeftDoorRotation_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor, CallFunc_UpdateRightDoorRotation_Value_ImplicitCast) == 0x000250, "Member 'BP_GPE_ManorInsideDoor_C_ExecuteUbergraph_BP_GPE_ManorInsideDoor::CallFunc_UpdateRightDoorRotation_Value_ImplicitCast' has a wrong offset!");

// Function BP_GPE_ManorInsideDoor.BP_GPE_ManorInsideDoor_C.OnInteractionRequested
// 0x0010 (0x0010 - 0x0000)
struct BP_GPE_ManorInsideDoor_C_OnInteractionRequested final
{
public:
	class ABP_jRPG_Character_World_C*             InteractingWorldCharacter;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Instant;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GPE_ManorInsideDoor_C_OnInteractionRequested) == 0x000008, "Wrong alignment on BP_GPE_ManorInsideDoor_C_OnInteractionRequested");
static_assert(sizeof(BP_GPE_ManorInsideDoor_C_OnInteractionRequested) == 0x000010, "Wrong size on BP_GPE_ManorInsideDoor_C_OnInteractionRequested");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_OnInteractionRequested, InteractingWorldCharacter) == 0x000000, "Member 'BP_GPE_ManorInsideDoor_C_OnInteractionRequested::InteractingWorldCharacter' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_OnInteractionRequested, Instant) == 0x000008, "Member 'BP_GPE_ManorInsideDoor_C_OnInteractionRequested::Instant' has a wrong offset!");

// Function BP_GPE_ManorInsideDoor.BP_GPE_ManorInsideDoor_C.OnObjectInteractionStateLoaded
// 0x0001 (0x0001 - 0x0000)
struct BP_GPE_ManorInsideDoor_C_OnObjectInteractionStateLoaded final
{
public:
	bool                                          InteractionState;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GPE_ManorInsideDoor_C_OnObjectInteractionStateLoaded) == 0x000001, "Wrong alignment on BP_GPE_ManorInsideDoor_C_OnObjectInteractionStateLoaded");
static_assert(sizeof(BP_GPE_ManorInsideDoor_C_OnObjectInteractionStateLoaded) == 0x000001, "Wrong size on BP_GPE_ManorInsideDoor_C_OnObjectInteractionStateLoaded");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_OnObjectInteractionStateLoaded, InteractionState) == 0x000000, "Member 'BP_GPE_ManorInsideDoor_C_OnObjectInteractionStateLoaded::InteractionState' has a wrong offset!");

// Function BP_GPE_ManorInsideDoor.BP_GPE_ManorInsideDoor_C.UpdateLeftDoorRotation
// 0x0150 (0x0150 - 0x0000)
struct BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation final
{
public:
	double                                        Alpha;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0040(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_MapRangeClamped_OutRangeA_ImplicitCast;   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_OutRangeB_ImplicitCast;   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation) == 0x000008, "Wrong alignment on BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation");
static_assert(sizeof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation) == 0x000150, "Wrong size on BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, Alpha) == 0x000000, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::Alpha' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, CallFunc_BreakRotator_Roll) == 0x000008, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, CallFunc_BreakRotator_Pitch) == 0x00000C, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, CallFunc_BreakRotator_Yaw) == 0x000010, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, CallFunc_BreakRotator_Roll_1) == 0x000014, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, CallFunc_BreakRotator_Pitch_1) == 0x000018, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, CallFunc_BreakRotator_Yaw_1) == 0x00001C, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, CallFunc_MapRangeClamped_ReturnValue) == 0x000020, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000040, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, CallFunc_MapRangeClamped_OutRangeA_ImplicitCast) == 0x000138, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::CallFunc_MapRangeClamped_OutRangeA_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, CallFunc_MapRangeClamped_OutRangeB_ImplicitCast) == 0x000140, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::CallFunc_MapRangeClamped_OutRangeB_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000148, "Member 'BP_GPE_ManorInsideDoor_C_UpdateLeftDoorRotation::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_GPE_ManorInsideDoor.BP_GPE_ManorInsideDoor_C.UpdateRightDoorRotation
// 0x0150 (0x0150 - 0x0000)
struct BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0040(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_MapRangeClamped_OutRangeA_ImplicitCast;   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_OutRangeB_ImplicitCast;   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation) == 0x000008, "Wrong alignment on BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation");
static_assert(sizeof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation) == 0x000150, "Wrong size on BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, Value) == 0x000000, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::Value' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, CallFunc_BreakRotator_Roll) == 0x000008, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, CallFunc_BreakRotator_Pitch) == 0x00000C, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, CallFunc_BreakRotator_Yaw) == 0x000010, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, CallFunc_BreakRotator_Roll_1) == 0x000014, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, CallFunc_BreakRotator_Pitch_1) == 0x000018, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, CallFunc_BreakRotator_Yaw_1) == 0x00001C, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, CallFunc_MapRangeClamped_ReturnValue) == 0x000020, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000040, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, CallFunc_MapRangeClamped_OutRangeA_ImplicitCast) == 0x000138, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::CallFunc_MapRangeClamped_OutRangeA_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, CallFunc_MapRangeClamped_OutRangeB_ImplicitCast) == 0x000140, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::CallFunc_MapRangeClamped_OutRangeB_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000148, "Member 'BP_GPE_ManorInsideDoor_C_UpdateRightDoorRotation::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

}

