#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GroupInstance_UniqueMechanic_Perfection

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GroupInstance_UniqueMechanic_Perfection.BP_GroupInstance_UniqueMechanic_Perfection_C.DoesSkillMatch
// 0x0050 (0x0050 - 0x0000)
struct BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          MatchesGroup;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_SkillDataComponent_Base_C*>  CallFunc_FindSkillComponentsByClass_Array;         // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SkillDataComponent_Base_C*          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SkillDataComponent_PerfectionMechanic_C* K2Node_DynamicCast_AsBP_Skill_Data_Component_Perfection_Mechanic; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch) == 0x000008, "Wrong alignment on BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch");
static_assert(sizeof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch) == 0x000050, "Wrong size on BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, SkillData) == 0x000000, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::SkillData' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, MatchesGroup) == 0x000008, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::MatchesGroup' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, CallFunc_FindSkillComponentsByClass_Array) == 0x000010, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::CallFunc_FindSkillComponentsByClass_Array' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000020, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000030, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, K2Node_DynamicCast_AsBP_Skill_Data_Component_Perfection_Mechanic) == 0x000038, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::K2Node_DynamicCast_AsBP_Skill_Data_Component_Perfection_Mechanic' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000042, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000043, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000044, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000049, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_DoesSkillMatch::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_GroupInstance_UniqueMechanic_Perfection.BP_GroupInstance_UniqueMechanic_Perfection_C.GetGroupDisplayName
// 0x0030 (0x0030 - 0x0000)
struct BP_GroupInstance_UniqueMechanic_Perfection_C_GetGroupDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
};
static_assert(alignof(BP_GroupInstance_UniqueMechanic_Perfection_C_GetGroupDisplayName) == 0x000008, "Wrong alignment on BP_GroupInstance_UniqueMechanic_Perfection_C_GetGroupDisplayName");
static_assert(sizeof(BP_GroupInstance_UniqueMechanic_Perfection_C_GetGroupDisplayName) == 0x000030, "Wrong size on BP_GroupInstance_UniqueMechanic_Perfection_C_GetGroupDisplayName");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_GetGroupDisplayName, ReturnValue) == 0x000000, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_GetGroupDisplayName::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_GetGroupDisplayName, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_GetGroupDisplayName::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GroupInstance_UniqueMechanic_Perfection_C_GetGroupDisplayName, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'BP_GroupInstance_UniqueMechanic_Perfection_C_GetGroupDisplayName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

