#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameAction_RemoveExternalCompanion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_jRPG_CharacterDefinition_structs.hpp"


namespace SDK::Params
{

// Function BP_GameAction_RemoveExternalCompanion.BP_GameAction_RemoveExternalCompanion_C.GetInstanceClass
// 0x0008 (0x0008 - 0x0000)
struct BP_GameAction_RemoveExternalCompanion_C_GetInstanceClass final
{
public:
	TSubclassOf<class UGameActionInstance>        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameAction_RemoveExternalCompanion_C_GetInstanceClass) == 0x000008, "Wrong alignment on BP_GameAction_RemoveExternalCompanion_C_GetInstanceClass");
static_assert(sizeof(BP_GameAction_RemoveExternalCompanion_C_GetInstanceClass) == 0x000008, "Wrong size on BP_GameAction_RemoveExternalCompanion_C_GetInstanceClass");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_GetInstanceClass, ReturnValue) == 0x000000, "Member 'BP_GameAction_RemoveExternalCompanion_C_GetInstanceClass::ReturnValue' has a wrong offset!");

// Function BP_GameAction_RemoveExternalCompanion.BP_GameAction_RemoveExternalCompanion_C.ValidateGameAction
// 0x0488 (0x0488 - 0x0000)
struct BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction final
{
public:
	TArray<class FText>                           ErrorMessages;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 PropertyPath;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	bool                                          ExploreAssetChildren;                              // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AppendPropertyPath_ReturnValue;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_AppendPropertyPath_ReturnValue_1;         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x00D8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E8(0x0048)(HasGetValueTypeHash)
	struct FS_jRPG_CharacterDefinition            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0130(0x0328)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0460(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue_1;                     // 0x0470(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction) == 0x000008, "Wrong alignment on BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction");
static_assert(sizeof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction) == 0x000488, "Wrong size on BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, ErrorMessages) == 0x000000, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::ErrorMessages' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, PropertyPath) == 0x000010, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::PropertyPath' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, ExploreAssetChildren) == 0x000020, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::ExploreAssetChildren' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_AppendPropertyPath_ReturnValue) == 0x000028, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_AppendPropertyPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000038, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, K2Node_MakeArray_Array) == 0x000088, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_Format_ReturnValue) == 0x000098, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, Temp_int_Loop_Counter_Variable) == 0x0000A8, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_AppendPropertyPath_ReturnValue_1) == 0x0000B0, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_AppendPropertyPath_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_Add_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_Array_Length_ReturnValue) == 0x0000C4, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_Conv_NameToText_ReturnValue) == 0x0000D8, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E8, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_GetDataTableRowFromName_OutRow) == 0x000130, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000458, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, K2Node_MakeArray_Array_1) == 0x000460, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_Format_ReturnValue_1) == 0x000470, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_Array_Length_ReturnValue_1) == 0x000480, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction, CallFunc_Less_IntInt_ReturnValue) == 0x000484, "Member 'BP_GameAction_RemoveExternalCompanion_C_ValidateGameAction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

