#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameActionInstance_SetCharacterCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GameActionInstance_SetCharacterCustomization.BP_GameActionInstance_SetCharacterCustomization_C.ExecuteGameAction
// 0x0008 (0x0008 - 0x0000)
struct BP_GameActionInstance_SetCharacterCustomization_C_ExecuteGameAction final
{
public:
	const class APlayerController*                Controller;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteGameAction) == 0x000008, "Wrong alignment on BP_GameActionInstance_SetCharacterCustomization_C_ExecuteGameAction");
static_assert(sizeof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteGameAction) == 0x000008, "Wrong size on BP_GameActionInstance_SetCharacterCustomization_C_ExecuteGameAction");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteGameAction, Controller) == 0x000000, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteGameAction::Controller' has a wrong offset!");

// Function BP_GameActionInstance_SetCharacterCustomization.BP_GameActionInstance_SetCharacterCustomization_C.ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization
// 0x0060 (0x0060 - 0x0000)
struct BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameAction_SetCharacterCustomization_C* K2Node_DynamicCast_AsSet_Character_Customization; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterID_FromEnum_ReturnValue;      // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_1;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_GetCharacterByID_CharacterData;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCharacterInCollectionByID_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerController*                K2Node_Event_Controller;                           // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization) == 0x000008, "Wrong alignment on BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization");
static_assert(sizeof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization) == 0x000060, "Wrong size on BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization, EntryPoint) == 0x000000, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization, K2Node_DynamicCast_AsSet_Character_Customization) == 0x000008, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization::K2Node_DynamicCast_AsSet_Character_Customization' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization, CallFunc_GetCharacterID_FromEnum_ReturnValue) == 0x000014, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization::CallFunc_GetCharacterID_FromEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization, CallFunc_GetCustomGI_ReturnValue) == 0x000020, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization, CallFunc_GetCustomGI_ReturnValue_1) == 0x000028, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization::CallFunc_GetCustomGI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization, CallFunc_GetCharacterByID_CharacterData) == 0x000030, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization::CallFunc_GetCharacterByID_CharacterData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization, CallFunc_HasCharacterInCollectionByID_ReturnValue) == 0x000038, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization::CallFunc_HasCharacterInCollectionByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization, K2Node_Event_Controller) == 0x000040, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization::K2Node_Event_Controller' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization, CallFunc_K2_GetPawn_ReturnValue) == 0x000048, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000050, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_ExecuteUbergraph_BP_GameActionInstance_SetCharacterCustomization::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_GameActionInstance_SetCharacterCustomization.BP_GameActionInstance_SetCharacterCustomization_C.GetDebugString
// 0x01B8 (0x01B8 - 0x0000)
struct BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_GameAction_SetCharacterCustomization_C* K2Node_DynamicCast_AsSet_Character_Customization; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	class FName                                   CallFunc_GetCharacterID_FromEnum_ReturnValue;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0090(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x00E8(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_2;            // 0x00F8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0108(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0150(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0198(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString) == 0x000008, "Wrong alignment on BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString");
static_assert(sizeof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString) == 0x0001B8, "Wrong size on BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, ReturnValue) == 0x000000, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, K2Node_DynamicCast_AsSet_Character_Customization) == 0x000020, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::K2Node_DynamicCast_AsSet_Character_Customization' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, CallFunc_GetCharacterID_FromEnum_ReturnValue) == 0x000088, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::CallFunc_GetCharacterID_FromEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, CallFunc_Conv_NameToText_ReturnValue) == 0x000090, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, CallFunc_Conv_NameToText_ReturnValue_1) == 0x0000E8, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, CallFunc_Conv_NameToText_ReturnValue_2) == 0x0000F8, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::CallFunc_Conv_NameToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_2) == 0x000108, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, K2Node_MakeStruct_FormatArgumentData_3) == 0x000150, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, K2Node_MakeArray_Array) == 0x000198, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString, CallFunc_Format_ReturnValue) == 0x0001A8, "Member 'BP_GameActionInstance_SetCharacterCustomization_C_GetDebugString::CallFunc_Format_ReturnValue' has a wrong offset!");

}

