#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InvisibleWall_NavModifier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InvisibleWall_NavModifier.BP_InvisibleWall_NavModifier_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_InvisibleWall_NavModifier_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_ConditionCheckerComponent_C*        BP_ConditionCheckerComponent;                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_InvisibleWalls;                                 // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCustomNavModifierComponent*            CustomNavModifier;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_InvisibleWall_NavModifier_BP_ConditionCheckerComponent_K2Node_ComponentBoundEvent_0_OnConditionChanged__DelegateSignature(bool Condition);
	void ExecuteUbergraph_BP_InvisibleWall_NavModifier(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetInvisibleWallEnabled(bool Enabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InvisibleWall_NavModifier_C">();
	}
	static class ABP_InvisibleWall_NavModifier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InvisibleWall_NavModifier_C>();
	}
};
static_assert(alignof(ABP_InvisibleWall_NavModifier_C) == 0x000008, "Wrong alignment on ABP_InvisibleWall_NavModifier_C");
static_assert(sizeof(ABP_InvisibleWall_NavModifier_C) == 0x0002B8, "Wrong size on ABP_InvisibleWall_NavModifier_C");
static_assert(offsetof(ABP_InvisibleWall_NavModifier_C, UberGraphFrame) == 0x000290, "Member 'ABP_InvisibleWall_NavModifier_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_InvisibleWall_NavModifier_C, BP_ConditionCheckerComponent) == 0x000298, "Member 'ABP_InvisibleWall_NavModifier_C::BP_ConditionCheckerComponent' has a wrong offset!");
static_assert(offsetof(ABP_InvisibleWall_NavModifier_C, SM_InvisibleWalls) == 0x0002A0, "Member 'ABP_InvisibleWall_NavModifier_C::SM_InvisibleWalls' has a wrong offset!");
static_assert(offsetof(ABP_InvisibleWall_NavModifier_C, CustomNavModifier) == 0x0002A8, "Member 'ABP_InvisibleWall_NavModifier_C::CustomNavModifier' has a wrong offset!");
static_assert(offsetof(ABP_InvisibleWall_NavModifier_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_InvisibleWall_NavModifier_C::DefaultSceneRoot' has a wrong offset!");

}

