#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JrpgNPCDialog_Mime_LumiereAct1

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "S_IdleNpcParameters_structs.hpp"
#include "E_QuestStatus_structs.hpp"


namespace SDK::Params
{

// Function BP_JrpgNPCDialog_Mime_LumiereAct1.BP_JrpgNPCDialog_Mime_LumiereAct1_C.ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1
// 0x0130 (0x0130 - 0x0000)
struct BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestObjectiveIdentifier              CallFunc_CreateQuestObjectiveIdentifier_ReturnValue; // 0x0008(0x0010)(NoDestructor)
	struct FS_IdleNpcParameters                   K2Node_MakeStruct_S_IdleNpcParameters;             // 0x0018(0x0058)(HasGetValueTypeHash)
	struct FS_IdleNpcParameters                   K2Node_MakeStruct_S_IdleNpcParameters_1;           // 0x0070(0x0058)(HasGetValueTypeHash)
	class UBP_QuestSystem_C*                      CallFunc_GetQuestSystem_QuestSystem;               // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_GetObjectiveStatus_Status;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_IdleNpcParameters                   K2Node_Select_Default;                             // 0x00D8(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1) == 0x000008, "Wrong alignment on BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1");
static_assert(sizeof(BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1) == 0x000130, "Wrong size on BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1");
static_assert(offsetof(BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1, EntryPoint) == 0x000000, "Member 'BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1, Temp_bool_Variable) == 0x000004, "Member 'BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1, CallFunc_CreateQuestObjectiveIdentifier_ReturnValue) == 0x000008, "Member 'BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1::CallFunc_CreateQuestObjectiveIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1, K2Node_MakeStruct_S_IdleNpcParameters) == 0x000018, "Member 'BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1::K2Node_MakeStruct_S_IdleNpcParameters' has a wrong offset!");
static_assert(offsetof(BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1, K2Node_MakeStruct_S_IdleNpcParameters_1) == 0x000070, "Member 'BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1::K2Node_MakeStruct_S_IdleNpcParameters_1' has a wrong offset!");
static_assert(offsetof(BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1, CallFunc_GetQuestSystem_QuestSystem) == 0x0000C8, "Member 'BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1::CallFunc_GetQuestSystem_QuestSystem' has a wrong offset!");
static_assert(offsetof(BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1, CallFunc_GetObjectiveStatus_Status) == 0x0000D0, "Member 'BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1::CallFunc_GetObjectiveStatus_Status' has a wrong offset!");
static_assert(offsetof(BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D1, "Member 'BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1, K2Node_Select_Default) == 0x0000D8, "Member 'BP_JrpgNPCDialog_Mime_LumiereAct1_C_ExecuteUbergraph_BP_JrpgNPCDialog_Mime_LumiereAct1::K2Node_Select_Default' has a wrong offset!");

}

