#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan

#include "Basic.hpp"

#include "BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan.BP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C
// 0x0010 (0x0BE0 - 0x0BD0)
class ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C final : public ABP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C
{
public:
	uint8                                         Pad_BC1[0x7];                                      // 0x0BC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomComponent*                        Mustache_card;                                     // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Beard_Card;                                        // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Hair_Card;                                         // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C">();
	}
	static class ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C>();
	}
};
static_assert(alignof(ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C) == 0x000010, "Wrong alignment on ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C");
static_assert(sizeof(ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C) == 0x000BE0, "Wrong size on ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C");
static_assert(offsetof(ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C, Mustache_card) == 0x000BC8, "Member 'ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C::Mustache_card' has a wrong offset!");
static_assert(offsetof(ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C, Beard_Card) == 0x000BD0, "Member 'ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C::Beard_Card' has a wrong offset!");
static_assert(offsetof(ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C, Hair_Card) == 0x000BD8, "Member 'ABP_JRPG_NPC_Dialog_NPC_Expeditioner_Alan_C::Hair_Card' has a wrong offset!");

}

