#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica

#include "Basic.hpp"

#include "BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica.BP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C
// 0x0010 (0x0BE0 - 0x0BD0)
class ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C final : public ABP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C
{
public:
	uint8                                         Pad_BC1[0x7];                                      // 0x0BC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   SM_Toolbox_NN_01p;                                 // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Accessories2;                                   // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Accessories_2;                                  // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C">();
	}
	static class ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C>();
	}
};
static_assert(alignof(ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C) == 0x000010, "Wrong alignment on ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C");
static_assert(sizeof(ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C) == 0x000BE0, "Wrong size on ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C");
static_assert(offsetof(ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C, SM_Toolbox_NN_01p) == 0x000BC8, "Member 'ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C::SM_Toolbox_NN_01p' has a wrong offset!");
static_assert(offsetof(ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C, SM_Accessories2) == 0x000BD0, "Member 'ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C::SM_Accessories2' has a wrong offset!");
static_assert(offsetof(ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C, SM_Accessories_2) == 0x000BD8, "Member 'ABP_JRPG_NPC_Dialog_NPC_Lumiere_Veronica_C::SM_Accessories_2' has a wrong offset!");

}

