#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_NPC_Dialog_Human_ManyCams

#include "Basic.hpp"

#include "BP_jRPG_NPC_Dialog_Human_classes.hpp"
#include "EDialogueCameraType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_jRPG_NPC_Dialog_Human_ManyCams.BP_jRPG_NPC_Dialog_Human_ManyCams_C
// 0x0030 (0x0BC0 - 0x0B90)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_jRPG_NPC_Dialog_Human_ManyCams_C : public ABP_jRPG_NPC_Dialog_Human_C
{
public:
	class UCineCameraComponent*                   Camera_10;                                         // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   Camera_9;                                          // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   Camera_8;                                          // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   Camera_7;                                          // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   Camera_6;                                          // 0x0BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BPI_GetDialogueCameraByType(EDialogueCameraType CameraType, class UCameraComponent** CameraComponent);
	void GetAllDialogueCameras(TArray<class UCineCameraComponent*>* Array);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_jRPG_NPC_Dialog_Human_ManyCams_C">();
	}
	static class ABP_jRPG_NPC_Dialog_Human_ManyCams_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_jRPG_NPC_Dialog_Human_ManyCams_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABP_jRPG_NPC_Dialog_Human_ManyCams_C) == 0x000010, "Wrong alignment on ABP_jRPG_NPC_Dialog_Human_ManyCams_C");
static_assert(sizeof(ABP_jRPG_NPC_Dialog_Human_ManyCams_C) == 0x000BC0, "Wrong size on ABP_jRPG_NPC_Dialog_Human_ManyCams_C");
static_assert(offsetof(ABP_jRPG_NPC_Dialog_Human_ManyCams_C, Camera_10) == 0x000B90, "Member 'ABP_jRPG_NPC_Dialog_Human_ManyCams_C::Camera_10' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Dialog_Human_ManyCams_C, Camera_9) == 0x000B98, "Member 'ABP_jRPG_NPC_Dialog_Human_ManyCams_C::Camera_9' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Dialog_Human_ManyCams_C, Camera_8) == 0x000BA0, "Member 'ABP_jRPG_NPC_Dialog_Human_ManyCams_C::Camera_8' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Dialog_Human_ManyCams_C, Camera_7) == 0x000BA8, "Member 'ABP_jRPG_NPC_Dialog_Human_ManyCams_C::Camera_7' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Dialog_Human_ManyCams_C, Camera_6) == 0x000BB0, "Member 'ABP_jRPG_NPC_Dialog_Human_ManyCams_C::Camera_6' has a wrong offset!");

}

