#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_Controller_MainMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_InteractiveMusicParameters_structs.hpp"


namespace SDK::Params
{

// Function BP_jRPG_Controller_MainMenu.BP_jRPG_Controller_MainMenu_C.OnPlatformPaused
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_Controller_MainMenu_C_OnPlatformPaused final
{
public:
	bool                                          bShouldPause;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Controller_MainMenu_C_OnPlatformPaused) == 0x000001, "Wrong alignment on BP_jRPG_Controller_MainMenu_C_OnPlatformPaused");
static_assert(sizeof(BP_jRPG_Controller_MainMenu_C_OnPlatformPaused) == 0x000001, "Wrong size on BP_jRPG_Controller_MainMenu_C_OnPlatformPaused");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_OnPlatformPaused, bShouldPause) == 0x000000, "Member 'BP_jRPG_Controller_MainMenu_C_OnPlatformPaused::bShouldPause' has a wrong offset!");

// Function BP_jRPG_Controller_MainMenu.BP_jRPG_Controller_MainMenu_C.OnLoaded_A8310AEF43885D4C9077029EE71D9F23
// 0x0008 (0x0008 - 0x0000)
struct BP_jRPG_Controller_MainMenu_C_OnLoaded_A8310AEF43885D4C9077029EE71D9F23 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Controller_MainMenu_C_OnLoaded_A8310AEF43885D4C9077029EE71D9F23) == 0x000008, "Wrong alignment on BP_jRPG_Controller_MainMenu_C_OnLoaded_A8310AEF43885D4C9077029EE71D9F23");
static_assert(sizeof(BP_jRPG_Controller_MainMenu_C_OnLoaded_A8310AEF43885D4C9077029EE71D9F23) == 0x000008, "Wrong size on BP_jRPG_Controller_MainMenu_C_OnLoaded_A8310AEF43885D4C9077029EE71D9F23");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_OnLoaded_A8310AEF43885D4C9077029EE71D9F23, Loaded) == 0x000000, "Member 'BP_jRPG_Controller_MainMenu_C_OnLoaded_A8310AEF43885D4C9077029EE71D9F23::Loaded' has a wrong offset!");

// Function BP_jRPG_Controller_MainMenu.BP_jRPG_Controller_MainMenu_C.ExecuteUbergraph_BP_jRPG_Controller_MainMenu
// 0x0170 (0x0170 - 0x0000)
struct BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlatformsSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          CallFunc_Array_Get_Item;                           // 0x0038(0x0028)(HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MM_MainMenu_C*                     CallFunc_Create_ReturnValue;                       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_InteractiveMusicParameters          K2Node_MakeStruct_S_InteractiveMusicParameters;    // 0x00E0(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_1;                // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         K2Node_DynamicCast_AsLevel_Sequence;               // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_2;                // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bShouldPause)>            K2Node_CreateDelegate_OutputDelegate_2;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShouldPause;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PlatformPauseModal_C*              CallFunc_CreatePlatformPauseModal_OutputPin;       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu) == 0x000010, "Wrong alignment on BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu");
static_assert(sizeof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu) == 0x000170, "Wrong size on BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, EntryPoint) == 0x000000, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_RandomInteger_ReturnValue) == 0x000034, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_GetSequencePlayer_ReturnValue) == 0x0000C8, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D0, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_Create_ReturnValue) == 0x0000D8, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, K2Node_MakeStruct_S_InteractiveMusicParameters) == 0x0000E0, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::K2Node_MakeStruct_S_InteractiveMusicParameters' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x0000F8, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_IsValid_ReturnValue_1) == 0x000100, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_IsValid_ReturnValue_2) == 0x000101, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_GetCustomGI_ReturnValue) == 0x000108, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_GetCustomGI_ReturnValue_1) == 0x000110, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_GetCustomGI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, Temp_object_Variable) == 0x000118, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, K2Node_DynamicCast_AsLevel_Sequence) == 0x000120, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::K2Node_DynamicCast_AsLevel_Sequence' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_GetCustomGI_ReturnValue_2) == 0x000130, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_GetCustomGI_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000138, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000148, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, K2Node_CustomEvent_bShouldPause) == 0x000158, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::K2Node_CustomEvent_bShouldPause' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_CreatePlatformPauseModal_OutputPin) == 0x000160, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_CreatePlatformPauseModal_OutputPin' has a wrong offset!");
static_assert(offsetof(BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu, CallFunc_IsValid_ReturnValue_3) == 0x000168, "Member 'BP_jRPG_Controller_MainMenu_C_ExecuteUbergraph_BP_jRPG_Controller_MainMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

}

