#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1.BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C.ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1
// 0x0028 (0x0028 - 0x0000)
struct BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_World_C*             K2Node_Event_InteractingWorldCharacter;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Instant;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1");
static_assert(sizeof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1) == 0x000028, "Wrong size on BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1");
static_assert(offsetof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1, EntryPoint) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1, K2Node_Event_InteractingWorldCharacter) == 0x000008, "Member 'BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1::K2Node_Event_InteractingWorldCharacter' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1, K2Node_Event_Instant) == 0x000010, "Member 'BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1::K2Node_Event_Instant' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1, CallFunc_GetObjectClass_ReturnValue) == 0x000020, "Member 'BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_ExecuteUbergraph_BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1.BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C.OnInteractionRequested
// 0x0010 (0x0010 - 0x0000)
struct BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_OnInteractionRequested final
{
public:
	class ABP_jRPG_Character_World_C*             InteractingWorldCharacter_0;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Instant;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_OnInteractionRequested) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_OnInteractionRequested");
static_assert(sizeof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_OnInteractionRequested) == 0x000010, "Wrong size on BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_OnInteractionRequested");
static_assert(offsetof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_OnInteractionRequested, InteractingWorldCharacter_0) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_OnInteractionRequested::InteractingWorldCharacter_0' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_OnInteractionRequested, Instant) == 0x000008, "Member 'BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_OnInteractionRequested::Instant' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1.BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_UserConstructionScript");
static_assert(sizeof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_UserConstructionScript) == 0x000001, "Wrong size on BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_UserConstructionScript");
static_assert(offsetof(BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

