#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_NPC_Dialog_Human

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_jRPG_NPC_Dialog_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_jRPG_NPC_Dialog_Human.BP_jRPG_NPC_Dialog_Human_C
// 0x0020 (0x0B90 - 0x0B70)
class ABP_jRPG_NPC_Dialog_Human_C : public ABP_jRPG_NPC_Dialog_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_jRPG_NPC_Dialog_Human_C;         // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOVRLipSyncPlaybackActorComponent*      OVRLipSyncPlaybackActor;                           // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOVRLipSyncActorComponent*              OVRLipSyncActor;                                   // 0x0B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Face;                                              // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_jRPG_NPC_Dialog_Human(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_jRPG_NPC_Dialog_Human_C">();
	}
	static class ABP_jRPG_NPC_Dialog_Human_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_jRPG_NPC_Dialog_Human_C>();
	}
};
static_assert(alignof(ABP_jRPG_NPC_Dialog_Human_C) == 0x000010, "Wrong alignment on ABP_jRPG_NPC_Dialog_Human_C");
static_assert(sizeof(ABP_jRPG_NPC_Dialog_Human_C) == 0x000B90, "Wrong size on ABP_jRPG_NPC_Dialog_Human_C");
static_assert(offsetof(ABP_jRPG_NPC_Dialog_Human_C, UberGraphFrame_BP_jRPG_NPC_Dialog_Human_C) == 0x000B70, "Member 'ABP_jRPG_NPC_Dialog_Human_C::UberGraphFrame_BP_jRPG_NPC_Dialog_Human_C' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Dialog_Human_C, OVRLipSyncPlaybackActor) == 0x000B78, "Member 'ABP_jRPG_NPC_Dialog_Human_C::OVRLipSyncPlaybackActor' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Dialog_Human_C, OVRLipSyncActor) == 0x000B80, "Member 'ABP_jRPG_NPC_Dialog_Human_C::OVRLipSyncActor' has a wrong offset!");
static_assert(offsetof(ABP_jRPG_NPC_Dialog_Human_C, Face) == 0x000B88, "Member 'ABP_jRPG_NPC_Dialog_Human_C::Face' has a wrong offset!");

}

