#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_jRPG_NPC_Dialog_Human_ManyCams

#include "Basic.hpp"

#include "EDialogueCameraType_structs.hpp"


namespace SDK::Params
{

// Function BP_jRPG_NPC_Dialog_Human_ManyCams.BP_jRPG_NPC_Dialog_Human_ManyCams_C.BPI_GetDialogueCameraByType
// 0x0080 (0x0080 - 0x0000)
struct BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType final
{
public:
	EDialogueCameraType                           CameraType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CameraComponent;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EDialogueCameraType                           Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CallFunc_BPI_GetDialogueCameraByType_CameraComponent; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_2;                            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_3;                            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_4;                            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_5;                            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_6;                            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_7;                            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_8;                            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Temp_object_Variable_9;                            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType");
static_assert(sizeof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType) == 0x000080, "Wrong size on BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, CameraType) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::CameraType' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, CameraComponent) == 0x000008, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::CameraComponent' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, Temp_byte_Variable) == 0x000010, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, CallFunc_BPI_GetDialogueCameraByType_CameraComponent) == 0x000018, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::CallFunc_BPI_GetDialogueCameraByType_CameraComponent' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, Temp_object_Variable) == 0x000028, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, Temp_object_Variable_1) == 0x000030, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, Temp_object_Variable_2) == 0x000038, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, Temp_object_Variable_3) == 0x000040, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, Temp_object_Variable_4) == 0x000048, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, Temp_object_Variable_5) == 0x000050, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, Temp_object_Variable_6) == 0x000058, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, Temp_object_Variable_7) == 0x000060, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, Temp_object_Variable_8) == 0x000068, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, Temp_object_Variable_9) == 0x000070, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType, K2Node_Select_Default) == 0x000078, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_BPI_GetDialogueCameraByType::K2Node_Select_Default' has a wrong offset!");

// Function BP_jRPG_NPC_Dialog_Human_ManyCams.BP_jRPG_NPC_Dialog_Human_ManyCams_C.GetAllDialogueCameras
// 0x0020 (0x0020 - 0x0000)
struct BP_jRPG_NPC_Dialog_Human_ManyCams_C_GetAllDialogueCameras final
{
public:
	TArray<class UCineCameraComponent*>           Array;                                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UCineCameraComponent*>           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_GetAllDialogueCameras) == 0x000008, "Wrong alignment on BP_jRPG_NPC_Dialog_Human_ManyCams_C_GetAllDialogueCameras");
static_assert(sizeof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_GetAllDialogueCameras) == 0x000020, "Wrong size on BP_jRPG_NPC_Dialog_Human_ManyCams_C_GetAllDialogueCameras");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_GetAllDialogueCameras, Array) == 0x000000, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_GetAllDialogueCameras::Array' has a wrong offset!");
static_assert(offsetof(BP_jRPG_NPC_Dialog_Human_ManyCams_C_GetAllDialogueCameras, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_jRPG_NPC_Dialog_Human_ManyCams_C_GetAllDialogueCameras::K2Node_MakeArray_Array' has a wrong offset!");

}

