#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JRPG_NPC_Dialog_NPC_Lumiere_Richard

#include "Basic.hpp"

#include "BP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_JRPG_NPC_Dialog_NPC_Lumiere_Richard.BP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C
// 0x0020 (0x0BF0 - 0x0BD0)
class ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C final : public ABP_jRPG_NPC_Dialog_NPCLumiere_Citizen1_C
{
public:
	uint8                                         Pad_BC1[0x7];                                      // 0x0BC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   needle_cushion;                                    // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Accessories1;                                   // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FlowerNeckLace_OnCharacter_A_01;                // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   renoir_cane_low;                                   // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C">();
	}
	static class ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C>();
	}
};
static_assert(alignof(ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C) == 0x000010, "Wrong alignment on ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C");
static_assert(sizeof(ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C) == 0x000BF0, "Wrong size on ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C");
static_assert(offsetof(ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C, needle_cushion) == 0x000BC8, "Member 'ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C::needle_cushion' has a wrong offset!");
static_assert(offsetof(ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C, SM_Accessories1) == 0x000BD0, "Member 'ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C::SM_Accessories1' has a wrong offset!");
static_assert(offsetof(ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C, SM_FlowerNeckLace_OnCharacter_A_01) == 0x000BD8, "Member 'ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C::SM_FlowerNeckLace_OnCharacter_A_01' has a wrong offset!");
static_assert(offsetof(ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C, renoir_cane_low) == 0x000BE0, "Member 'ABP_JRPG_NPC_Dialog_NPC_Lumiere_Richard_C::renoir_cane_low' has a wrong offset!");

}

