#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MPClevelGlobalParams

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MPClevelGlobalParams.BP_MPClevelGlobalParams_C
// 0x0038 (0x02C8 - 0x0290)
class ABP_MPClevelGlobalParams_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         WaterLevel;                                        // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                previousFrameLocation;                             // 0x02A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DirtHaussmann;                                     // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Roughness_Haussmann;                               // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_MPClevelGlobalParams(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MPClevelGlobalParams_C">();
	}
	static class ABP_MPClevelGlobalParams_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MPClevelGlobalParams_C>();
	}
};
static_assert(alignof(ABP_MPClevelGlobalParams_C) == 0x000008, "Wrong alignment on ABP_MPClevelGlobalParams_C");
static_assert(sizeof(ABP_MPClevelGlobalParams_C) == 0x0002C8, "Wrong size on ABP_MPClevelGlobalParams_C");
static_assert(offsetof(ABP_MPClevelGlobalParams_C, UberGraphFrame) == 0x000290, "Member 'ABP_MPClevelGlobalParams_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MPClevelGlobalParams_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_MPClevelGlobalParams_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MPClevelGlobalParams_C, WaterLevel) == 0x0002A0, "Member 'ABP_MPClevelGlobalParams_C::WaterLevel' has a wrong offset!");
static_assert(offsetof(ABP_MPClevelGlobalParams_C, previousFrameLocation) == 0x0002A8, "Member 'ABP_MPClevelGlobalParams_C::previousFrameLocation' has a wrong offset!");
static_assert(offsetof(ABP_MPClevelGlobalParams_C, DirtHaussmann) == 0x0002C0, "Member 'ABP_MPClevelGlobalParams_C::DirtHaussmann' has a wrong offset!");
static_assert(offsetof(ABP_MPClevelGlobalParams_C, Roughness_Haussmann) == 0x0002C4, "Member 'ABP_MPClevelGlobalParams_C::Roughness_Haussmann' has a wrong offset!");

}

