#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Gestral_Main

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_GestralRandomMaterialVariation_structs.hpp"
#include "S_GestralRandomScaleVariation_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_Gestral_Main.BP_NPC_Gestral_Main_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_NPC_Gestral_Main_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Gestral_Main_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_NPC_Gestral_Main_C_UserConstructionScript");
static_assert(sizeof(BP_NPC_Gestral_Main_C_UserConstructionScript) == 0x000010, "Wrong size on BP_NPC_Gestral_Main_C_UserConstructionScript");
static_assert(offsetof(BP_NPC_Gestral_Main_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_NPC_Gestral_Main_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'BP_NPC_Gestral_Main_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function BP_NPC_Gestral_Main.BP_NPC_Gestral_Main_C.Func_RandomizeHairColors
// 0x0138 (0x0138 - 0x0000)
struct BP_NPC_Gestral_Main_C_Func_RandomizeHairColors final
{
public:
	double                                        MinColorHair;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxColorHair;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_GestralRandomMaterialVariation      K2Node_MakeStruct_S_GestralRandomMaterialVariation; // 0x0060(0x00C0)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast_1;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast_1;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast_1;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors) == 0x000008, "Wrong alignment on BP_NPC_Gestral_Main_C_Func_RandomizeHairColors");
static_assert(sizeof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors) == 0x000138, "Wrong size on BP_NPC_Gestral_Main_C_Func_RandomizeHairColors");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, MinColorHair) == 0x000000, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::MinColorHair' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, MaxColorHair) == 0x000008, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::MaxColorHair' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000018, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000020, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000028, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000030, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_MakeColor_ReturnValue) == 0x000038, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x000048, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_MakeColor_ReturnValue_1) == 0x000050, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, K2Node_MakeStruct_S_GestralRandomMaterialVariation) == 0x000060, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::K2Node_MakeStruct_S_GestralRandomMaterialVariation' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_MakeColor_R_ImplicitCast) == 0x000120, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_MakeColor_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_MakeColor_B_ImplicitCast) == 0x000124, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_MakeColor_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_MakeColor_G_ImplicitCast) == 0x000128, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_MakeColor_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_MakeColor_R_ImplicitCast_1) == 0x00012C, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_MakeColor_R_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_MakeColor_B_ImplicitCast_1) == 0x000130, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_MakeColor_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeHairColors, CallFunc_MakeColor_G_ImplicitCast_1) == 0x000134, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeHairColors::CallFunc_MakeColor_G_ImplicitCast_1' has a wrong offset!");

// Function BP_NPC_Gestral_Main.BP_NPC_Gestral_Main_C.Func_RandomizeBodyColors
// 0x0220 (0x0220 - 0x0000)
struct BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors final
{
public:
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Random_OutItem;                     // 0x0010(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_7;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_8;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_9;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_10;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_11;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_12;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_13;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_14;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_15;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_16;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_17;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_18;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_2;                  // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_19;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_20;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_3;                  // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_GestralRandomMaterialVariation      K2Node_MakeStruct_S_GestralRandomMaterialVariation; // 0x0130(0x00C0)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast;                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast_1;               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast_1;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast_1;               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast_2;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast_2;               // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast_2;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast_3;               // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast_3;               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast_3;               // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors) == 0x000008, "Wrong alignment on BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors");
static_assert(sizeof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors) == 0x000220, "Wrong size on BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000008, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_Array_Random_OutItem) == 0x000010, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_Array_Random_OutIndex) == 0x000038, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000040, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000048, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000050, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, K2Node_DynamicCast_AsTexture_2D) == 0x000058, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_ReturnValue) == 0x000064, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000078, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x000080, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_6) == 0x000088, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_7) == 0x000090, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_8) == 0x000098, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_9) == 0x0000A0, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_10) == 0x0000A8, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_11) == 0x0000B0, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_12) == 0x0000B8, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_13) == 0x0000C0, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_14) == 0x0000C8, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_15) == 0x0000D0, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_ReturnValue_1) == 0x0000D8, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_16) == 0x0000E8, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_17) == 0x0000F0, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_18) == 0x0000F8, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_ReturnValue_2) == 0x000100, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_19) == 0x000110, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_RandomFloatInRange_ReturnValue_20) == 0x000118, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_RandomFloatInRange_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_ReturnValue_3) == 0x000120, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, K2Node_MakeStruct_S_GestralRandomMaterialVariation) == 0x000130, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::K2Node_MakeStruct_S_GestralRandomMaterialVariation' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_B_ImplicitCast) == 0x0001F0, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_G_ImplicitCast) == 0x0001F4, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_R_ImplicitCast) == 0x0001F8, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_B_ImplicitCast_1) == 0x0001FC, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_G_ImplicitCast_1) == 0x000200, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_G_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_R_ImplicitCast_1) == 0x000204, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_R_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_B_ImplicitCast_2) == 0x000208, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_G_ImplicitCast_2) == 0x00020C, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_G_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_R_ImplicitCast_2) == 0x000210, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_R_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_B_ImplicitCast_3) == 0x000214, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_G_ImplicitCast_3) == 0x000218, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_G_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors, CallFunc_MakeColor_R_ImplicitCast_3) == 0x00021C, "Member 'BP_NPC_Gestral_Main_C_Func_RandomizeBodyColors::CallFunc_MakeColor_R_ImplicitCast_3' has a wrong offset!");

// Function BP_NPC_Gestral_Main.BP_NPC_Gestral_Main_C.Func_GestralRandomMatVariation
// 0x0030 (0x0030 - 0x0000)
struct BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_9; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_10; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation) == 0x000004, "Wrong alignment on BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation");
static_assert(sizeof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation) == 0x000030, "Wrong size on BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000004, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000008, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x00000C, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000010, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x000014, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x000018, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x00001C, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x000020, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast_8) == 0x000024, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast_9) == 0x000028, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast_10) == 0x00002C, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomMatVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast_10' has a wrong offset!");

// Function BP_NPC_Gestral_Main.BP_NPC_Gestral_Main_C.Func_GestralRandomHairColorVariation
// 0x0018 (0x0018 - 0x0000)
struct BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation final
{
public:
	double                                        MinColor;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxColor;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation) == 0x000008, "Wrong alignment on BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation");
static_assert(sizeof(BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation) == 0x000018, "Wrong size on BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation, MinColor) == 0x000000, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation::MinColor' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation, MaxColor) == 0x000008, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation::MaxColor' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000010, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000014, "Member 'BP_NPC_Gestral_Main_C_Func_GestralRandomHairColorVariation::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function BP_NPC_Gestral_Main.BP_NPC_Gestral_Main_C.ExecuteUbergraph_BP_NPC_Gestral_Main
// 0x01A0 (0x01A0 - 0x0000)
struct BP_NPC_Gestral_Main_C_ExecuteUbergraph_BP_NPC_Gestral_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_GestralRandomScaleVariation         CallFunc_GiveMeARandomGestral_ScaleVariationStruct; // 0x0008(0x0088)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_GestralRandomScaleVariation         CallFunc_GiveMeAWTFGestral_ScaleVariationStruct;   // 0x0090(0x0088)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_GestralRandomScaleVariation         CallFunc_GiveMeARandomGestral_ScaleVariationStruct_1; // 0x0118(0x0088)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Gestral_Main_C_ExecuteUbergraph_BP_NPC_Gestral_Main) == 0x000008, "Wrong alignment on BP_NPC_Gestral_Main_C_ExecuteUbergraph_BP_NPC_Gestral_Main");
static_assert(sizeof(BP_NPC_Gestral_Main_C_ExecuteUbergraph_BP_NPC_Gestral_Main) == 0x0001A0, "Wrong size on BP_NPC_Gestral_Main_C_ExecuteUbergraph_BP_NPC_Gestral_Main");
static_assert(offsetof(BP_NPC_Gestral_Main_C_ExecuteUbergraph_BP_NPC_Gestral_Main, EntryPoint) == 0x000000, "Member 'BP_NPC_Gestral_Main_C_ExecuteUbergraph_BP_NPC_Gestral_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Gestral_Main_C_ExecuteUbergraph_BP_NPC_Gestral_Main, CallFunc_GiveMeARandomGestral_ScaleVariationStruct) == 0x000008, "Member 'BP_NPC_Gestral_Main_C_ExecuteUbergraph_BP_NPC_Gestral_Main::CallFunc_GiveMeARandomGestral_ScaleVariationStruct' has a wrong offset!");
