#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPCs_Lumiere

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_NPCs_Lumiere.BP_NPCs_Lumiere_C.ExecuteUbergraph_BP_NPCs_Lumiere
// 0x0050 (0x0050 - 0x0000)
struct BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 CallFunc_GetAllElementsToDust_ElementsToDust;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere) == 0x000008, "Wrong alignment on BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere");
static_assert(sizeof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere) == 0x000050, "Wrong size on BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere");
static_assert(offsetof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere, EntryPoint) == 0x000000, "Member 'BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere, Temp_bool_IsClosed_Variable) == 0x000008, "Member 'BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere, Temp_bool_Has_Been_Initd_Variable) == 0x000009, "Member 'BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere, CallFunc_GetAllElementsToDust_ElementsToDust) == 0x000010, "Member 'BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere::CallFunc_GetAllElementsToDust_ElementsToDust' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_NPCs_Lumiere_C_ExecuteUbergraph_BP_NPCs_Lumiere::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_NPCs_Lumiere.BP_NPCs_Lumiere_C.GetAllElementsToDust
// 0x0020 (0x0020 - 0x0000)
struct BP_NPCs_Lumiere_C_GetAllElementsToDust final
{
public:
	TArray<class UMeshComponent*>                 ElementsToDust;                                    // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UMeshComponent*>                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_NPCs_Lumiere_C_GetAllElementsToDust) == 0x000008, "Wrong alignment on BP_NPCs_Lumiere_C_GetAllElementsToDust");
static_assert(sizeof(BP_NPCs_Lumiere_C_GetAllElementsToDust) == 0x000020, "Wrong size on BP_NPCs_Lumiere_C_GetAllElementsToDust");
static_assert(offsetof(BP_NPCs_Lumiere_C_GetAllElementsToDust, ElementsToDust) == 0x000000, "Member 'BP_NPCs_Lumiere_C_GetAllElementsToDust::ElementsToDust' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_GetAllElementsToDust, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_NPCs_Lumiere_C_GetAllElementsToDust::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_NPCs_Lumiere.BP_NPCs_Lumiere_C.SetDustingLevel
// 0x0048 (0x0048 - 0x0000)
struct BP_NPCs_Lumiere_C_SetDustingLevel final
{
public:
	double                                        NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetAllElementsToDust_ElementsToDust;      // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPCs_Lumiere_C_SetDustingLevel) == 0x000008, "Wrong alignment on BP_NPCs_Lumiere_C_SetDustingLevel");
static_assert(sizeof(BP_NPCs_Lumiere_C_SetDustingLevel) == 0x000048, "Wrong size on BP_NPCs_Lumiere_C_SetDustingLevel");
static_assert(offsetof(BP_NPCs_Lumiere_C_SetDustingLevel, NewParam) == 0x000000, "Member 'BP_NPCs_Lumiere_C_SetDustingLevel::NewParam' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_SetDustingLevel, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_NPCs_Lumiere_C_SetDustingLevel::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_SetDustingLevel, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_NPCs_Lumiere_C_SetDustingLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_SetDustingLevel, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_NPCs_Lumiere_C_SetDustingLevel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_SetDustingLevel, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000014, "Member 'BP_NPCs_Lumiere_C_SetDustingLevel::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_SetDustingLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_NPCs_Lumiere_C_SetDustingLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_SetDustingLevel, CallFunc_GetAllElementsToDust_ElementsToDust) == 0x000020, "Member 'BP_NPCs_Lumiere_C_SetDustingLevel::CallFunc_GetAllElementsToDust_ElementsToDust' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_SetDustingLevel, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_NPCs_Lumiere_C_SetDustingLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_SetDustingLevel, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_NPCs_Lumiere_C_SetDustingLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_SetDustingLevel, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_NPCs_Lumiere_C_SetDustingLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPCs_Lumiere_C_SetDustingLevel, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000040, "Member 'BP_NPCs_Lumiere_C_SetDustingLevel::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");

}

