#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPCs_Lumiere

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPCs_Lumiere.BP_NPCs_Lumiere_C
// 0x0068 (0x02F8 - 0x0290)
class ABP_NPCs_Lumiere_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_FlowerNeckLace_C_01;                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_NPC_DustingSphere;                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_Dusting;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hair_NPCs_Lumiere;                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hat_NPCs_Lumiere;                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Beard_NPCs_Lumiere;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Head_NPCs_Lumiere;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Body_NPCs_Lumiere;                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        DustingLevel;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        ActivateFXThreshold;                               // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowFlowerNecklace;                                // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ActivateFX();
	void ExecuteUbergraph_BP_NPCs_Lumiere(int32 EntryPoint);
	void GetAllElementsToDust(TArray<class UMeshComponent*>* ElementsToDust);
	void ReceiveBeginPlay();
	void ResetFX();
	void SetDustingLevel(double NewParam);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPCs_Lumiere_C">();
	}
	static class ABP_NPCs_Lumiere_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPCs_Lumiere_C>();
	}
};
static_assert(alignof(ABP_NPCs_Lumiere_C) == 0x000008, "Wrong alignment on ABP_NPCs_Lumiere_C");
static_assert(sizeof(ABP_NPCs_Lumiere_C) == 0x0002F8, "Wrong size on ABP_NPCs_Lumiere_C");
static_assert(offsetof(ABP_NPCs_Lumiere_C, UberGraphFrame) == 0x000290, "Member 'ABP_NPCs_Lumiere_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_NPCs_Lumiere_C, SM_FlowerNeckLace_C_01) == 0x000298, "Member 'ABP_NPCs_Lumiere_C::SM_FlowerNeckLace_C_01' has a wrong offset!");
static_assert(offsetof(ABP_NPCs_Lumiere_C, FX_NPC_DustingSphere) == 0x0002A0, "Member 'ABP_NPCs_Lumiere_C::FX_NPC_DustingSphere' has a wrong offset!");
static_assert(offsetof(ABP_NPCs_Lumiere_C, FX_Dusting) == 0x0002A8, "Member 'ABP_NPCs_Lumiere_C::FX_Dusting' has a wrong offset!");
static_assert(offsetof(ABP_NPCs_Lumiere_C, SM_Hair_NPCs_Lumiere) == 0x0002B0, "Member 'ABP_NPCs_Lumiere_C::SM_Hair_NPCs_Lumiere' has a wrong offset!");
static_assert(offsetof(ABP_NPCs_Lumiere_C, SM_Hat_NPCs_Lumiere) == 0x0002B8, "Member 'ABP_NPCs_Lumiere_C::SM_Hat_NPCs_Lumiere' has a wrong offset!");
static_assert(offsetof(ABP_NPCs_Lumiere_C, SM_Beard_NPCs_Lumiere) == 0x0002C0, "Member 'ABP_NPCs_Lumiere_C::SM_Beard_NPCs_Lumiere' has a wrong offset!");
static_assert(offsetof(ABP_NPCs_Lumiere_C, SK_Head_NPCs_Lumiere) == 0x0002C8, "Member 'ABP_NPCs_Lumiere_C::SK_Head_NPCs_Lumiere' has a wrong offset!");
static_assert(offsetof(ABP_NPCs_Lumiere_C, SK_Body_NPCs_Lumiere) == 0x0002D0, "Member 'ABP_NPCs_Lumiere_C::SK_Body_NPCs_Lumiere' has a wrong offset!");
static_assert(offsetof(ABP_NPCs_Lumiere_C, DefaultSceneRoot) == 0x0002D8, "Member 'ABP_NPCs_Lumiere_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_NPCs_Lumiere_C, DustingLevel) == 0x0002E0, "Member 'ABP_NPCs_Lumiere_C::DustingLevel' has a wrong offset!");
static_assert(offsetof(ABP_NPCs_Lumiere_C, ActivateFXThreshold) == 0x0002E8, "Member 'ABP_NPCs_Lumiere_C::ActivateFXThreshold' has a wrong offset!");
static_assert(offsetof(ABP_NPCs_Lumiere_C, ShowFlowerNecklace) == 0x0002F0, "Member 'ABP_NPCs_Lumiere_C::ShowFlowerNecklace' has a wrong offset!");

}

