#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Gestral_Main

#include "Basic.hpp"

#include "BP_jRPG_NPC_Dialog_classes.hpp"
#include "S_GestralRandomMaterialVariation_structs.hpp"
#include "Engine_structs.hpp"
#include "S_GestralRandomScaleVariation_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_Gestral_Main.BP_NPC_Gestral_Main_C
// 0x0180 (0x0CF0 - 0x0B70)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_NPC_Gestral_Main_C : public ABP_jRPG_NPC_Dialog_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NPC_Gestral_Main_C;              // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SK_Gestral_Baby_UE5;                               // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GestralVariationComponent_C*        BP_GestralVariationComponent;                      // 0x0B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Gestral_Hair;                                      // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FS_GestralRandomScaleVariation         GestralScaleVariation;                             // 0x0B90(0x0088)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_GestralRandomMaterialVariation      GestralMaterialVariation;                          // 0x0C18(0x00C0)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInstanceDynamicBody;                       // 0x0CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInstanceDynamicHair;                       // 0x0CE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void RandomizeScale();
	void RandomizeHaircut();
	void RandomizeHairColor();
	void RandomizeBodyColor();
	void Func_RandomizeHairColors();
	void Func_RandomizeBodyColors();
	void Func_GestralRandomMatVariation();
	void Func_GestralRandomHairColorVariation();
	void ExecuteUbergraph_BP_NPC_Gestral_Main(int32 EntryPoint);
	void Editor_GiveMeA_WTF_Gestral();
	void Editor_GiveMe_A_RandomGestral();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPC_Gestral_Main_C">();
	}
	static class ABP_NPC_Gestral_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_Gestral_Main_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABP_NPC_Gestral_Main_C) == 0x000010, "Wrong alignment on ABP_NPC_Gestral_Main_C");
static_assert(sizeof(ABP_NPC_Gestral_Main_C) == 0x000CF0, "Wrong size on ABP_NPC_Gestral_Main_C");
static_assert(offsetof(ABP_NPC_Gestral_Main_C, UberGraphFrame_BP_NPC_Gestral_Main_C) == 0x000B70, "Member 'ABP_NPC_Gestral_Main_C::UberGraphFrame_BP_NPC_Gestral_Main_C' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Gestral_Main_C, SK_Gestral_Baby_UE5) == 0x000B78, "Member 'ABP_NPC_Gestral_Main_C::SK_Gestral_Baby_UE5' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Gestral_Main_C, BP_GestralVariationComponent) == 0x000B80, "Member 'ABP_NPC_Gestral_Main_C::BP_GestralVariationComponent' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Gestral_Main_C, Gestral_Hair) == 0x000B88, "Member 'ABP_NPC_Gestral_Main_C::Gestral_Hair' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Gestral_Main_C, GestralScaleVariation) == 0x000B90, "Member 'ABP_NPC_Gestral_Main_C::GestralScaleVariation' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Gestral_Main_C, GestralMaterialVariation) == 0x000C18, "Member 'ABP_NPC_Gestral_Main_C::GestralMaterialVariation' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Gestral_Main_C, MaterialInstanceDynamicBody) == 0x000CD8, "Member 'ABP_NPC_Gestral_Main_C::MaterialInstanceDynamicBody' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Gestral_Main_C, MaterialInstanceDynamicHair) == 0x000CE0, "Member 'ABP_NPC_Gestral_Main_C::MaterialInstanceDynamicHair' has a wrong offset!");

}

