#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Particle_Fireflies

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Particle_Fireflies.BP_Particle_Fireflies_C.ExecuteUbergraph_BP_Particle_Fireflies
// 0x0060 (0x0060 - 0x0000)
struct BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_1;   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_2;   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_3;   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_4;   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_5;   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies) == 0x000008, "Wrong alignment on BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies");
static_assert(sizeof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies) == 0x000060, "Wrong size on BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies");
static_assert(offsetof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies, EntryPoint) == 0x000000, "Member 'BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies, CallFunc_MakeVector_ReturnValue_1) == 0x000020, "Member 'BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000040, "Member 'BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000044, "Member 'BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies, CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast) == 0x000048, "Member 'BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies::CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies, CallFunc_SetFloatParameter_Param_ImplicitCast_1) == 0x00004C, "Member 'BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies::CallFunc_SetFloatParameter_Param_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies, CallFunc_SetFloatParameter_Param_ImplicitCast_2) == 0x000050, "Member 'BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies::CallFunc_SetFloatParameter_Param_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies, CallFunc_SetFloatParameter_Param_ImplicitCast_3) == 0x000054, "Member 'BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies::CallFunc_SetFloatParameter_Param_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies, CallFunc_SetFloatParameter_Param_ImplicitCast_4) == 0x000058, "Member 'BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies::CallFunc_SetFloatParameter_Param_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies, CallFunc_SetFloatParameter_Param_ImplicitCast_5) == 0x00005C, "Member 'BP_Particle_Fireflies_C_ExecuteUbergraph_BP_Particle_Fireflies::CallFunc_SetFloatParameter_Param_ImplicitCast_5' has a wrong offset!");

// Function BP_Particle_Fireflies.BP_Particle_Fireflies_C.UserConstructionScript
// 0x0058 (0x0058 - 0x0000)
struct BP_Particle_Fireflies_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_1;   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_2;   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_3;   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_4;   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_5;   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Particle_Fireflies_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Particle_Fireflies_C_UserConstructionScript");
static_assert(sizeof(BP_Particle_Fireflies_C_UserConstructionScript) == 0x000058, "Wrong size on BP_Particle_Fireflies_C_UserConstructionScript");
static_assert(offsetof(BP_Particle_Fireflies_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'BP_Particle_Fireflies_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000018, "Member 'BP_Particle_Fireflies_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'BP_Particle_Fireflies_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000038, "Member 'BP_Particle_Fireflies_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_UserConstructionScript, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x00003C, "Member 'BP_Particle_Fireflies_C_UserConstructionScript::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_UserConstructionScript, CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast) == 0x000040, "Member 'BP_Particle_Fireflies_C_UserConstructionScript::CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_UserConstructionScript, CallFunc_SetFloatParameter_Param_ImplicitCast_1) == 0x000044, "Member 'BP_Particle_Fireflies_C_UserConstructionScript::CallFunc_SetFloatParameter_Param_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_UserConstructionScript, CallFunc_SetFloatParameter_Param_ImplicitCast_2) == 0x000048, "Member 'BP_Particle_Fireflies_C_UserConstructionScript::CallFunc_SetFloatParameter_Param_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_UserConstructionScript, CallFunc_SetFloatParameter_Param_ImplicitCast_3) == 0x00004C, "Member 'BP_Particle_Fireflies_C_UserConstructionScript::CallFunc_SetFloatParameter_Param_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_UserConstructionScript, CallFunc_SetFloatParameter_Param_ImplicitCast_4) == 0x000050, "Member 'BP_Particle_Fireflies_C_UserConstructionScript::CallFunc_SetFloatParameter_Param_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Particle_Fireflies_C_UserConstructionScript, CallFunc_SetFloatParameter_Param_ImplicitCast_5) == 0x000054, "Member 'BP_Particle_Fireflies_C_UserConstructionScript::CallFunc_SetFloatParameter_Param_ImplicitCast_5' has a wrong offset!");

}

