#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PetankBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_PetankType_structs.hpp"
#include "S_PetankBaseVisualSetup_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PetankBase.BP_PetankBase_C
// 0x0058 (0x02E8 - 0x0290)
class ABP_PetankBase_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Goblu_K_Medium_Small;                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ConditionCheckerComponent_C*        BP_ConditionCheckerComponent;                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Petankbase;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_PetankType                                  PetankType;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PetankBaseVisualSetup               S_PetankBaseVisualSetup;                           // 0x02C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Set_Petank_Base_Visual(bool PetankDefeated);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_PetankBase(int32 EntryPoint);
	void BndEvt__BP_PetankBase_BP_ConditionCheckerComponent_K2Node_ComponentBoundEvent_0_OnConditionChanged__DelegateSignature(bool Condition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PetankBase_C">();
	}
	static class ABP_PetankBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PetankBase_C>();
	}
};
static_assert(alignof(ABP_PetankBase_C) == 0x000008, "Wrong alignment on ABP_PetankBase_C");
static_assert(sizeof(ABP_PetankBase_C) == 0x0002E8, "Wrong size on ABP_PetankBase_C");
static_assert(offsetof(ABP_PetankBase_C, UberGraphFrame) == 0x000290, "Member 'ABP_PetankBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PetankBase_C, PointLight) == 0x000298, "Member 'ABP_PetankBase_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_PetankBase_C, SM_Rock_Goblu_K_Medium_Small) == 0x0002A0, "Member 'ABP_PetankBase_C::SM_Rock_Goblu_K_Medium_Small' has a wrong offset!");
static_assert(offsetof(ABP_PetankBase_C, BP_ConditionCheckerComponent) == 0x0002A8, "Member 'ABP_PetankBase_C::BP_ConditionCheckerComponent' has a wrong offset!");
static_assert(offsetof(ABP_PetankBase_C, Petankbase) == 0x0002B0, "Member 'ABP_PetankBase_C::Petankbase' has a wrong offset!");
static_assert(offsetof(ABP_PetankBase_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_PetankBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PetankBase_C, PetankType) == 0x0002C0, "Member 'ABP_PetankBase_C::PetankType' has a wrong offset!");
static_assert(offsetof(ABP_PetankBase_C, S_PetankBaseVisualSetup) == 0x0002C8, "Member 'ABP_PetankBase_C::S_PetankBaseVisualSetup' has a wrong offset!");

}

