#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SaveGameObjectUpgrader_V2_To_V3

#include "Basic.hpp"

#include "S_QuestStatusData_structs.hpp"
#include "E_QuestStatus_structs.hpp"
#include "S_LevelSpawnPointsData_structs.hpp"


namespace SDK::Params
{

// Function BP_SaveGameObjectUpgrader_V2_To_V3.BP_SaveGameObjectUpgrader_V2_To_V3_C.HasReachedMirrorRenoir
// 0x0070 (0x0070 - 0x0000)
struct BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir final
{
public:
	class UBP_SaveGameObject_V2_C*                FromSave;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_QuestStatusData                     CallFunc_Map_Find_Value;                           // 0x0010(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_QuestStatus                                 CallFunc_Map_Find_Value_1;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir) == 0x000070, "Wrong size on BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir, FromSave) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir::FromSave' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir, ReturnValue) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir, CallFunc_Map_Find_Value) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir, CallFunc_Map_Find_ReturnValue) == 0x000068, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir, CallFunc_Map_Find_Value_1) == 0x000069, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir, CallFunc_Map_Find_ReturnValue_1) == 0x00006A, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00006B, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir, CallFunc_BooleanAND_ReturnValue) == 0x00006C, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasReachedMirrorRenoir::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader_V2_To_V3.BP_SaveGameObjectUpgrader_V2_To_V3_C.HasUnlockedMaellePathSpawnPoint
// 0x0040 (0x0040 - 0x0000)
struct BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint final
{
public:
	class UBP_SaveGameObject_V2_C*                FromSave;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LevelSpawnPointsData                CallFunc_Array_Get_Item;                           // 0x0018(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint) == 0x000040, "Wrong size on BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint, FromSave) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint::FromSave' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint, ReturnValue) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint, CallFunc_Array_Contains_ReturnValue) == 0x00003C, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00003D, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_HasUnlockedMaellePathSpawnPoint::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader_V2_To_V3.BP_SaveGameObjectUpgrader_V2_To_V3_C.PatchOldLumiereData
// 0x0018 (0x0018 - 0x0000)
struct BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData final
{
public:
	class UBP_SaveGameObject_V2_C*                From;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameObject_V3_C*                To;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasReachedMirrorRenoir_ReturnValue;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnlockedMaellePathSpawnPoint_ReturnValue; // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData) == 0x000018, "Wrong size on BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData, From) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData::From' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData, To) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData::To' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData, Temp_bool_Variable) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData, CallFunc_HasReachedMirrorRenoir_ReturnValue) == 0x000011, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData::CallFunc_HasReachedMirrorRenoir_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData, CallFunc_HasUnlockedMaellePathSpawnPoint_ReturnValue) == 0x000012, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData::CallFunc_HasUnlockedMaellePathSpawnPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_PatchOldLumiereData::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_SaveGameObjectUpgrader_V2_To_V3.BP_SaveGameObjectUpgrader_V2_To_V3_C.ProcessUpgradeSaveGameObject
// 0x0030 (0x0030 - 0x0000)
struct BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject final
{
public:
	class UBP_SaveGameBase_C*                     FromSaveGameObject;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameBase_C*                     ToSaveGameObject;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGameObject_V2_C*                K2Node_DynamicCast_AsBP_Save_Game_Object_V2;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SaveGameObject_V3_C*                K2Node_DynamicCast_AsBP_Save_Game_Object_V3;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject) == 0x000008, "Wrong alignment on BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject");
static_assert(sizeof(BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject) == 0x000030, "Wrong size on BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject, FromSaveGameObject) == 0x000000, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject::FromSaveGameObject' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject, ToSaveGameObject) == 0x000008, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject::ToSaveGameObject' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject, K2Node_DynamicCast_AsBP_Save_Game_Object_V2) == 0x000010, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject::K2Node_DynamicCast_AsBP_Save_Game_Object_V2' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject, K2Node_DynamicCast_AsBP_Save_Game_Object_V3) == 0x000020, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject::K2Node_DynamicCast_AsBP_Save_Game_Object_V3' has a wrong offset!");
static_assert(offsetof(BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_SaveGameObjectUpgrader_V2_To_V3_C_ProcessUpgradeSaveGameObject::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

