#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillDataComponent_MaskMechanic

#include "Basic.hpp"

#include "E_Transform_Masks_Mechanic_structs.hpp"


namespace SDK::Params
{

// Function BP_SkillDataComponent_MaskMechanic.BP_SkillDataComponent_MaskMechanic_C.IsOverchargeActive
// 0x0028 (0x0028 - 0x0000)
struct BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStat;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UniqueMechanic_TransformMasks_Component_C* CallFunc_GetComponentByClass_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive) == 0x000008, "Wrong alignment on BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive");
static_assert(sizeof(BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive) == 0x000028, "Wrong size on BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive, CharacterStat) == 0x000000, "Member 'BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive::CharacterStat' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive, Active) == 0x000008, "Member 'BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive::Active' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive, CallFunc_Array_Contains_ReturnValue) == 0x000020, "Member 'BP_SkillDataComponent_MaskMechanic_C_IsOverchargeActive::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_SkillDataComponent_MaskMechanic.BP_SkillDataComponent_MaskMechanic_C.ModifySkillButton
// 0x0038 (0x0038 - 0x0000)
struct BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton final
{
public:
	class UWBP_HUD_SkillButton_Big_C*             SkillButtonWidget;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_Transform_Masks_Mechanic                    local_FinalMask;                                   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_Transform_Masks_Mechanic>            local_maskList;                                    // 0x0010(0x0010)(Edit, BlueprintVisible)
	E_Transform_Masks_Mechanic                    Temp_byte_Variable;                                // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Transform_Masks_Mechanic                    CallFunc_Array_Get_Item;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WheelButton_RequiredMask_C*        CallFunc_SpawnObject_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton) == 0x000008, "Wrong alignment on BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton");
static_assert(sizeof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton) == 0x000038, "Wrong size on BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton, SkillButtonWidget) == 0x000000, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton::SkillButtonWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton, local_FinalMask) == 0x000008, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton::local_FinalMask' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton, local_maskList) == 0x000010, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton::local_maskList' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton, Temp_byte_Variable) == 0x000020, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton, CallFunc_Array_RemoveItem_ReturnValue) == 0x000029, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton, CallFunc_Array_Get_Item) == 0x00002A, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton, CallFunc_SpawnObject_ReturnValue) == 0x000030, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillButton::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function BP_SkillDataComponent_MaskMechanic.BP_SkillDataComponent_MaskMechanic_C.ModifySkillTooltip
// 0x0038 (0x0038 - 0x0000)
struct BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip final
{
public:
	class UWBP_SkillTooltip_C*                    SkillTooltipWidget;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_Transform_Masks_Mechanic                    local_FinalMask;                                   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_Transform_Masks_Mechanic>            local_maskList;                                    // 0x0010(0x0010)(Edit, BlueprintVisible)
	E_Transform_Masks_Mechanic                    Temp_byte_Variable;                                // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Transform_Masks_Mechanic                    CallFunc_Array_Get_Item;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WheelButton_RequiredMask_C*        CallFunc_SpawnObject_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip) == 0x000008, "Wrong alignment on BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip");
static_assert(sizeof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip) == 0x000038, "Wrong size on BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip, SkillTooltipWidget) == 0x000000, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip::SkillTooltipWidget' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip, local_FinalMask) == 0x000008, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip::local_FinalMask' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip, local_maskList) == 0x000010, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip::local_maskList' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip, Temp_byte_Variable) == 0x000020, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip, CallFunc_Array_RemoveItem_ReturnValue) == 0x000029, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip, CallFunc_Array_Get_Item) == 0x00002A, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip, CallFunc_SpawnObject_ReturnValue) == 0x000030, "Member 'BP_SkillDataComponent_MaskMechanic_C_ModifySkillTooltip::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

}

