#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineScatterFloating

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_LA_SplineScatter_structs.hpp"


namespace SDK::Params
{

// Function BP_SplineScatterFloating.BP_SplineScatterFloating_C.UserConstructionScript
// 0x0070 (0x0070 - 0x0000)
struct BP_SplineScatterFloating_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LA_SplineScatter                    CallFunc_Array_Get_Item;                           // 0x0020(0x0040)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineScatterFloating_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_SplineScatterFloating_C_UserConstructionScript");
static_assert(sizeof(BP_SplineScatterFloating_C_UserConstructionScript) == 0x000070, "Wrong size on BP_SplineScatterFloating_C_UserConstructionScript");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, Temp_int_Variable) == 0x000014, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00006A, "Member 'BP_SplineScatterFloating_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SplineScatterFloating.BP_SplineScatterFloating_C.Use Actor Collisions for Static
// 0x0003 (0x0003 - 0x0000)
struct BP_SplineScatterFloating_C_Use_Actor_Collisions_for_Static final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineScatterFloating_C_Use_Actor_Collisions_for_Static) == 0x000001, "Wrong alignment on BP_SplineScatterFloating_C_Use_Actor_Collisions_for_Static");
static_assert(sizeof(BP_SplineScatterFloating_C_Use_Actor_Collisions_for_Static) == 0x000003, "Wrong size on BP_SplineScatterFloating_C_Use_Actor_Collisions_for_Static");
static_assert(offsetof(BP_SplineScatterFloating_C_Use_Actor_Collisions_for_Static, ReturnValue) == 0x000000, "Member 'BP_SplineScatterFloating_C_Use_Actor_Collisions_for_Static::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Use_Actor_Collisions_for_Static, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_SplineScatterFloating_C_Use_Actor_Collisions_for_Static::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Use_Actor_Collisions_for_Static, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'BP_SplineScatterFloating_C_Use_Actor_Collisions_for_Static::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SplineScatterFloating.BP_SplineScatterFloating_C.TransformForInstances
// 0x0340 (0x0340 - 0x0000)
struct BP_SplineScatterFloating_C_TransformForInstances final
{
public:
	int32                                         Seed_0;                                            // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Spacing_0;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Instance_picked;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0020(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_2; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue; // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_3; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_4; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_5; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_1;                         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_6; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Find_Value_2;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Find_Value_3;                         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue; // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_5;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_8;      // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0250(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaleAtDistanceAlongSpline_Distance_ImplicitCast; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast; // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_1; // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1; // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_2; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_2; // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_3; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_3; // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_VectorFloat_B_ImplicitCast;      // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_2;        // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_2;        // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineScatterFloating_C_TransformForInstances) == 0x000010, "Wrong alignment on BP_SplineScatterFloating_C_TransformForInstances");
static_assert(sizeof(BP_SplineScatterFloating_C_TransformForInstances) == 0x000340, "Wrong size on BP_SplineScatterFloating_C_TransformForInstances");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, Seed_0) == 0x000000, "Member 'BP_SplineScatterFloating_C_TransformForInstances::Seed_0' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, Index_0) == 0x000004, "Member 'BP_SplineScatterFloating_C_TransformForInstances::Index_0' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, Spacing_0) == 0x000008, "Member 'BP_SplineScatterFloating_C_TransformForInstances::Spacing_0' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, Instance_picked) == 0x000010, "Member 'BP_SplineScatterFloating_C_TransformForInstances::Instance_picked' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, ReturnValue) == 0x000020, "Member 'BP_SplineScatterFloating_C_TransformForInstances::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000080, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000088, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x00008C, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue_2) == 0x000090, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue) == 0x000098, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_BreakVector_X) == 0x0000B8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_BreakVector_Y) == 0x0000C0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_BreakVector_Z) == 0x0000C8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000D8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue_3) == 0x0000E0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue_4) == 0x0000E4, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue_5) == 0x0000E8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Map_Find_Value) == 0x0000F0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Map_Find_ReturnValue) == 0x0000F8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Map_Find_Value_1) == 0x000100, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Map_Find_ReturnValue_1) == 0x000108, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue_6) == 0x00010C, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Map_Find_Value_2) == 0x000110, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Map_Find_ReturnValue_2) == 0x000118, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000120, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Map_Find_Value_3) == 0x000138, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Map_Find_ReturnValue_3) == 0x000140, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000148, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000160, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000168, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000170, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000178, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x000180, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000188, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Array_Add_ReturnValue) == 0x0001A0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_BreakVector_X_1) == 0x0001A8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_BreakVector_Y_1) == 0x0001B0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_BreakVector_Z_1) == 0x0001B8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue) == 0x0001C0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001D8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_BreakRotator_Roll) == 0x0001E0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_BreakRotator_Pitch) == 0x0001E4, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_BreakRotator_Yaw) == 0x0001E8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0001F0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0001F8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000200, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x000208, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Add_DoubleDouble_ReturnValue_5) == 0x000210, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Add_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_MakeRotator_ReturnValue) == 0x000218, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_DoubleDouble_ReturnValue_8) == 0x000230, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_MakeVector_ReturnValue) == 0x000238, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_MakeTransform_ReturnValue) == 0x000250, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0002B0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0002B4, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_GetScaleAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0002B8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_GetScaleAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0002C0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x0002C8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x0002D0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast) == 0x0002D8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast) == 0x0002DC, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_1) == 0x0002E0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1) == 0x0002E4, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_2) == 0x0002E8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_2) == 0x0002EC, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0002F0, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x0002F8, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000300, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_3) == 0x000308, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_3) == 0x00030C, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Multiply_VectorFloat_B_ImplicitCast) == 0x000310, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Multiply_VectorFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x000318, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Add_DoubleDouble_B_ImplicitCast_2) == 0x000320, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Add_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_Add_DoubleDouble_A_ImplicitCast_2) == 0x000328, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_Add_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000330, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000334, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_TransformForInstances, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000338, "Member 'BP_SplineScatterFloating_C_TransformForInstances::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

// Function BP_SplineScatterFloating.BP_SplineScatterFloating_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SplineScatterFloating_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineScatterFloating_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SplineScatterFloating_C_ReceiveTick");
static_assert(sizeof(BP_SplineScatterFloating_C_ReceiveTick) == 0x000004, "Wrong size on BP_SplineScatterFloating_C_ReceiveTick");
static_assert(offsetof(BP_SplineScatterFloating_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SplineScatterFloating_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SplineScatterFloating.BP_SplineScatterFloating_C.Generate Instances Infos
// 0x0158 (0x0158 - 0x0000)
struct BP_SplineScatterFloating_C_Generate_Instances_Infos final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Speed;                                             // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_1; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_2; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_3; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_4; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_5; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue_6; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast_1;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast_1;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineScatterFloating_C_Generate_Instances_Infos) == 0x000008, "Wrong alignment on BP_SplineScatterFloating_C_Generate_Instances_Infos");
static_assert(sizeof(BP_SplineScatterFloating_C_Generate_Instances_Infos) == 0x000158, "Wrong size on BP_SplineScatterFloating_C_Generate_Instances_Infos");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, Location) == 0x000000, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::Location' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, Speed) == 0x000018, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::Speed' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, Rotation) == 0x000030, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::Rotation' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000048, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_RandomFloatInRangeFromStream_ReturnValue_1) == 0x00004C, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_RandomFloatInRangeFromStream_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_RandomFloatInRangeFromStream_ReturnValue_2) == 0x000050, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_RandomFloatInRangeFromStream_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000058, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_RandomFloatInRangeFromStream_ReturnValue_3) == 0x000070, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_RandomFloatInRangeFromStream_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_RandomFloatInRangeFromStream_ReturnValue_4) == 0x000080, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_RandomFloatInRangeFromStream_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_RandomFloatInRangeFromStream_ReturnValue_5) == 0x0000A0, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_RandomFloatInRangeFromStream_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_RandomFloatInRangeFromStream_ReturnValue_6) == 0x0000A4, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_RandomFloatInRangeFromStream_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000A8, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_MakeVector_ReturnValue_1) == 0x0000B0, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000C8, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000D0, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0000E8, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_MakeVector_ReturnValue_2) == 0x0000F0, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000108, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_MakeVector_Z_ImplicitCast) == 0x000120, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x000128, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_MakeVector_Y_ImplicitCast) == 0x000130, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000138, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_MakeVector_Z_ImplicitCast_1) == 0x000140, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_MakeVector_Z_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_MakeVector_Y_ImplicitCast_1) == 0x000148, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_MakeVector_Y_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SplineScatterFloating_C_Generate_Instances_Infos, CallFunc_MakeVector_X_ImplicitCast) == 0x000150, "Member 'BP_SplineScatterFloating_C_Generate_Instances_Infos::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");

// Function BP_SplineScatterFloating.BP_SplineScatterFloating_C.ExecuteUbergraph_BP_SplineScatterFloating
// 0x0450 (0x0450 - 0x0000)
struct BP_SplineScatterFloating_C_ExecuteUbergraph_BP_SplineScatterFloating final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_LA_SplineScatter                    CallFunc_Array_RandomFromStream_OutItem;           // 0x0008(0x0040)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_RandomFromStream_OutIndex;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
