#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UniqueMechanic_Foretell_Component

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "EBattleContext_structs.hpp"
#include "SandFall_structs.hpp"
#include "E_UniqueMechanic_Foretell_ChargeType_structs.hpp"
#include "E_UniqueMechanic_Foretell_CardType_structs.hpp"


namespace SDK::Params
{

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.AddChargeInternal
// 0x0018 (0x0018 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal final
{
public:
	E_UniqueMechanic_Foretell_ChargeType          ChargeType;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ChargeCount;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleContext                                Reason;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal) == 0x000004, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal) == 0x000018, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal, ChargeType) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal::ChargeType' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal, ChargeCount) == 0x000004, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal::ChargeCount' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal, Reason) == 0x000008, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal::Reason' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal, CallFunc_Map_Find_Value) == 0x00000C, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddChargeInternal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.AddMoonCharges
// 0x0008 (0x0008 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_AddMoonCharges final
{
public:
	int32                                         ChargeCount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlushImmediately;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleContext                                Reason;                                            // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_AddMoonCharges) == 0x000004, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_AddMoonCharges");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_AddMoonCharges) == 0x000008, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_AddMoonCharges");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddMoonCharges, ChargeCount) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddMoonCharges::ChargeCount' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddMoonCharges, FlushImmediately) == 0x000004, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddMoonCharges::FlushImmediately' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddMoonCharges, Reason) == 0x000005, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddMoonCharges::Reason' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.AddSunCharges
// 0x0008 (0x0008 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_AddSunCharges final
{
public:
	int32                                         ChargeCount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlushImmediately;                                  // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleContext                                Reason;                                            // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_AddSunCharges) == 0x000004, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_AddSunCharges");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_AddSunCharges) == 0x000008, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_AddSunCharges");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddSunCharges, ChargeCount) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddSunCharges::ChargeCount' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddSunCharges, FlushImmediately) == 0x000004, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddSunCharges::FlushImmediately' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddSunCharges, Reason) == 0x000005, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddSunCharges::Reason' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.AddTwilightDurationModifier
// 0x0058 (0x0058 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier final
{
public:
	int32                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugName;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FSF_ModifierStackEntryHandle           ModifierHandle;                                    // 0x0018(0x0030)(Parm, OutParm)
	struct FGuid                                  local_GUID;                                        // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier) == 0x000008, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier) == 0x000058, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier, Delta) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier::Delta' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier, DebugName) == 0x000008, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier::DebugName' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier, ModifierHandle) == 0x000018, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier::ModifierHandle' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier, local_GUID) == 0x000048, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddTwilightDurationModifier::local_GUID' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.AddTwilightExtraDamagePercent
// 0x0058 (0x0058 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent final
{
public:
	int32                                         DeltaPercent;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugName;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FSF_ModifierStackEntryHandle           ModifierStackHandle;                               // 0x0018(0x0030)(Parm, OutParm)
	struct FGuid                                  local_GUID;                                        // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent) == 0x000008, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent) == 0x000058, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent, DeltaPercent) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent::DeltaPercent' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent, DebugName) == 0x000008, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent::DebugName' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent, ModifierStackHandle) == 0x000018, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent::ModifierStackHandle' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent, local_GUID) == 0x000048, "Member 'BP_UniqueMechanic_Foretell_Component_C_AddTwilightExtraDamagePercent::local_GUID' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.ApplyForetell
// 0x00D0 (0x00D0 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_ApplyForetell final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCount;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleContext                                Reason;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlushChargesImmediately;                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         local_newForetellAttempt;                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_newForetellFinal;                            // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_foretellsToAdd;                              // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_previousForetell;                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_AddedForetell;                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_CharacterBattleStats_C*        local_ForetellTarget;                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentMaxForetellCount_ReturnValue;   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInTwilightMode_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid_1;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_CharacterBattleStats_C*        CallFunc_Map_Find_Value;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetForetellCountOnCharacter_ReturnValue;  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        K2Node_Select_Default_1;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_BattleBuffInstance_C*>       CallFunc_CreateBuffStack_CreatedInstances;         // 0x00A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BattleBuffInstance_C*               CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell) == 0x000008, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_ApplyForetell");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell) == 0x0000D0, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_ApplyForetell");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, Target) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::Target' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, MaxCount) == 0x000008, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::MaxCount' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, Reason) == 0x00000C, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::Reason' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, FlushChargesImmediately) == 0x00000D, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::FlushChargesImmediately' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, local_newForetellAttempt) == 0x000010, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::local_newForetellAttempt' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, local_newForetellFinal) == 0x000014, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::local_newForetellFinal' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, local_foretellsToAdd) == 0x000018, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::local_foretellsToAdd' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, local_previousForetell) == 0x00001C, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::local_previousForetell' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, local_AddedForetell) == 0x000020, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::local_AddedForetell' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, local_ForetellTarget) == 0x000028, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::local_ForetellTarget' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000040, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_GetCharacterBattleBase_IsValid) == 0x000048, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, Temp_bool_Variable) == 0x000049, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_GetCurrentMaxForetellCount_ReturnValue) == 0x00004C, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_GetCurrentMaxForetellCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_IsInTwilightMode_ReturnValue) == 0x000058, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_IsInTwilightMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, Temp_int_Variable) == 0x00005C, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, Temp_int_Variable_1) == 0x000060, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, Temp_bool_Variable_1) == 0x000064, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, K2Node_Select_Default) == 0x000068, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_BooleanAND_ReturnValue) == 0x00006C, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1) == 0x000070, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_GetCharacterBattleBase_IsValid_1) == 0x000078, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_GetCharacterBattleBase_IsValid_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_Map_Find_Value) == 0x000080, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_Map_Find_ReturnValue) == 0x000088, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_GetForetellCountOnCharacter_ReturnValue) == 0x00008C, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_GetForetellCountOnCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, K2Node_Select_Default_1) == 0x000090, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_Min_ReturnValue) == 0x000098, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_Multiply_IntInt_ReturnValue) == 0x00009C, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x0000A0, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_CreateBuffStack_CreatedInstances) == 0x0000A8, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_CreateBuffStack_CreatedInstances' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetell, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetell::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.ApplyForetellFX
// 0x0010 (0x0010 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_ApplyForetellFX final
{
public:
	int32                                         NumberToApply;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       Targets;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetellFX) == 0x000008, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_ApplyForetellFX");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetellFX) == 0x000010, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_ApplyForetellFX");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetellFX, NumberToApply) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetellFX::NumberToApply' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ApplyForetellFX, Targets) == 0x000008, "Member 'BP_UniqueMechanic_Foretell_Component_C_ApplyForetellFX::Targets' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.BPI_OnAnyCharacterAP_Changed
// 0x0008 (0x0008 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterAP_Changed final
{
public:
	class UBP_BattleEvent_APChange_C*             AP_Change;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterAP_Changed) == 0x000008, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterAP_Changed");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterAP_Changed) == 0x000008, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterAP_Changed");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterAP_Changed, AP_Change) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterAP_Changed::AP_Change' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.BPI_OnAnyCharacterDamaged
// 0x0008 (0x0008 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterDamaged final
{
public:
	class UBP_BattleDamages_C*                    BattleDamage;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterDamaged) == 0x000008, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterDamaged");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterDamaged) == 0x000008, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterDamaged");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterDamaged, BattleDamage) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_BPI_OnAnyCharacterDamaged::BattleDamage' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.CancelForetellTargetOverride
// 0x0010 (0x0010 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_CancelForetellTargetOverride final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        InitialTargetStats;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_CancelForetellTargetOverride) == 0x000008, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_CancelForetellTargetOverride");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_CancelForetellTargetOverride) == 0x000010, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_CancelForetellTargetOverride");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_CancelForetellTargetOverride, InitialTargetStats) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_CancelForetellTargetOverride::InitialTargetStats' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_CancelForetellTargetOverride, CallFunc_Map_Remove_ReturnValue) == 0x000008, "Member 'BP_UniqueMechanic_Foretell_Component_C_CancelForetellTargetOverride::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.ConsumeForetell
// 0x0068 (0x0068 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCount;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleContext                                Reason;                                            // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlushChargesImmediately;                           // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ConsumedStacks;                                    // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_ForetellToRemoveFinal;                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_ForetellToRemoveAttempt;                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_InitialForetell;                             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         local_ForetellThatShouldBeConsummed;               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetForetellCountOnCharacterStats_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryRemoveBuffStacks_ConsumedStacks;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell) == 0x000008, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell) == 0x000068, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, Target) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::Target' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, MaxCount) == 0x000008, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::MaxCount' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, Reason) == 0x00000C, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::Reason' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, FlushChargesImmediately) == 0x00000D, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::FlushChargesImmediately' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, ConsumedStacks) == 0x000010, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::ConsumedStacks' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, local_ForetellToRemoveFinal) == 0x000014, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::local_ForetellToRemoveFinal' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, local_ForetellToRemoveAttempt) == 0x000018, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::local_ForetellToRemoveAttempt' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, Local_InitialForetell) == 0x00001C, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::Local_InitialForetell' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, local_ForetellThatShouldBeConsummed) == 0x000020, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::local_ForetellThatShouldBeConsummed' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000024, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, CallFunc_GetForetellCountOnCharacterStats_ReturnValue) == 0x000030, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::CallFunc_GetForetellCountOnCharacterStats_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000038, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, CallFunc_GetCharacterBattleBase_IsValid) == 0x000040, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, CallFunc_Min_ReturnValue) == 0x000058, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, CallFunc_Round_ReturnValue) == 0x00005C, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell, CallFunc_TryRemoveBuffStacks_ConsumedStacks) == 0x000060, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetell::CallFunc_TryRemoveBuffStacks_ConsumedStacks' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.ConsumeForetellFX
// 0x0010 (0x0010 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_ConsumeForetellFX final
{
public:
	int32                                         NumberToConsume;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ABP_jRPG_Character_Battle_Base_C* Targets;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetellFX) == 0x000008, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_ConsumeForetellFX");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetellFX) == 0x000010, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_ConsumeForetellFX");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetellFX, NumberToConsume) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetellFX::NumberToConsume' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_ConsumeForetellFX, Targets) == 0x000008, "Member 'BP_UniqueMechanic_Foretell_Component_C_ConsumeForetellFX::Targets' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.CreatePortraitWidget
// 0x0020 (0x0020 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget final
{
public:
	class UUserWidget*                            CreatedUserWidget;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_UniqueMechanicForetellState_C*     CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget) == 0x000008, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget) == 0x000020, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget, CreatedUserWidget) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget::CreatedUserWidget' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget, SlotIndex) == 0x000008, "Member 'BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget::SlotIndex' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BP_UniqueMechanic_Foretell_Component_C_CreatePortraitWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.DisableTwilightMode
// 0x0008 (0x0008 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_DisableTwilightMode final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UniqueMechanic_Foretell_ChargeType          Temp_byte_Variable;                                // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UniqueMechanic_Foretell_Component_C_DisableTwilightMode) == 0x000004, "Wrong alignment on BP_UniqueMechanic_Foretell_Component_C_DisableTwilightMode");
static_assert(sizeof(BP_UniqueMechanic_Foretell_Component_C_DisableTwilightMode) == 0x000008, "Wrong size on BP_UniqueMechanic_Foretell_Component_C_DisableTwilightMode");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_DisableTwilightMode, Temp_int_Variable) == 0x000000, "Member 'BP_UniqueMechanic_Foretell_Component_C_DisableTwilightMode::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_UniqueMechanic_Foretell_Component_C_DisableTwilightMode, Temp_byte_Variable) == 0x000004, "Member 'BP_UniqueMechanic_Foretell_Component_C_DisableTwilightMode::Temp_byte_Variable' has a wrong offset!");

// Function BP_UniqueMechanic_Foretell_Component.BP_UniqueMechanic_Foretell_Component_C.ExecuteUbergraph_BP_UniqueMechanic_Foretell_Component
// 0x0358 (0x0358 - 0x0000)
struct BP_UniqueMechanic_Foretell_Component_C_ExecuteUbergraph_BP_UniqueMechanic_Foretell_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UniqueMechanic_Foretell_C*         CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NumberToApply;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_CustomEvent_Targets_1;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_FXForetellList_C*                   CallFunc_GetOrCreateListFX_List;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetSamplingRegionNames_ReturnValue;       // 0x0090(0x0010)(ReferenceParm)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin_1;              // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_1;           // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius_1;        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NumberToConsume;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ABP_jRPG_Character_Battle_Base_C* K2Node_CustomEvent_Targets;                        // 0x0128(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_FXForetellList_C*                   CallFunc_GetOrCreateListFX_List_1;                 // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin_2;              // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_2;           // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
