#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponSkin_Verso_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_WeaponSkin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponSkin_Verso_Base.BP_WeaponSkin_Verso_Base_C
// 0x0030 (0x04A8 - 0x0478)
class ABP_WeaponSkin_Verso_Base_C final : public ABP_WeaponSkin_C
{
public:
	class UNiagaraComponent*                      Trail_L1;                                          // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Trail_R1;                                          // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Trail_R;                                           // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Trail_L;                                           // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    WeaponName_0;                                      // 0x0498(0x0010)(Edit, BlueprintVisible, NoDestructor)

public:
	void GetAllTrailsOnWeaponL(TArray<class UNiagaraComponent*>* TrailsArrayL);
	void GetAllTrailsOnWeaponR(TArray<class UNiagaraComponent*>* TrailsArrayR);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WeaponSkin_Verso_Base_C">();
	}
	static class ABP_WeaponSkin_Verso_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponSkin_Verso_Base_C>();
	}
};
static_assert(alignof(ABP_WeaponSkin_Verso_Base_C) == 0x000008, "Wrong alignment on ABP_WeaponSkin_Verso_Base_C");
static_assert(sizeof(ABP_WeaponSkin_Verso_Base_C) == 0x0004A8, "Wrong size on ABP_WeaponSkin_Verso_Base_C");
static_assert(offsetof(ABP_WeaponSkin_Verso_Base_C, Trail_L1) == 0x000478, "Member 'ABP_WeaponSkin_Verso_Base_C::Trail_L1' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSkin_Verso_Base_C, Trail_R1) == 0x000480, "Member 'ABP_WeaponSkin_Verso_Base_C::Trail_R1' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSkin_Verso_Base_C, Trail_R) == 0x000488, "Member 'ABP_WeaponSkin_Verso_Base_C::Trail_R' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSkin_Verso_Base_C, Trail_L) == 0x000490, "Member 'ABP_WeaponSkin_Verso_Base_C::Trail_L' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSkin_Verso_Base_C, WeaponName_0) == 0x000498, "Member 'ABP_WeaponSkin_Verso_Base_C::WeaponName_0' has a wrong offset!");

}

