#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WP_StreamingSourceComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WP_StreamingSourceComponent.BP_WP_StreamingSourceComponent_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_WP_StreamingSourceComponent_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StreamingSourceCenter;                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWorldPartitionStreamingSourceComponent* WorldPartitionStreamingSource;                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ActivateAtBeginPlay;                               // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_WP_StreamingSourceComponent(int32 EntryPoint);
	void EnableStreamingSource();
	void DisableStreamingSource();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WP_StreamingSourceComponent_C">();
	}
	static class ABP_WP_StreamingSourceComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WP_StreamingSourceComponent_C>();
	}
};
static_assert(alignof(ABP_WP_StreamingSourceComponent_C) == 0x000008, "Wrong alignment on ABP_WP_StreamingSourceComponent_C");
static_assert(sizeof(ABP_WP_StreamingSourceComponent_C) == 0x0002B8, "Wrong size on ABP_WP_StreamingSourceComponent_C");
static_assert(offsetof(ABP_WP_StreamingSourceComponent_C, UberGraphFrame) == 0x000290, "Member 'ABP_WP_StreamingSourceComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WP_StreamingSourceComponent_C, StreamingSourceCenter) == 0x000298, "Member 'ABP_WP_StreamingSourceComponent_C::StreamingSourceCenter' has a wrong offset!");
static_assert(offsetof(ABP_WP_StreamingSourceComponent_C, WorldPartitionStreamingSource) == 0x0002A0, "Member 'ABP_WP_StreamingSourceComponent_C::WorldPartitionStreamingSource' has a wrong offset!");
static_assert(offsetof(ABP_WP_StreamingSourceComponent_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_WP_StreamingSourceComponent_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_WP_StreamingSourceComponent_C, ActivateAtBeginPlay) == 0x0002B0, "Member 'ABP_WP_StreamingSourceComponent_C::ActivateAtBeginPlay' has a wrong offset!");

}

