#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WP_StreamingSourceVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_WP_StreamingSourceVolume.BP_WP_StreamingSourceVolume_C.ExecuteUbergraph_BP_WP_StreamingSourceVolume
// 0x0200 (0x0200 - 0x0000)
struct BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0040(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABP_WP_StreamingSourceComponent_C> CallFunc_Array_Get_Item;                 // 0x0158(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WP_StreamingSourceComponent_C*      K2Node_DynamicCast_AsBP_WP_Streaming_Source_Component; // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_WP_StreamingSourceComponent_C> CallFunc_Array_Get_Item_1;               // 0x01B0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_WP_StreamingSourceComponent_C*      K2Node_DynamicCast_AsBP_WP_Streaming_Source_Component_1; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume) == 0x000008, "Wrong alignment on BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume");
static_assert(sizeof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume) == 0x000200, "Wrong size on BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, EntryPoint) == 0x000000, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000020, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000028, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000030, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000038, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_ComponentBoundEvent_bFromSweep) == 0x00003C, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_ComponentBoundEvent_SweepResult) == 0x000040, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000138, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_ComponentBoundEvent_OtherActor) == 0x000140, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_ComponentBoundEvent_OtherComp) == 0x000148, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000150, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000154, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_Array_Get_Item) == 0x000158, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000180, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_DynamicCast_AsBP_WP_Streaming_Source_Component) == 0x000190, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_DynamicCast_AsBP_WP_Streaming_Source_Component' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, Temp_int_Loop_Counter_Variable_1) == 0x00019C, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_Less_IntInt_ReturnValue) == 0x0001A0, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001A4, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x0001A8, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_Array_Get_Item_1) == 0x0001B0, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0001D8, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0001E0, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_DynamicCast_AsBP_WP_Streaming_Source_Component_1) == 0x0001E8, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_DynamicCast_AsBP_WP_Streaming_Source_Component_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, K2Node_DynamicCast_bSuccess_1) == 0x0001F0, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_Array_Length_ReturnValue_1) == 0x0001F4, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001F8, "Member 'BP_WP_StreamingSourceVolume_C_ExecuteUbergraph_BP_WP_StreamingSourceVolume::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_WP_StreamingSourceVolume.BP_WP_StreamingSourceVolume_C.BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_WP_StreamingSourceVolume.BP_WP_StreamingSourceVolume_C.BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_WP_StreamingSourceVolume_C_BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

