#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WP_StreamingSourceVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WP_StreamingSourceVolume.BP_WP_StreamingSourceVolume_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_WP_StreamingSourceVolume_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class ABP_WP_StreamingSourceComponent_C>> StreamingSourceComponentsToLoad; // 0x02A8(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_WP_StreamingSourceVolume(int32 EntryPoint);
	void BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_WP_StreamingSourceVolume_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WP_StreamingSourceVolume_C">();
	}
	static class ABP_WP_StreamingSourceVolume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WP_StreamingSourceVolume_C>();
	}
};
static_assert(alignof(ABP_WP_StreamingSourceVolume_C) == 0x000008, "Wrong alignment on ABP_WP_StreamingSourceVolume_C");
static_assert(sizeof(ABP_WP_StreamingSourceVolume_C) == 0x0002B8, "Wrong size on ABP_WP_StreamingSourceVolume_C");
static_assert(offsetof(ABP_WP_StreamingSourceVolume_C, UberGraphFrame) == 0x000290, "Member 'ABP_WP_StreamingSourceVolume_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WP_StreamingSourceVolume_C, Box) == 0x000298, "Member 'ABP_WP_StreamingSourceVolume_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_WP_StreamingSourceVolume_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_WP_StreamingSourceVolume_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_WP_StreamingSourceVolume_C, StreamingSourceComponentsToLoad) == 0x0002A8, "Member 'ABP_WP_StreamingSourceVolume_C::StreamingSourceComponentsToLoad' has a wrong offset!");

}

