#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_FluxTickableEditorEvents

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_FluxTickableEditorEvents.BPI_FluxTickableEditorEvents_C.UpdateLoop
// 0x0008 (0x0008 - 0x0000)
struct BPI_FluxTickableEditorEvents_C_UpdateLoop final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_FluxTickableEditorEvents_C_UpdateLoop) == 0x000008, "Wrong alignment on BPI_FluxTickableEditorEvents_C_UpdateLoop");
static_assert(sizeof(BPI_FluxTickableEditorEvents_C_UpdateLoop) == 0x000008, "Wrong size on BPI_FluxTickableEditorEvents_C_UpdateLoop");
static_assert(offsetof(BPI_FluxTickableEditorEvents_C_UpdateLoop, DeltaTime) == 0x000000, "Member 'BPI_FluxTickableEditorEvents_C_UpdateLoop::DeltaTime' has a wrong offset!");

// Function BPI_FluxTickableEditorEvents.BPI_FluxTickableEditorEvents_C.StartSimulation
// 0x0010 (0x0010 - 0x0000)
struct BPI_FluxTickableEditorEvents_C_StartSimulation final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Iterations;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_FluxTickableEditorEvents_C_StartSimulation) == 0x000008, "Wrong alignment on BPI_FluxTickableEditorEvents_C_StartSimulation");
static_assert(sizeof(BPI_FluxTickableEditorEvents_C_StartSimulation) == 0x000010, "Wrong size on BPI_FluxTickableEditorEvents_C_StartSimulation");
static_assert(offsetof(BPI_FluxTickableEditorEvents_C_StartSimulation, Delay) == 0x000000, "Member 'BPI_FluxTickableEditorEvents_C_StartSimulation::Delay' has a wrong offset!");
static_assert(offsetof(BPI_FluxTickableEditorEvents_C_StartSimulation, Iterations) == 0x000008, "Member 'BPI_FluxTickableEditorEvents_C_StartSimulation::Iterations' has a wrong offset!");

// Function BPI_FluxTickableEditorEvents.BPI_FluxTickableEditorEvents_C.SelectionLoop
// 0x0008 (0x0008 - 0x0000)
struct BPI_FluxTickableEditorEvents_C_SelectionLoop final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_FluxTickableEditorEvents_C_SelectionLoop) == 0x000008, "Wrong alignment on BPI_FluxTickableEditorEvents_C_SelectionLoop");
static_assert(sizeof(BPI_FluxTickableEditorEvents_C_SelectionLoop) == 0x000008, "Wrong size on BPI_FluxTickableEditorEvents_C_SelectionLoop");
static_assert(offsetof(BPI_FluxTickableEditorEvents_C_SelectionLoop, DeltaTime) == 0x000000, "Member 'BPI_FluxTickableEditorEvents_C_SelectionLoop::DeltaTime' has a wrong offset!");

// Function BPI_FluxTickableEditorEvents.BPI_FluxTickableEditorEvents_C.PostLoad
// 0x0008 (0x0008 - 0x0000)
struct BPI_FluxTickableEditorEvents_C_PostLoad final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_FluxTickableEditorEvents_C_PostLoad) == 0x000008, "Wrong alignment on BPI_FluxTickableEditorEvents_C_PostLoad");
static_assert(sizeof(BPI_FluxTickableEditorEvents_C_PostLoad) == 0x000008, "Wrong size on BPI_FluxTickableEditorEvents_C_PostLoad");
static_assert(offsetof(BPI_FluxTickableEditorEvents_C_PostLoad, Delay) == 0x000000, "Member 'BPI_FluxTickableEditorEvents_C_PostLoad::Delay' has a wrong offset!");

}

