#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_FluxTickableEditorCallback

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_FluxTickableEditorCallback.BPI_FluxTickableEditorCallback_C.UpdateModifierMaterials
// 0x0018 (0x0018 - 0x0000)
struct BPI_FluxTickableEditorCallback_C_UpdateModifierMaterials final
{
public:
	TArray<class UMaterialInstanceDynamic*>       Materials;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          UseVelocityMap;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_FluxTickableEditorCallback_C_UpdateModifierMaterials) == 0x000008, "Wrong alignment on BPI_FluxTickableEditorCallback_C_UpdateModifierMaterials");
static_assert(sizeof(BPI_FluxTickableEditorCallback_C_UpdateModifierMaterials) == 0x000018, "Wrong size on BPI_FluxTickableEditorCallback_C_UpdateModifierMaterials");
static_assert(offsetof(BPI_FluxTickableEditorCallback_C_UpdateModifierMaterials, Materials) == 0x000000, "Member 'BPI_FluxTickableEditorCallback_C_UpdateModifierMaterials::Materials' has a wrong offset!");
static_assert(offsetof(BPI_FluxTickableEditorCallback_C_UpdateModifierMaterials, UseVelocityMap) == 0x000010, "Member 'BPI_FluxTickableEditorCallback_C_UpdateModifierMaterials::UseVelocityMap' has a wrong offset!");

// Function BPI_FluxTickableEditorCallback.BPI_FluxTickableEditorCallback_C.OnEditorSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct BPI_FluxTickableEditorCallback_C_OnEditorSelectionChanged final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_FluxTickableEditorCallback_C_OnEditorSelectionChanged) == 0x000001, "Wrong alignment on BPI_FluxTickableEditorCallback_C_OnEditorSelectionChanged");
static_assert(sizeof(BPI_FluxTickableEditorCallback_C_OnEditorSelectionChanged) == 0x000001, "Wrong size on BPI_FluxTickableEditorCallback_C_OnEditorSelectionChanged");
static_assert(offsetof(BPI_FluxTickableEditorCallback_C_OnEditorSelectionChanged, Selected) == 0x000000, "Member 'BPI_FluxTickableEditorCallback_C_OnEditorSelectionChanged::Selected' has a wrong offset!");

// Function BPI_FluxTickableEditorCallback.BPI_FluxTickableEditorCallback_C.OnEditorIterateSimulation
// 0x0004 (0x0004 - 0x0000)
struct BPI_FluxTickableEditorCallback_C_OnEditorIterateSimulation final
{
public:
	int32                                         Iterations;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_FluxTickableEditorCallback_C_OnEditorIterateSimulation) == 0x000004, "Wrong alignment on BPI_FluxTickableEditorCallback_C_OnEditorIterateSimulation");
static_assert(sizeof(BPI_FluxTickableEditorCallback_C_OnEditorIterateSimulation) == 0x000004, "Wrong size on BPI_FluxTickableEditorCallback_C_OnEditorIterateSimulation");
static_assert(offsetof(BPI_FluxTickableEditorCallback_C_OnEditorIterateSimulation, Iterations) == 0x000000, "Member 'BPI_FluxTickableEditorCallback_C_OnEditorIterateSimulation::Iterations' has a wrong offset!");

}

