#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_FluxSurfaceMeshActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_FluxSurfaceMeshActor.BPI_FluxSurfaceMeshActor_C.SetExternalMaterial
// 0x0008 (0x0008 - 0x0000)
struct BPI_FluxSurfaceMeshActor_C_SetExternalMaterial final
{
public:
	class UMaterialInterface*                     OverWater;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_FluxSurfaceMeshActor_C_SetExternalMaterial) == 0x000008, "Wrong alignment on BPI_FluxSurfaceMeshActor_C_SetExternalMaterial");
static_assert(sizeof(BPI_FluxSurfaceMeshActor_C_SetExternalMaterial) == 0x000008, "Wrong size on BPI_FluxSurfaceMeshActor_C_SetExternalMaterial");
static_assert(offsetof(BPI_FluxSurfaceMeshActor_C_SetExternalMaterial, OverWater) == 0x000000, "Member 'BPI_FluxSurfaceMeshActor_C_SetExternalMaterial::OverWater' has a wrong offset!");

// Function BPI_FluxSurfaceMeshActor.BPI_FluxSurfaceMeshActor_C.GetGlassMaterials
// 0x0010 (0x0010 - 0x0000)
struct BPI_FluxSurfaceMeshActor_C_GetGlassMaterials final
{
public:
	TArray<class UMaterialInstanceDynamic*>       NewParam;                                          // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BPI_FluxSurfaceMeshActor_C_GetGlassMaterials) == 0x000008, "Wrong alignment on BPI_FluxSurfaceMeshActor_C_GetGlassMaterials");
static_assert(sizeof(BPI_FluxSurfaceMeshActor_C_GetGlassMaterials) == 0x000010, "Wrong size on BPI_FluxSurfaceMeshActor_C_GetGlassMaterials");
static_assert(offsetof(BPI_FluxSurfaceMeshActor_C_GetGlassMaterials, NewParam) == 0x000000, "Member 'BPI_FluxSurfaceMeshActor_C_GetGlassMaterials::NewParam' has a wrong offset!");

}

