#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_ProceduralMesh

#include "Basic.hpp"

#include "BS_MeshDefinition_structs.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPL_ProceduralMesh.BPL_ProceduralMesh_C.SplineTCoeff
// 0x00B0 (0x00B0 - 0x0000)
struct BPL_ProceduralMesh_C_SplineTCoeff final
{
public:
	double                                        T1;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        WP1;                                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WT1;                                               // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WP2;                                               // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WT2;                                               // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        T3;                                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        T2;                                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_8;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_ProceduralMesh_C_SplineTCoeff) == 0x000008, "Wrong alignment on BPL_ProceduralMesh_C_SplineTCoeff");
static_assert(sizeof(BPL_ProceduralMesh_C_SplineTCoeff) == 0x0000B0, "Wrong size on BPL_ProceduralMesh_C_SplineTCoeff");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, T1) == 0x000000, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::T1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, __WorldContext) == 0x000008, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, WP1) == 0x000010, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::WP1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, WT1) == 0x000018, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::WT1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, WP2) == 0x000020, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::WP2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, WT2) == 0x000028, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::WT2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, T3) == 0x000030, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::T3' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, T2) == 0x000038, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::T2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000058, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000060, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000068, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000078, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000080, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000088, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x000090, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000098, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_8) == 0x0000A0, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineTCoeff, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0000A8, "Member 'BPL_ProceduralMesh_C_SplineTCoeff::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");

// Function BPL_ProceduralMesh.BPL_ProceduralMesh_C.SplineT
// 0x0150 (0x0150 - 0x0000)
struct BPL_ProceduralMesh_C_SplineT final
{
public:
	struct FVector                                A;                                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AT;                                                // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                B;                                                 // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BT;                                                // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        T;                                                 // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                R;                                                 // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SplineTCoeff_WP1;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SplineTCoeff_WT1;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SplineTCoeff_WP2;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SplineTCoeff_WT2;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_ProceduralMesh_C_SplineT) == 0x000008, "Wrong alignment on BPL_ProceduralMesh_C_SplineT");
static_assert(sizeof(BPL_ProceduralMesh_C_SplineT) == 0x000150, "Wrong size on BPL_ProceduralMesh_C_SplineT");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, A) == 0x000000, "Member 'BPL_ProceduralMesh_C_SplineT::A' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, AT) == 0x000018, "Member 'BPL_ProceduralMesh_C_SplineT::AT' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, B) == 0x000030, "Member 'BPL_ProceduralMesh_C_SplineT::B' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, BT) == 0x000048, "Member 'BPL_ProceduralMesh_C_SplineT::BT' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, T) == 0x000060, "Member 'BPL_ProceduralMesh_C_SplineT::T' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, __WorldContext) == 0x000068, "Member 'BPL_ProceduralMesh_C_SplineT::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, R) == 0x000070, "Member 'BPL_ProceduralMesh_C_SplineT::R' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, CallFunc_SplineTCoeff_WP1) == 0x000088, "Member 'BPL_ProceduralMesh_C_SplineT::CallFunc_SplineTCoeff_WP1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, CallFunc_SplineTCoeff_WT1) == 0x000090, "Member 'BPL_ProceduralMesh_C_SplineT::CallFunc_SplineTCoeff_WT1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, CallFunc_SplineTCoeff_WP2) == 0x000098, "Member 'BPL_ProceduralMesh_C_SplineT::CallFunc_SplineTCoeff_WP2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, CallFunc_SplineTCoeff_WT2) == 0x0000A0, "Member 'BPL_ProceduralMesh_C_SplineT::CallFunc_SplineTCoeff_WT2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A8, "Member 'BPL_ProceduralMesh_C_SplineT::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000C0, "Member 'BPL_ProceduralMesh_C_SplineT::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0000D8, "Member 'BPL_ProceduralMesh_C_SplineT::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x0000F0, "Member 'BPL_ProceduralMesh_C_SplineT::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'BPL_ProceduralMesh_C_SplineT::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000120, "Member 'BPL_ProceduralMesh_C_SplineT::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineT, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000138, "Member 'BPL_ProceduralMesh_C_SplineT::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");

// Function BPL_ProceduralMesh.BPL_ProceduralMesh_C.SplineCoeff
// 0x00A8 (0x00A8 - 0x0000)
struct BPL_ProceduralMesh_C_SplineCoeff final
{
public:
	double                                        T;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        WP1;                                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WT1;                                               // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WP2;                                               // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WT2;                                               // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        T3;                                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        T2;                                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_ProceduralMesh_C_SplineCoeff) == 0x000008, "Wrong alignment on BPL_ProceduralMesh_C_SplineCoeff");
static_assert(sizeof(BPL_ProceduralMesh_C_SplineCoeff) == 0x0000A8, "Wrong size on BPL_ProceduralMesh_C_SplineCoeff");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, T) == 0x000000, "Member 'BPL_ProceduralMesh_C_SplineCoeff::T' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, __WorldContext) == 0x000008, "Member 'BPL_ProceduralMesh_C_SplineCoeff::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, WP1) == 0x000010, "Member 'BPL_ProceduralMesh_C_SplineCoeff::WP1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, WT1) == 0x000018, "Member 'BPL_ProceduralMesh_C_SplineCoeff::WT1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, WP2) == 0x000020, "Member 'BPL_ProceduralMesh_C_SplineCoeff::WP2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, WT2) == 0x000028, "Member 'BPL_ProceduralMesh_C_SplineCoeff::WT2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, T3) == 0x000030, "Member 'BPL_ProceduralMesh_C_SplineCoeff::T3' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, T2) == 0x000038, "Member 'BPL_ProceduralMesh_C_SplineCoeff::T2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000058, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000070, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000080, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000088, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000090, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000098, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_SplineCoeff, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0000A0, "Member 'BPL_ProceduralMesh_C_SplineCoeff::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");

// Function BPL_ProceduralMesh.BPL_ProceduralMesh_C.Spline
// 0x0150 (0x0150 - 0x0000)
struct BPL_ProceduralMesh_C_Spline final
{
public:
	struct FVector                                A;                                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AT;                                                // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                B;                                                 // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BT;                                                // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        T;                                                 // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                R;                                                 // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SplineCoeff_WP1;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SplineCoeff_WT1;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SplineCoeff_WP2;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SplineCoeff_WT2;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_ProceduralMesh_C_Spline) == 0x000008, "Wrong alignment on BPL_ProceduralMesh_C_Spline");
static_assert(sizeof(BPL_ProceduralMesh_C_Spline) == 0x000150, "Wrong size on BPL_ProceduralMesh_C_Spline");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, A) == 0x000000, "Member 'BPL_ProceduralMesh_C_Spline::A' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, AT) == 0x000018, "Member 'BPL_ProceduralMesh_C_Spline::AT' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, B) == 0x000030, "Member 'BPL_ProceduralMesh_C_Spline::B' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, BT) == 0x000048, "Member 'BPL_ProceduralMesh_C_Spline::BT' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, T) == 0x000060, "Member 'BPL_ProceduralMesh_C_Spline::T' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, __WorldContext) == 0x000068, "Member 'BPL_ProceduralMesh_C_Spline::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, R) == 0x000070, "Member 'BPL_ProceduralMesh_C_Spline::R' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, CallFunc_SplineCoeff_WP1) == 0x000088, "Member 'BPL_ProceduralMesh_C_Spline::CallFunc_SplineCoeff_WP1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, CallFunc_SplineCoeff_WT1) == 0x000090, "Member 'BPL_ProceduralMesh_C_Spline::CallFunc_SplineCoeff_WT1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, CallFunc_SplineCoeff_WP2) == 0x000098, "Member 'BPL_ProceduralMesh_C_Spline::CallFunc_SplineCoeff_WP2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, CallFunc_SplineCoeff_WT2) == 0x0000A0, "Member 'BPL_ProceduralMesh_C_Spline::CallFunc_SplineCoeff_WT2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A8, "Member 'BPL_ProceduralMesh_C_Spline::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000C0, "Member 'BPL_ProceduralMesh_C_Spline::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0000D8, "Member 'BPL_ProceduralMesh_C_Spline::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x0000F0, "Member 'BPL_ProceduralMesh_C_Spline::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'BPL_ProceduralMesh_C_Spline::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000120, "Member 'BPL_ProceduralMesh_C_Spline::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Spline, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000138, "Member 'BPL_ProceduralMesh_C_Spline::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");

// Function BPL_ProceduralMesh.BPL_ProceduralMesh_C.QuadIndices
// 0x0068 (0x0068 - 0x0000)
struct BPL_ProceduralMesh_C_QuadIndices final
{
public:
	int32                                         I0;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         I1;                                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         I2;                                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         I3;                                                // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Swap;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Array;                                             // 0x0020(0x0010)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_Select_Default;                             // 0x0058(0x0010)(ReferenceParm)
};
static_assert(alignof(BPL_ProceduralMesh_C_QuadIndices) == 0x000008, "Wrong alignment on BPL_ProceduralMesh_C_QuadIndices");
static_assert(sizeof(BPL_ProceduralMesh_C_QuadIndices) == 0x000068, "Wrong size on BPL_ProceduralMesh_C_QuadIndices");
static_assert(offsetof(BPL_ProceduralMesh_C_QuadIndices, I0) == 0x000000, "Member 'BPL_ProceduralMesh_C_QuadIndices::I0' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_QuadIndices, I1) == 0x000004, "Member 'BPL_ProceduralMesh_C_QuadIndices::I1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_QuadIndices, I2) == 0x000008, "Member 'BPL_ProceduralMesh_C_QuadIndices::I2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_QuadIndices, I3) == 0x00000C, "Member 'BPL_ProceduralMesh_C_QuadIndices::I3' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_QuadIndices, Swap) == 0x000010, "Member 'BPL_ProceduralMesh_C_QuadIndices::Swap' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_QuadIndices, __WorldContext) == 0x000018, "Member 'BPL_ProceduralMesh_C_QuadIndices::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_QuadIndices, Array) == 0x000020, "Member 'BPL_ProceduralMesh_C_QuadIndices::Array' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_QuadIndices, Temp_bool_Variable) == 0x000030, "Member 'BPL_ProceduralMesh_C_QuadIndices::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_QuadIndices, K2Node_MakeArray_Array) == 0x000038, "Member 'BPL_ProceduralMesh_C_QuadIndices::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_QuadIndices, K2Node_MakeArray_Array_1) == 0x000048, "Member 'BPL_ProceduralMesh_C_QuadIndices::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_QuadIndices, K2Node_Select_Default) == 0x000058, "Member 'BPL_ProceduralMesh_C_QuadIndices::K2Node_Select_Default' has a wrong offset!");

// Function BPL_ProceduralMesh.BPL_ProceduralMesh_C.PackIntToColor
// 0x0098 (0x0098 - 0x0000)
struct BPL_ProceduralMesh_C_PackIntToColor final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        R;                                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        G;                                                 // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        B;                                                 // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        A;                                                 // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_2;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_3;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_ProceduralMesh_C_PackIntToColor) == 0x000008, "Wrong alignment on BPL_ProceduralMesh_C_PackIntToColor");
static_assert(sizeof(BPL_ProceduralMesh_C_PackIntToColor) == 0x000098, "Wrong size on BPL_ProceduralMesh_C_PackIntToColor");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, Value) == 0x000000, "Member 'BPL_ProceduralMesh_C_PackIntToColor::Value' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, __WorldContext) == 0x000008, "Member 'BPL_ProceduralMesh_C_PackIntToColor::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, R) == 0x000010, "Member 'BPL_ProceduralMesh_C_PackIntToColor::R' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, G) == 0x000018, "Member 'BPL_ProceduralMesh_C_PackIntToColor::G' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, B) == 0x000020, "Member 'BPL_ProceduralMesh_C_PackIntToColor::B' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, A) == 0x000028, "Member 'BPL_ProceduralMesh_C_PackIntToColor::A' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Percent_IntInt_ReturnValue) == 0x000030, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Divide_IntInt_ReturnValue) == 0x000034, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Divide_IntInt_ReturnValue_1) == 0x000040, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Divide_IntInt_ReturnValue_2) == 0x000050, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Divide_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000054, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Percent_IntInt_ReturnValue_2) == 0x000058, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000060, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000068, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000078, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Percent_IntInt_ReturnValue_3) == 0x000080, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Percent_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000088, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_PackIntToColor, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000090, "Member 'BPL_ProceduralMesh_C_PackIntToColor::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");

// Function BPL_ProceduralMesh.BPL_ProceduralMesh_C.Pack4Ints
// 0x0048 (0x0048 - 0x0000)
struct BPL_ProceduralMesh_C_Pack4Ints final
{
public:
	int32                                         Value1;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value2;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value3;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value4;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Bits;                                              // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_2;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_3;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Or_IntInt_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_2;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Or_IntInt_ReturnValue_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Or_IntInt_ReturnValue_2;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_ProceduralMesh_C_Pack4Ints) == 0x000008, "Wrong alignment on BPL_ProceduralMesh_C_Pack4Ints");
static_assert(sizeof(BPL_ProceduralMesh_C_Pack4Ints) == 0x000048, "Wrong size on BPL_ProceduralMesh_C_Pack4Ints");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, Value1) == 0x000000, "Member 'BPL_ProceduralMesh_C_Pack4Ints::Value1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, Value2) == 0x000004, "Member 'BPL_ProceduralMesh_C_Pack4Ints::Value2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, Value3) == 0x000008, "Member 'BPL_ProceduralMesh_C_Pack4Ints::Value3' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, Value4) == 0x00000C, "Member 'BPL_ProceduralMesh_C_Pack4Ints::Value4' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, __WorldContext) == 0x000010, "Member 'BPL_ProceduralMesh_C_Pack4Ints::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, Bits) == 0x000018, "Member 'BPL_ProceduralMesh_C_Pack4Ints::Bits' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, CallFunc_Clamp_ReturnValue) == 0x00001C, "Member 'BPL_ProceduralMesh_C_Pack4Ints::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, CallFunc_Clamp_ReturnValue_1) == 0x000020, "Member 'BPL_ProceduralMesh_C_Pack4Ints::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, CallFunc_Clamp_ReturnValue_2) == 0x000024, "Member 'BPL_ProceduralMesh_C_Pack4Ints::CallFunc_Clamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, CallFunc_Multiply_IntInt_ReturnValue) == 0x000028, "Member 'BPL_ProceduralMesh_C_Pack4Ints::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x00002C, "Member 'BPL_ProceduralMesh_C_Pack4Ints::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, CallFunc_Clamp_ReturnValue_3) == 0x000030, "Member 'BPL_ProceduralMesh_C_Pack4Ints::CallFunc_Clamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, CallFunc_Or_IntInt_ReturnValue) == 0x000034, "Member 'BPL_ProceduralMesh_C_Pack4Ints::CallFunc_Or_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, CallFunc_Multiply_IntInt_ReturnValue_2) == 0x000038, "Member 'BPL_ProceduralMesh_C_Pack4Ints::CallFunc_Multiply_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, CallFunc_Or_IntInt_ReturnValue_1) == 0x00003C, "Member 'BPL_ProceduralMesh_C_Pack4Ints::CallFunc_Or_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack4Ints, CallFunc_Or_IntInt_ReturnValue_2) == 0x000040, "Member 'BPL_ProceduralMesh_C_Pack4Ints::CallFunc_Or_IntInt_ReturnValue_2' has a wrong offset!");

// Function BPL_ProceduralMesh.BPL_ProceduralMesh_C.Pack3Ints
// 0x0038 (0x0038 - 0x0000)
struct BPL_ProceduralMesh_C_Pack3Ints final
{
public:
	int32                                         Value1;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value2;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value3;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Bits;                                              // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_2;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Or_IntInt_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Or_IntInt_ReturnValue_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPL_ProceduralMesh_C_Pack3Ints) == 0x000008, "Wrong alignment on BPL_ProceduralMesh_C_Pack3Ints");
static_assert(sizeof(BPL_ProceduralMesh_C_Pack3Ints) == 0x000038, "Wrong size on BPL_ProceduralMesh_C_Pack3Ints");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack3Ints, Value1) == 0x000000, "Member 'BPL_ProceduralMesh_C_Pack3Ints::Value1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack3Ints, Value2) == 0x000004, "Member 'BPL_ProceduralMesh_C_Pack3Ints::Value2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack3Ints, Value3) == 0x000008, "Member 'BPL_ProceduralMesh_C_Pack3Ints::Value3' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack3Ints, __WorldContext) == 0x000010, "Member 'BPL_ProceduralMesh_C_Pack3Ints::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack3Ints, Bits) == 0x000018, "Member 'BPL_ProceduralMesh_C_Pack3Ints::Bits' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack3Ints, CallFunc_Clamp_ReturnValue) == 0x00001C, "Member 'BPL_ProceduralMesh_C_Pack3Ints::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack3Ints, CallFunc_Clamp_ReturnValue_1) == 0x000020, "Member 'BPL_ProceduralMesh_C_Pack3Ints::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack3Ints, CallFunc_Clamp_ReturnValue_2) == 0x000024, "Member 'BPL_ProceduralMesh_C_Pack3Ints::CallFunc_Clamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack3Ints, CallFunc_Multiply_IntInt_ReturnValue) == 0x000028, "Member 'BPL_ProceduralMesh_C_Pack3Ints::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack3Ints, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x00002C, "Member 'BPL_ProceduralMesh_C_Pack3Ints::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack3Ints, CallFunc_Or_IntInt_ReturnValue) == 0x000030, "Member 'BPL_ProceduralMesh_C_Pack3Ints::CallFunc_Or_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_ProceduralMesh_C_Pack3Ints, CallFunc_Or_IntInt_ReturnValue_1) == 0x000034, "Member 'BPL_ProceduralMesh_C_Pack3Ints::CallFunc_Or_IntInt_ReturnValue_1' has a wrong offset!");

// Function BPL_ProceduralMesh.BPL_ProceduralMesh_C.ModUVMapPlane
// 0x0210 (0x0210 - 0x0000)
struct BPL_ProceduralMesh_C_ModUVMapPlane final
{
public:
	struct FBS_MeshDefinition                     InMesh;                                            // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FTransform                             Transform;                                         // 0x0060(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBS_MeshDefinition                     OutMesh;                                           // 0x00C8(0x0060)(Parm, OutParm, HasGetValueTypeHash)
	TArray<struct FVector2D>                      TexCoords;                                         // 0x0128(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
