#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Face_AnimBP_HumanNPC_Simple

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Face_AnimBP_HumanNPC_Simple.Face_AnimBP_HumanNPC_Simple_C.AnimBlueprintGeneratedConstantData
// 0x01EF (0x01F0 - 0x0001)
struct Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_16;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_17;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_18;                               // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0038(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x00D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;               // 0x0100(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x0130(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x0160(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x0190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x01C0(0x0030)()
};
static_assert(alignof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData) == 0x0001F0, "Wrong size on Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData, __NameProperty_16) == 0x000004, "Member 'Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData::__NameProperty_16' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData, __NameProperty_17) == 0x00000C, "Member 'Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData::__NameProperty_17' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData, __StructProperty_18) == 0x000018, "Member 'Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData::__StructProperty_18' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000038, "Member 'Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B8, "Member 'Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000D0, "Member 'Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x000100, "Member 'Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000130, "Member 'Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000160, "Member 'Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000190, "Member 'Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x0001C0, "Member 'Face_AnimBP_HumanNPC_Simple::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");

}

