#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Face_NPCSimple_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "RigLogicModule_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Face_NPCSimple_AnimBP.Face_NPCSimple_AnimBP_C
// 0x03D0 (0x0740 - 0x0370)
class UFace_NPCSimple_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0388(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0478(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x04C0(0x0028)()
	struct FAnimNode_RigLogic                     AnimGraphNode_RigLogic;                            // 0x04E8(0x0060)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0548(0x0080)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x05C8(0x0158)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0720(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Face_NPCSimple_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Face_NPCSimple_AnimBP_C">();
	}
	static class UFace_NPCSimple_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFace_NPCSimple_AnimBP_C>();
	}
};
static_assert(alignof(UFace_NPCSimple_AnimBP_C) == 0x000010, "Wrong alignment on UFace_NPCSimple_AnimBP_C");
static_assert(sizeof(UFace_NPCSimple_AnimBP_C) == 0x000740, "Wrong size on UFace_NPCSimple_AnimBP_C");
static_assert(offsetof(UFace_NPCSimple_AnimBP_C, UberGraphFrame) == 0x000370, "Member 'UFace_NPCSimple_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFace_NPCSimple_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UFace_NPCSimple_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UFace_NPCSimple_AnimBP_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UFace_NPCSimple_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UFace_NPCSimple_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x000388, "Member 'UFace_NPCSimple_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UFace_NPCSimple_AnimBP_C, AnimGraphNode_Slot) == 0x000478, "Member 'UFace_NPCSimple_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UFace_NPCSimple_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x0004C0, "Member 'UFace_NPCSimple_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UFace_NPCSimple_AnimBP_C, AnimGraphNode_RigLogic) == 0x0004E8, "Member 'UFace_NPCSimple_AnimBP_C::AnimGraphNode_RigLogic' has a wrong offset!");
static_assert(offsetof(UFace_NPCSimple_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000548, "Member 'UFace_NPCSimple_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UFace_NPCSimple_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0005C8, "Member 'UFace_NPCSimple_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UFace_NPCSimple_AnimBP_C, AnimGraphNode_Root) == 0x000720, "Member 'UFace_NPCSimple_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");

}

