#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_ForetellHelpers

#include "Basic.hpp"

#include "S_BalancingTableFloatEntry_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FL_ForetellHelpers.FL_ForetellHelpers_C.GetForetellComponentFromSkillScript
// 0x00C0 (0x00C0 - 0x0000)
struct FL_ForetellHelpers_C_GetForetellComponentFromSkillScript final
{
public:
	class ABP_Battle_SkillScript_C*               SkillScript;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SkillDataComponent_ForetellMechanic_C* ForetellDataComponent;                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_SkillDataComponent_Base_C*>  CallFunc_FindSkillComponentsByClass_Array;         // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SkillDataComponent_Base_C*          CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SkillDataComponent_ForetellMechanic_C* K2Node_DynamicCast_AsBP_Skill_Data_Component_Foretell_Mechanic; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript) == 0x000008, "Wrong alignment on FL_ForetellHelpers_C_GetForetellComponentFromSkillScript");
static_assert(sizeof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript) == 0x0000C0, "Wrong size on FL_ForetellHelpers_C_GetForetellComponentFromSkillScript");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, SkillScript) == 0x000000, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::SkillScript' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, __WorldContext) == 0x000008, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, ForetellDataComponent) == 0x000010, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::ForetellDataComponent' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, CallFunc_FindSkillComponentsByClass_Array) == 0x000018, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::CallFunc_FindSkillComponentsByClass_Array' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, CallFunc_Array_Get_Item) == 0x000030, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, K2Node_DynamicCast_AsBP_Skill_Data_Component_Foretell_Mechanic) == 0x000040, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::K2Node_DynamicCast_AsBP_Skill_Data_Component_Foretell_Mechanic' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000050, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, K2Node_MakeArray_Array) == 0x0000A0, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetForetellComponentFromSkillScript, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'FL_ForetellHelpers_C_GetForetellComponentFromSkillScript::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function FL_ForetellHelpers.FL_ForetellHelpers_C.GetTwilightBaseDamageBonusPerCharge
// 0x0018 (0x0018 - 0x0000)
struct FL_ForetellHelpers_C_GetTwilightBaseDamageBonusPerCharge final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_BalancingTableFloatEntry            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_ForetellHelpers_C_GetTwilightBaseDamageBonusPerCharge) == 0x000008, "Wrong alignment on FL_ForetellHelpers_C_GetTwilightBaseDamageBonusPerCharge");
static_assert(sizeof(FL_ForetellHelpers_C_GetTwilightBaseDamageBonusPerCharge) == 0x000018, "Wrong size on FL_ForetellHelpers_C_GetTwilightBaseDamageBonusPerCharge");
static_assert(offsetof(FL_ForetellHelpers_C_GetTwilightBaseDamageBonusPerCharge, __WorldContext) == 0x000000, "Member 'FL_ForetellHelpers_C_GetTwilightBaseDamageBonusPerCharge::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetTwilightBaseDamageBonusPerCharge, ReturnValue) == 0x000008, "Member 'FL_ForetellHelpers_C_GetTwilightBaseDamageBonusPerCharge::ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_ForetellHelpers_C_GetTwilightBaseDamageBonusPerCharge, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'FL_ForetellHelpers_C_GetTwilightBaseDamageBonusPerCharge::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");

}

