#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_FluxWaveProfile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PDA_FluxWaveProfile.PDA_FluxWaveProfile_C.SetWaveProfileData
// 0x0030 (0x0030 - 0x0000)
struct PDA_FluxWaveProfile_C_SetWaveProfileData final
{
public:
	class UTexture*                               WaveProfilesForward;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               WaveProfilesInverse;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           WaveProfileDecode_0;                               // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Frames_0;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WaveWidth;                                         // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WaveHeight_0;                                      // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PDA_FluxWaveProfile_C_SetWaveProfileData) == 0x000008, "Wrong alignment on PDA_FluxWaveProfile_C_SetWaveProfileData");
static_assert(sizeof(PDA_FluxWaveProfile_C_SetWaveProfileData) == 0x000030, "Wrong size on PDA_FluxWaveProfile_C_SetWaveProfileData");
static_assert(offsetof(PDA_FluxWaveProfile_C_SetWaveProfileData, WaveProfilesForward) == 0x000000, "Member 'PDA_FluxWaveProfile_C_SetWaveProfileData::WaveProfilesForward' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_SetWaveProfileData, WaveProfilesInverse) == 0x000008, "Member 'PDA_FluxWaveProfile_C_SetWaveProfileData::WaveProfilesInverse' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_SetWaveProfileData, WaveProfileDecode_0) == 0x000010, "Member 'PDA_FluxWaveProfile_C_SetWaveProfileData::WaveProfileDecode_0' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_SetWaveProfileData, Frames_0) == 0x000020, "Member 'PDA_FluxWaveProfile_C_SetWaveProfileData::Frames_0' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_SetWaveProfileData, WaveWidth) == 0x000024, "Member 'PDA_FluxWaveProfile_C_SetWaveProfileData::WaveWidth' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_SetWaveProfileData, WaveHeight_0) == 0x000028, "Member 'PDA_FluxWaveProfile_C_SetWaveProfileData::WaveHeight_0' has a wrong offset!");

// Function PDA_FluxWaveProfile.PDA_FluxWaveProfile_C.GetExternalReferences
// 0x0020 (0x0020 - 0x0000)
struct PDA_FluxWaveProfile_C_GetExternalReferences final
{
public:
	TArray<class UTexture*>                       Objects;                                           // 0x0000(0x0010)(Parm, OutParm)
	TArray<class UTexture*>                       K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(PDA_FluxWaveProfile_C_GetExternalReferences) == 0x000008, "Wrong alignment on PDA_FluxWaveProfile_C_GetExternalReferences");
static_assert(sizeof(PDA_FluxWaveProfile_C_GetExternalReferences) == 0x000020, "Wrong size on PDA_FluxWaveProfile_C_GetExternalReferences");
static_assert(offsetof(PDA_FluxWaveProfile_C_GetExternalReferences, Objects) == 0x000000, "Member 'PDA_FluxWaveProfile_C_GetExternalReferences::Objects' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_GetExternalReferences, K2Node_MakeArray_Array) == 0x000010, "Member 'PDA_FluxWaveProfile_C_GetExternalReferences::K2Node_MakeArray_Array' has a wrong offset!");

// Function PDA_FluxWaveProfile.PDA_FluxWaveProfile_C.ExecuteUbergraph_PDA_FluxWaveProfile
// 0x0004 (0x0004 - 0x0000)
struct PDA_FluxWaveProfile_C_ExecuteUbergraph_PDA_FluxWaveProfile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PDA_FluxWaveProfile_C_ExecuteUbergraph_PDA_FluxWaveProfile) == 0x000004, "Wrong alignment on PDA_FluxWaveProfile_C_ExecuteUbergraph_PDA_FluxWaveProfile");
static_assert(sizeof(PDA_FluxWaveProfile_C_ExecuteUbergraph_PDA_FluxWaveProfile) == 0x000004, "Wrong size on PDA_FluxWaveProfile_C_ExecuteUbergraph_PDA_FluxWaveProfile");
static_assert(offsetof(PDA_FluxWaveProfile_C_ExecuteUbergraph_PDA_FluxWaveProfile, EntryPoint) == 0x000000, "Member 'PDA_FluxWaveProfile_C_ExecuteUbergraph_PDA_FluxWaveProfile::EntryPoint' has a wrong offset!");

// Function PDA_FluxWaveProfile.PDA_FluxWaveProfile_C.CopyPropertiesToObject
// 0x0010 (0x0010 - 0x0000)
struct PDA_FluxWaveProfile_C_CopyPropertiesToObject final
{
public:
	class UObject*                                Destination;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Done;                                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PDA_FluxWaveProfile_C_CopyPropertiesToObject) == 0x000008, "Wrong alignment on PDA_FluxWaveProfile_C_CopyPropertiesToObject");
static_assert(sizeof(PDA_FluxWaveProfile_C_CopyPropertiesToObject) == 0x000010, "Wrong size on PDA_FluxWaveProfile_C_CopyPropertiesToObject");
static_assert(offsetof(PDA_FluxWaveProfile_C_CopyPropertiesToObject, Destination) == 0x000000, "Member 'PDA_FluxWaveProfile_C_CopyPropertiesToObject::Destination' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_CopyPropertiesToObject, Done) == 0x000008, "Member 'PDA_FluxWaveProfile_C_CopyPropertiesToObject::Done' has a wrong offset!");

// Function PDA_FluxWaveProfile.PDA_FluxWaveProfile_C.ApplyWaveProfileNiagaraData
// 0x0050 (0x0050 - 0x0000)
struct PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData final
{
public:
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0010(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_X_ImplicitCast;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_Y_ImplicitCast;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_Z_ImplicitCast;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_W_ImplicitCast;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData) == 0x000010, "Wrong alignment on PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData");
static_assert(sizeof(PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData) == 0x000050, "Wrong size on PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData, NiagaraSystem) == 0x000000, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData, CallFunc_MakeVector4_ReturnValue) == 0x000010, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData, CallFunc_MakeVector4_X_ImplicitCast) == 0x000030, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData::CallFunc_MakeVector4_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData, CallFunc_MakeVector4_Y_ImplicitCast) == 0x000038, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData::CallFunc_MakeVector4_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData, CallFunc_MakeVector4_Z_ImplicitCast) == 0x000040, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData::CallFunc_MakeVector4_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData, CallFunc_MakeVector4_W_ImplicitCast) == 0x000048, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileNiagaraData::CallFunc_MakeVector4_W_ImplicitCast' has a wrong offset!");

// Function PDA_FluxWaveProfile.PDA_FluxWaveProfile_C.ApplyWaveProfileMaterialData
// 0x0058 (0x0058 - 0x0000)
struct PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData final
{
public:
	TArray<class UMaterialInstanceDynamic*>       Materials;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData) == 0x000008, "Wrong alignment on PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData");
static_assert(sizeof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData) == 0x000058, "Wrong size on PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, Materials) == 0x000000, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::Materials' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, Temp_int_Variable) == 0x000010, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, Temp_int_Variable_1) == 0x000014, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, Temp_int_Variable_2) == 0x000020, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, CallFunc_Array_Get_Item) == 0x000028, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, CallFunc_Less_IntInt_ReturnValue_1) == 0x000044, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, CallFunc_Array_Get_Item_2) == 0x000048, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, CallFunc_Array_Length_ReturnValue_2) == 0x000050, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData, CallFunc_Less_IntInt_ReturnValue_2) == 0x000054, "Member 'PDA_FluxWaveProfile_C_ApplyWaveProfileMaterialData::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

}

