#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_CharacterAnimationParameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_CharacterAnimationParameters.S_CharacterAnimationParameters
// 0x0048 (0x0048 - 0x0000)
struct FS_CharacterAnimationParameters final
{
public:
	TSoftObjectPtr<class AActor>                  Actor_5_477634994ACD83399640D9A4308EC31E;          // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UAnimSequence*                          Animation_7_94BE01034CCA15CAA07CE2AFFA14A964;      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayAsMontage_15_910F11404CFD3BE7BDB04E979D8F0CE0; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PlayRate_14_3E30A7BF45B440C0E70050A1E87BDE4B;      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MeshComponentTag_18_97A431074E2D03DE1401F2994A7C9D2B; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_CharacterAnimationParameters) == 0x000008, "Wrong alignment on FS_CharacterAnimationParameters");
static_assert(sizeof(FS_CharacterAnimationParameters) == 0x000048, "Wrong size on FS_CharacterAnimationParameters");
static_assert(offsetof(FS_CharacterAnimationParameters, Actor_5_477634994ACD83399640D9A4308EC31E) == 0x000000, "Member 'FS_CharacterAnimationParameters::Actor_5_477634994ACD83399640D9A4308EC31E' has a wrong offset!");
static_assert(offsetof(FS_CharacterAnimationParameters, Animation_7_94BE01034CCA15CAA07CE2AFFA14A964) == 0x000028, "Member 'FS_CharacterAnimationParameters::Animation_7_94BE01034CCA15CAA07CE2AFFA14A964' has a wrong offset!");
static_assert(offsetof(FS_CharacterAnimationParameters, PlayAsMontage_15_910F11404CFD3BE7BDB04E979D8F0CE0) == 0x000030, "Member 'FS_CharacterAnimationParameters::PlayAsMontage_15_910F11404CFD3BE7BDB04E979D8F0CE0' has a wrong offset!");
static_assert(offsetof(FS_CharacterAnimationParameters, PlayRate_14_3E30A7BF45B440C0E70050A1E87BDE4B) == 0x000038, "Member 'FS_CharacterAnimationParameters::PlayRate_14_3E30A7BF45B440C0E70050A1E87BDE4B' has a wrong offset!");
static_assert(offsetof(FS_CharacterAnimationParameters, MeshComponentTag_18_97A431074E2D03DE1401F2994A7C9D2B) == 0x000040, "Member 'FS_CharacterAnimationParameters::MeshComponentTag_18_97A431074E2D03DE1401F2994A7C9D2B' has a wrong offset!");

}

