#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_GestralRandomMaterialVariation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_GestralRandomMaterialVariation.S_GestralRandomMaterialVariation
// 0x00C0 (0x00C0 - 0x0000)
struct FS_GestralRandomMaterialVariation final
{
public:
	struct FLinearColor                           ColorMaskR_6_DD8A36674C47134458B052B43450A75A;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorMaskG_7_9835374D4185E5146AAFDA8A6E1981BB;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorMaskB_8_1C3A15A642C4BCA6DAE80F8593078149;     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaskPaintMult_15_372ED88F414F408A0CD6D78E11ABB81F; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        UV_Mask_Rotate_16_4AA106444FEE73FC1607F69D60D5ABEF; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        UV_Mask_Scale_17_F364C1E24B3E422676A149B1338A6090; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirtMaskRotation_20_FC19284B426FB1E09FE2B3A85C5F415E; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirtMaskScalingVariation_22_D62F325C4725B3D081ADE0B734CDF395; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChannelR_29_F4974F0A46CE71F7F55B78A5BC4D0866;      // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChannelG_30_A82BF0974E019A68C01BFA995D583348;      // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChannelB_31_B3A470D3497AD4394F9B31889AE3A82F;      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hair_ColorDown_36_43F3B129442AFB442BD29E9271868B53; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hair_ColorTop_37_775867604FCFD4357C2D63B09CCDE3AB; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Mask_AlphaTexture_47_CA37BE3C4D7F5E102D1F2AA3318E1663; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Mask_AlphaIntensity_46_6B0727CA49C0166E674B25912D2AB5F0; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Mask_AlphaColor_45_85FD0DD54E5F49BEF220E1BF0B5D12D6; // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GradientHeight_55_AECC46FB420DA44A80C5859EC3720E91; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GradientHardness_56_358ADA0343DC3A006FA854A31C3370BC; // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_GestralRandomMaterialVariation) == 0x000008, "Wrong alignment on FS_GestralRandomMaterialVariation");
static_assert(sizeof(FS_GestralRandomMaterialVariation) == 0x0000C0, "Wrong size on FS_GestralRandomMaterialVariation");
static_assert(offsetof(FS_GestralRandomMaterialVariation, ColorMaskR_6_DD8A36674C47134458B052B43450A75A) == 0x000000, "Member 'FS_GestralRandomMaterialVariation::ColorMaskR_6_DD8A36674C47134458B052B43450A75A' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, ColorMaskG_7_9835374D4185E5146AAFDA8A6E1981BB) == 0x000010, "Member 'FS_GestralRandomMaterialVariation::ColorMaskG_7_9835374D4185E5146AAFDA8A6E1981BB' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, ColorMaskB_8_1C3A15A642C4BCA6DAE80F8593078149) == 0x000020, "Member 'FS_GestralRandomMaterialVariation::ColorMaskB_8_1C3A15A642C4BCA6DAE80F8593078149' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, MaskPaintMult_15_372ED88F414F408A0CD6D78E11ABB81F) == 0x000030, "Member 'FS_GestralRandomMaterialVariation::MaskPaintMult_15_372ED88F414F408A0CD6D78E11ABB81F' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, UV_Mask_Rotate_16_4AA106444FEE73FC1607F69D60D5ABEF) == 0x000038, "Member 'FS_GestralRandomMaterialVariation::UV_Mask_Rotate_16_4AA106444FEE73FC1607F69D60D5ABEF' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, UV_Mask_Scale_17_F364C1E24B3E422676A149B1338A6090) == 0x000040, "Member 'FS_GestralRandomMaterialVariation::UV_Mask_Scale_17_F364C1E24B3E422676A149B1338A6090' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, DirtMaskRotation_20_FC19284B426FB1E09FE2B3A85C5F415E) == 0x000048, "Member 'FS_GestralRandomMaterialVariation::DirtMaskRotation_20_FC19284B426FB1E09FE2B3A85C5F415E' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, DirtMaskScalingVariation_22_D62F325C4725B3D081ADE0B734CDF395) == 0x000050, "Member 'FS_GestralRandomMaterialVariation::DirtMaskScalingVariation_22_D62F325C4725B3D081ADE0B734CDF395' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, ChannelR_29_F4974F0A46CE71F7F55B78A5BC4D0866) == 0x000058, "Member 'FS_GestralRandomMaterialVariation::ChannelR_29_F4974F0A46CE71F7F55B78A5BC4D0866' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, ChannelG_30_A82BF0974E019A68C01BFA995D583348) == 0x000060, "Member 'FS_GestralRandomMaterialVariation::ChannelG_30_A82BF0974E019A68C01BFA995D583348' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, ChannelB_31_B3A470D3497AD4394F9B31889AE3A82F) == 0x000068, "Member 'FS_GestralRandomMaterialVariation::ChannelB_31_B3A470D3497AD4394F9B31889AE3A82F' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, Hair_ColorDown_36_43F3B129442AFB442BD29E9271868B53) == 0x000070, "Member 'FS_GestralRandomMaterialVariation::Hair_ColorDown_36_43F3B129442AFB442BD29E9271868B53' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, Hair_ColorTop_37_775867604FCFD4357C2D63B09CCDE3AB) == 0x000080, "Member 'FS_GestralRandomMaterialVariation::Hair_ColorTop_37_775867604FCFD4357C2D63B09CCDE3AB' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, Mask_AlphaTexture_47_CA37BE3C4D7F5E102D1F2AA3318E1663) == 0x000090, "Member 'FS_GestralRandomMaterialVariation::Mask_AlphaTexture_47_CA37BE3C4D7F5E102D1F2AA3318E1663' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, Mask_AlphaIntensity_46_6B0727CA49C0166E674B25912D2AB5F0) == 0x000098, "Member 'FS_GestralRandomMaterialVariation::Mask_AlphaIntensity_46_6B0727CA49C0166E674B25912D2AB5F0' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, Mask_AlphaColor_45_85FD0DD54E5F49BEF220E1BF0B5D12D6) == 0x0000A0, "Member 'FS_GestralRandomMaterialVariation::Mask_AlphaColor_45_85FD0DD54E5F49BEF220E1BF0B5D12D6' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, GradientHeight_55_AECC46FB420DA44A80C5859EC3720E91) == 0x0000B0, "Member 'FS_GestralRandomMaterialVariation::GradientHeight_55_AECC46FB420DA44A80C5859EC3720E91' has a wrong offset!");
static_assert(offsetof(FS_GestralRandomMaterialVariation, GradientHardness_56_358ADA0343DC3A006FA854A31C3370BC) == 0x0000B8, "Member 'FS_GestralRandomMaterialVariation::GradientHardness_56_358ADA0343DC3A006FA854A31C3370BC' has a wrong offset!");

}

