#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_SplineInstancesInfos

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_SplineInstancesInfos.S_SplineInstancesInfos
// 0x0058 (0x0058 - 0x0000)
struct FS_SplineInstancesInfos final
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMeshComponent_5_4613331948BA011667F3F0AF8A661A7A; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         InstanceID_6_5685A4874772BB49198220BE0A185C89;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location_9_7CB8696A4BF30FF666129F9FEE64F13D;       // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Speed_11_CC4602B148E8BAD8F077E7810BCF5F78;         // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_14_8E442FC0471D390670B8289005A234A3;      // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FS_SplineInstancesInfos) == 0x000008, "Wrong alignment on FS_SplineInstancesInfos");
static_assert(sizeof(FS_SplineInstancesInfos) == 0x000058, "Wrong size on FS_SplineInstancesInfos");
static_assert(offsetof(FS_SplineInstancesInfos, InstancedStaticMeshComponent_5_4613331948BA011667F3F0AF8A661A7A) == 0x000000, "Member 'FS_SplineInstancesInfos::InstancedStaticMeshComponent_5_4613331948BA011667F3F0AF8A661A7A' has a wrong offset!");
static_assert(offsetof(FS_SplineInstancesInfos, InstanceID_6_5685A4874772BB49198220BE0A185C89) == 0x000008, "Member 'FS_SplineInstancesInfos::InstanceID_6_5685A4874772BB49198220BE0A185C89' has a wrong offset!");
static_assert(offsetof(FS_SplineInstancesInfos, Location_9_7CB8696A4BF30FF666129F9FEE64F13D) == 0x000010, "Member 'FS_SplineInstancesInfos::Location_9_7CB8696A4BF30FF666129F9FEE64F13D' has a wrong offset!");
static_assert(offsetof(FS_SplineInstancesInfos, Speed_11_CC4602B148E8BAD8F077E7810BCF5F78) == 0x000028, "Member 'FS_SplineInstancesInfos::Speed_11_CC4602B148E8BAD8F077E7810BCF5F78' has a wrong offset!");
static_assert(offsetof(FS_SplineInstancesInfos, Rotation_14_8E442FC0471D390670B8289005A234A3) == 0x000040, "Member 'FS_SplineInstancesInfos::Rotation_14_8E442FC0471D390670B8289005A234A3' has a wrong offset!");

}

