#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMBP_GiantTotem

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SMBP_GiantTotem.SMBP_GiantTotem_C
// 0x0088 (0x0328 - 0x02A0)
class ASMBP_GiantTotem_C final : public AStaticMeshActor
{
public:
	class UStaticMeshComponent*                   StaticMesh10;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          HDA_Totem18_InstancedStaticMeshComponent_4;        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          HDA_Totem18_InstancedStaticMeshComponent_3;        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          HDA_Totem18_InstancedStaticMeshComponent_2;        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          HDA_Totem18_InstancedStaticMeshComponent_1;        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          HDA_Totem18_InstancedStaticMeshComponent_0;        // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GiantTotem_StaticMeshComponent0;                   // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SMBP_GiantTotem_C">();
	}
	static class ASMBP_GiantTotem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASMBP_GiantTotem_C>();
	}
};
static_assert(alignof(ASMBP_GiantTotem_C) == 0x000008, "Wrong alignment on ASMBP_GiantTotem_C");
static_assert(sizeof(ASMBP_GiantTotem_C) == 0x000328, "Wrong size on ASMBP_GiantTotem_C");
static_assert(offsetof(ASMBP_GiantTotem_C, StaticMesh10) == 0x0002A0, "Member 'ASMBP_GiantTotem_C::StaticMesh10' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, StaticMesh9) == 0x0002A8, "Member 'ASMBP_GiantTotem_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, StaticMesh8) == 0x0002B0, "Member 'ASMBP_GiantTotem_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, StaticMesh7) == 0x0002B8, "Member 'ASMBP_GiantTotem_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, StaticMesh6) == 0x0002C0, "Member 'ASMBP_GiantTotem_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, StaticMesh5) == 0x0002C8, "Member 'ASMBP_GiantTotem_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, StaticMesh4) == 0x0002D0, "Member 'ASMBP_GiantTotem_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, StaticMesh3) == 0x0002D8, "Member 'ASMBP_GiantTotem_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, StaticMesh2) == 0x0002E0, "Member 'ASMBP_GiantTotem_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, StaticMesh1) == 0x0002E8, "Member 'ASMBP_GiantTotem_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, StaticMesh) == 0x0002F0, "Member 'ASMBP_GiantTotem_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, HDA_Totem18_InstancedStaticMeshComponent_4) == 0x0002F8, "Member 'ASMBP_GiantTotem_C::HDA_Totem18_InstancedStaticMeshComponent_4' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, HDA_Totem18_InstancedStaticMeshComponent_3) == 0x000300, "Member 'ASMBP_GiantTotem_C::HDA_Totem18_InstancedStaticMeshComponent_3' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, HDA_Totem18_InstancedStaticMeshComponent_2) == 0x000308, "Member 'ASMBP_GiantTotem_C::HDA_Totem18_InstancedStaticMeshComponent_2' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, HDA_Totem18_InstancedStaticMeshComponent_1) == 0x000310, "Member 'ASMBP_GiantTotem_C::HDA_Totem18_InstancedStaticMeshComponent_1' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, HDA_Totem18_InstancedStaticMeshComponent_0) == 0x000318, "Member 'ASMBP_GiantTotem_C::HDA_Totem18_InstancedStaticMeshComponent_0' has a wrong offset!");
static_assert(offsetof(ASMBP_GiantTotem_C, GiantTotem_StaticMeshComponent0) == 0x000320, "Member 'ASMBP_GiantTotem_C::GiantTotem_StaticMeshComponent0' has a wrong offset!");

}

