#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "PBIK_structs.hpp"
#include "RigVM_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_98b4112951aa9cd
// 0x0500 (0x0500 - 0x0000)
struct FPropertyBag_98b4112951aa9cd final
{
public:
	struct FVector                                RigVMModel___FootTrace_Offset;                     // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_MathVectorAdd_Result;        // 0x0018(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             FootTrace___FootTrace_GetTransform_Transform;      // 0x0030(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FootTrace___FootTrace_GetTransform_CachedIndex;    // 0x0090(0x0010)(Edit)
	float                                         FootTrace___FootTrace_MathFloatAdd_Result;         // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace___FootTrace_MathFloatAdd_A;              // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FootTrace___FootTrace_GetTransform_1_Transform;    // 0x00B0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FootTrace___FootTrace_GetTransform_1_CachedIndex;  // 0x0110(0x0010)(Edit)
	struct FVector                                FootTrace___FootTrace_MathVectorAdd_A__IO;         // 0x0120(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_MathVectorSub_Result;        // 0x0138(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_MathVectorSub_A__IO;         // 0x0150(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace___FootTrace_SphereTraceByTraceChannel_bHit; // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTrace___FootTrace_SphereTraceByTraceChannel_HitNormal; // 0x0170(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  FootTrace___FootTrace_SphereTraceByTraceChannel_WorkData; // 0x0188(0x0010)(Edit)
	struct FVector                                RigVMModel___FootTrace_1_Offset;                   // 0x0198(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace_1___FootTrace_MathVectorAdd_Result;      // 0x01B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C8[0x8];                                      // 0x01C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FootTrace_1___FootTrace_GetTransform_Transform;    // 0x01D0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FootTrace_1___FootTrace_GetTransform_CachedIndex;  // 0x0230(0x0010)(Edit)
	float                                         FootTrace_1___FootTrace_MathFloatAdd_Result;       // 0x0240(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace_1___FootTrace_MathFloatAdd_A;            // 0x0244(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FootTrace_1___FootTrace_GetTransform_1_Transform;  // 0x0250(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FootTrace_1___FootTrace_GetTransform_1_CachedIndex; // 0x02B0(0x0010)(Edit)
	struct FVector                                FootTrace_1___FootTrace_MathVectorAdd_A__IO;       // 0x02C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace_1___FootTrace_MathVectorSub_Result;      // 0x02D8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace_1___FootTrace_MathVectorSub_A__IO;       // 0x02F0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace_1___FootTrace_SphereTraceByTraceChannel_bHit; // 0x0308(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTrace_1___FootTrace_SphereTraceByTraceChannel_HitNormal; // 0x0310(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  FootTrace_1___FootTrace_SphereTraceByTraceChannel_WorkData; // 0x0328(0x0010)(Edit)
	class FName                                   RigVMModel___Branch_RigVMUnitNode_BlockToRun;      // 0x0338(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_Result;                   // 0x0340(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_Value;                    // 0x0344(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_ScaleBiasClamp;           // 0x0348(0x0010)(Edit)
	float                                         RigVMModel___AlphaInterp_1_Result;                 // 0x0358(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_1_Value;                  // 0x035C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_1_ScaleBiasClamp;         // 0x0360(0x0010)(Edit)
	float                                         RigVMModel___If_Result;                            // 0x0370(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___MathFloatLess_Result;                 // 0x0374(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathFloatLess_A;                      // 0x0378(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLess_B;                      // 0x037C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___If_Condition;                         // 0x0380(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___If_True;                              // 0x0384(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___If_False;                             // 0x0388(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_ItemToModify__IO; // 0x0390(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_WorkData;        // 0x03A0(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_ItemToModify__IO; // 0x03B0(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_WorkData;      // 0x03C0(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_ItemToModify__IO; // 0x03D0(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_1_WorkData;    // 0x03E0(0x0010)(Edit)
	struct FTransform                             RigVMModel___GetTransform_Transform;               // 0x03F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_CachedIndex;             // 0x0450(0x0010)(Edit)
	struct FTransform                             RigVMModel___GetTransform_1_Transform;             // 0x0460(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_CachedIndex;           // 0x04C0(0x0010)(Edit)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__IO;                   // 0x04D0(0x0010)(Edit)
	TArray<TArray<int32>>                         RigVMModel___PBIK_EffectorSolverIndices;           // 0x04E0(0x0010)(Edit)
	TArray<struct FPBIKWorkData>                  RigVMModel___PBIK_WorkData;                        // 0x04F0(0x0010)(Edit)
};
static_assert(alignof(FPropertyBag_98b4112951aa9cd) == 0x000010, "Wrong alignment on FPropertyBag_98b4112951aa9cd");
static_assert(sizeof(FPropertyBag_98b4112951aa9cd) == 0x000500, "Wrong size on FPropertyBag_98b4112951aa9cd");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___FootTrace_Offset) == 0x000000, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___FootTrace_Offset' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_MathVectorAdd_Result) == 0x000018, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_MathVectorAdd_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_GetTransform_Transform) == 0x000030, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_GetTransform_CachedIndex) == 0x000090, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_MathFloatAdd_Result) == 0x0000A0, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_MathFloatAdd_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_MathFloatAdd_A) == 0x0000A4, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_MathFloatAdd_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_GetTransform_1_Transform) == 0x0000B0, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_GetTransform_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_GetTransform_1_CachedIndex) == 0x000110, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_GetTransform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_MathVectorAdd_A__IO) == 0x000120, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_MathVectorAdd_A__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_MathVectorSub_Result) == 0x000138, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_MathVectorSub_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_MathVectorSub_A__IO) == 0x000150, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_MathVectorSub_A__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_SphereTraceByTraceChannel_bHit) == 0x000168, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_SphereTraceByTraceChannel_bHit' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_SphereTraceByTraceChannel_HitNormal) == 0x000170, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_SphereTraceByTraceChannel_HitNormal' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace___FootTrace_SphereTraceByTraceChannel_WorkData) == 0x000188, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace___FootTrace_SphereTraceByTraceChannel_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___FootTrace_1_Offset) == 0x000198, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___FootTrace_1_Offset' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_MathVectorAdd_Result) == 0x0001B0, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_MathVectorAdd_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_GetTransform_Transform) == 0x0001D0, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_GetTransform_CachedIndex) == 0x000230, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_MathFloatAdd_Result) == 0x000240, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_MathFloatAdd_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_MathFloatAdd_A) == 0x000244, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_MathFloatAdd_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_GetTransform_1_Transform) == 0x000250, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_GetTransform_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_GetTransform_1_CachedIndex) == 0x0002B0, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_GetTransform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_MathVectorAdd_A__IO) == 0x0002C0, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_MathVectorAdd_A__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_MathVectorSub_Result) == 0x0002D8, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_MathVectorSub_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_MathVectorSub_A__IO) == 0x0002F0, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_MathVectorSub_A__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_SphereTraceByTraceChannel_bHit) == 0x000308, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_SphereTraceByTraceChannel_bHit' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_SphereTraceByTraceChannel_HitNormal) == 0x000310, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_SphereTraceByTraceChannel_HitNormal' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, FootTrace_1___FootTrace_SphereTraceByTraceChannel_WorkData) == 0x000328, "Member 'FPropertyBag_98b4112951aa9cd::FootTrace_1___FootTrace_SphereTraceByTraceChannel_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___Branch_RigVMUnitNode_BlockToRun) == 0x000338, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___Branch_RigVMUnitNode_BlockToRun' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___AlphaInterp_Result) == 0x000340, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___AlphaInterp_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___AlphaInterp_Value) == 0x000344, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___AlphaInterp_Value' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___AlphaInterp_ScaleBiasClamp) == 0x000348, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___AlphaInterp_ScaleBiasClamp' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___AlphaInterp_1_Result) == 0x000358, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___AlphaInterp_1_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___AlphaInterp_1_Value) == 0x00035C, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___AlphaInterp_1_Value' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___AlphaInterp_1_ScaleBiasClamp) == 0x000360, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___AlphaInterp_1_ScaleBiasClamp' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___If_Result) == 0x000370, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___If_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___MathFloatLess_Result) == 0x000374, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___MathFloatLess_Result' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___MathFloatLess_A) == 0x000378, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___MathFloatLess_A' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___MathFloatLess_B) == 0x00037C, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___MathFloatLess_B' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___If_Condition) == 0x000380, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___If_Condition' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___If_True) == 0x000384, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___If_True' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___If_False) == 0x000388, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___If_False' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___ModifyTransforms_ItemToModify__IO) == 0x000390, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___ModifyTransforms_ItemToModify__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___ModifyTransforms_WorkData) == 0x0003A0, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___ModifyTransforms_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___ModifyTransforms_1_ItemToModify__IO) == 0x0003B0, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___ModifyTransforms_1_ItemToModify__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___ModifyTransforms_1_WorkData) == 0x0003C0, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___ModifyTransforms_1_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___ModifyTransforms_1_1_ItemToModify__IO) == 0x0003D0, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___ModifyTransforms_1_1_ItemToModify__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___ModifyTransforms_1_1_WorkData) == 0x0003E0, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___ModifyTransforms_1_1_WorkData' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___GetTransform_Transform) == 0x0003F0, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___GetTransform_CachedIndex) == 0x000450, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___GetTransform_1_Transform) == 0x000460, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___GetTransform_1_Transform' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___GetTransform_1_CachedIndex) == 0x0004C0, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___GetTransform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___PBIK_Effectors__IO) == 0x0004D0, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___PBIK_Effectors__IO' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___PBIK_EffectorSolverIndices) == 0x0004E0, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___PBIK_EffectorSolverIndices' has a wrong offset!");
static_assert(offsetof(FPropertyBag_98b4112951aa9cd, RigVMModel___PBIK_WorkData) == 0x0004F0, "Member 'FPropertyBag_98b4112951aa9cd::RigVMModel___PBIK_WorkData' has a wrong offset!");

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosDestructionEvent_SWC) == 0x000004, "Wrong alignment on FChaosDestructionEvent_SWC");
static_assert(sizeof(FChaosDestructionEvent_SWC) == 0x000044, "Wrong size on FChaosDestructionEvent_SWC");
static_assert(offsetof(FChaosDestructionEvent_SWC, position) == 0x000000, "Member 'FChaosDestructionEvent_SWC::position' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Normal) == 0x00000C, "Member 'FChaosDestructionEvent_SWC::Normal' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Velocity) == 0x000018, "Member 'FChaosDestructionEvent_SWC::Velocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, AngularVelocity) == 0x000024, "Member 'FChaosDestructionEvent_SWC::AngularVelocity' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMin) == 0x000030, "Member 'FChaosDestructionEvent_SWC::ExtentMin' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ExtentMax) == 0x000034, "Member 'FChaosDestructionEvent_SWC::ExtentMax' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, ParticleID) == 0x000038, "Member 'FChaosDestructionEvent_SWC::ParticleID' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Time) == 0x00003C, "Member 'FChaosDestructionEvent_SWC::Time' has a wrong offset!");
static_assert(offsetof(FChaosDestructionEvent_SWC, Type) == 0x000040, "Member 'FChaosDestructionEvent_SWC::Type' has a wrong offset!");

// PropertyBag Transient.PropertyBag_c83821d998262d01
// 0x0230 (0x0230 - 0x0000)
struct FPropertyBag_c83821d998262d01 final
{
public:
	struct FRigElementKey                         RigVMModel___SetRotation_2_Item__Const;            // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SetRotation_2_Space__Const;           // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SetRotation_2_bInitial__Const;        // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_6_Item__Const;           // 0x0010(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetTransform_6_1_bInitial__Const;     // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___MathQuaternionSwingTwist_TwistAxis__Const; // 0x0020(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_2_B__Const;       // 0x0040(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_2_T__Const;       // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SetRotation_2_Weight__Const;          // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_Item__Const;          // 0x0068(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_T__Const;         // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SetTranslation_Space__Const;          // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_1_Item__Const;           // 0x007C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathTransformLerp_T__Const;           // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_1_Item__Const;        // 0x008C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_T__Const;       // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathTransformLerp_1_T__Const;         // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_2_Item__Const;        // 0x00A0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_2_3_T__Const;     // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_Item__Const;            // 0x00B0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_5_1_Item__Const;         // 0x00BC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_4_T__Const;       // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_Item__Const;              // 0x00CC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_2_Item__Const;          // 0x00D8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_6_3_Item__Const;         // 0x00E4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_Item__Const;        // 0x00F0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_Item__Const;         // 0x00FC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_1_Item__Const;      // 0x0108(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_1_1_Item__Const;    // 0x0114(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_1_1_1_Item__Const;  // 0x0120(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_6_5_Item__Const;         // 0x012C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_1_1_1_1_Item__Const; // 0x0138(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_2_1_Item__Const;        // 0x0144(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_6_3_1_Item__Const;       // 0x0150(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_2_2_T__Const;     // 0x015C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_2_Item__Const;      // 0x0160(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_2_Item__Const;         // 0x016C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_Item__Const;            // 0x0178(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_2_1_Item__Const;    // 0x0184(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_2_1_1_Item__Const;  // 0x0190(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_6_3_1_2_Item__Const;     // 0x019C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_2_1_1_1_Item__Const; // 0x01A8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_2_1_1_Item__Const;      // 0x01B4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_6_3_1_3_Item__Const;     // 0x01C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_3_2_2_Item__Const;    // 0x01CC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_2_1_Item__Const;       // 0x01D8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_1_Item__Const;          // 0x01E4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_2_Item__Const;          // 0x01F0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_2_1_Item__Const;        // 0x01FC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_6_3_1_5_Item__Const;     // 0x0208(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_2_1_1_Item__Const;      // 0x0214(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTranslation_4_1_2_Item__Const;     // 0x0220(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPropertyBag_c83821d998262d01) == 0x000010, "Wrong alignment on FPropertyBag_c83821d998262d01");
static_assert(sizeof(FPropertyBag_c83821d998262d01) == 0x000230, "Wrong size on FPropertyBag_c83821d998262d01");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_Item__Const) == 0x000000, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_Space__Const) == 0x00000C, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_Space__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_bInitial__Const) == 0x00000D, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_bInitial__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_6_Item__Const) == 0x000010, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_6_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_6_1_bInitial__Const) == 0x00001C, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_6_1_bInitial__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___MathQuaternionSwingTwist_TwistAxis__Const) == 0x000020, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___MathQuaternionSwingTwist_TwistAxis__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___MathQuaternionSlerp_2_B__Const) == 0x000040, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___MathQuaternionSlerp_2_B__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___MathQuaternionSlerp_2_T__Const) == 0x000060, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___MathQuaternionSlerp_2_T__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_Weight__Const) == 0x000064, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_Weight__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_Item__Const) == 0x000068, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___MathQuaternionSlerp_T__Const) == 0x000074, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___MathQuaternionSlerp_T__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetTranslation_Space__Const) == 0x000078, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetTranslation_Space__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_1_Item__Const) == 0x00007C, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___MathTransformLerp_T__Const) == 0x000088, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___MathTransformLerp_T__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_1_Item__Const) == 0x00008C, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___MathQuaternionSlerp_1_T__Const) == 0x000098, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___MathQuaternionSlerp_1_T__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___MathTransformLerp_1_T__Const) == 0x00009C, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___MathTransformLerp_1_T__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_2_Item__Const) == 0x0000A0, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___MathQuaternionSlerp_2_3_T__Const) == 0x0000AC, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___MathQuaternionSlerp_2_3_T__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_1_Item__Const) == 0x0000B0, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_5_1_Item__Const) == 0x0000BC, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_5_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___MathQuaternionSlerp_4_T__Const) == 0x0000C8, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___MathQuaternionSlerp_4_T__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_Item__Const) == 0x0000CC, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_2_Item__Const) == 0x0000D8, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_6_3_Item__Const) == 0x0000E4, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_6_3_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_3_Item__Const) == 0x0000F0, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_3_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_1_1_Item__Const) == 0x0000FC, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_3_1_Item__Const) == 0x000108, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_3_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_3_1_1_Item__Const) == 0x000114, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_3_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_3_1_1_1_Item__Const) == 0x000120, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_3_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_6_5_Item__Const) == 0x00012C, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_6_5_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_3_1_1_1_1_Item__Const) == 0x000138, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_3_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_2_1_Item__Const) == 0x000144, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_6_3_1_Item__Const) == 0x000150, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_6_3_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___MathQuaternionSlerp_2_2_T__Const) == 0x00015C, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___MathQuaternionSlerp_2_2_T__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_3_2_Item__Const) == 0x000160, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_3_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_1_2_Item__Const) == 0x00016C, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_3_Item__Const) == 0x000178, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_3_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_3_2_1_Item__Const) == 0x000184, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_3_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_3_2_1_1_Item__Const) == 0x000190, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_3_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_6_3_1_2_Item__Const) == 0x00019C, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_6_3_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_3_2_1_1_1_Item__Const) == 0x0001A8, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_3_2_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_2_1_1_Item__Const) == 0x0001B4, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_6_3_1_3_Item__Const) == 0x0001C0, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_6_3_1_3_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_2_1_3_2_2_Item__Const) == 0x0001CC, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_2_1_3_2_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_1_2_1_Item__Const) == 0x0001D8, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_1_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_3_1_Item__Const) == 0x0001E4, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_3_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_3_2_Item__Const) == 0x0001F0, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_3_2_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_3_2_1_Item__Const) == 0x0001FC, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_3_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___GetTransform_6_3_1_5_Item__Const) == 0x000208, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___GetTransform_6_3_1_5_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetRotation_3_2_1_1_Item__Const) == 0x000214, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetRotation_3_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(FPropertyBag_c83821d998262d01, RigVMModel___SetTranslation_4_1_2_Item__Const) == 0x000220, "Member 'FPropertyBag_c83821d998262d01::RigVMModel___SetTranslation_4_1_2_Item__Const' has a wrong offset!");

// PropertyBag Transient.PropertyBag_e92315c3804419c7
// 0x0248 (0x0248 - 0x0000)
struct FPropertyBag_e92315c3804419c7 final
{
public:
	struct FRigElementKey                         RigVMModel___FootTrace_Ik_Foot_Bone__Const;        // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalVariableDefault__FootTrace_AnimatedFloorLocation__Const; // 0x0010(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_MathVectorAdd_A__Const;      // 0x0028(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          FootTrace___FootTrace_GetTransform_Space__Const;   // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace___FootTrace_GetTransform_bInitial__Const; // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootTrace___FootTrace_MathFloatAdd_B__Const;       // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         FootTrace___FootTrace_GetTransform_1_Item__Const;  // 0x0048(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTrace___FootTrace_MathVectorAdd_B__Const;      // 0x0058(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace___FootTrace_RigUnit_VisualDebugVectorItemSpace_1_bEnabled__Const; // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitVisualDebugPointMode                  FootTrace___FootTrace_RigUnit_VisualDebugVectorItemSpace_1_Mode__Const; // 0x0071(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           FootTrace___FootTrace_RigUnit_VisualDebugVectorItemSpace_1_Color__Const; // 0x0074(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace___FootTrace_RigUnit_VisualDebugVectorItemSpace_1_Thickness__Const; // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace___FootTrace_RigUnit_VisualDebugVectorItemSpace_1_Scale__Const; // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         FootTrace___FootTrace_RigUnit_VisualDebugVectorItemSpace_1_Space__Const; // 0x008C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace___FootTrace_MathVectorSub_B__Const;      // 0x0098(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitVisualDebugPointMode                  FootTrace___FootTrace_RigUnit_VisualDebugVectorItemSpace_2_Mode__Const; // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               FootTrace___FootTrace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootTrace___FootTrace_SphereTraceByTraceChannel_Radius__Const; // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitVisualDebugPointMode                  FootTrace___FootTrace_RigUnit_VisualDebugVectorItemSpace_Mode__Const; // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___FootTrace_1_Ik_Foot_Bone__Const;      // 0x00BC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace_1___FootTrace_MathVectorAdd_A__Const;    // 0x00C8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          FootTrace_1___FootTrace_GetTransform_Space__Const; // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace_1___FootTrace_GetTransform_bInitial__Const; // 0x00E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootTrace_1___FootTrace_MathFloatAdd_B__Const;     // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         FootTrace_1___FootTrace_GetTransform_1_Item__Const; // 0x00E8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTrace_1___FootTrace_MathVectorAdd_B__Const;    // 0x00F8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FootTrace_1___FootTrace_RigUnit_VisualDebugVectorItemSpace_1_bEnabled__Const; // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitVisualDebugPointMode                  FootTrace_1___FootTrace_RigUnit_VisualDebugVectorItemSpace_1_Mode__Const; // 0x0111(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           FootTrace_1___FootTrace_RigUnit_VisualDebugVectorItemSpace_1_Color__Const; // 0x0114(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace_1___FootTrace_RigUnit_VisualDebugVectorItemSpace_1_Thickness__Const; // 0x0124(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FootTrace_1___FootTrace_RigUnit_VisualDebugVectorItemSpace_1_Scale__Const; // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         FootTrace_1___FootTrace_RigUnit_VisualDebugVectorItemSpace_1_Space__Const; // 0x012C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootTrace_1___FootTrace_MathVectorSub_B__Const;    // 0x0138(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitVisualDebugPointMode                  FootTrace_1___FootTrace_RigUnit_VisualDebugVectorItemSpace_2_Mode__Const; // 0x0150(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               FootTrace_1___FootTrace_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0151(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootTrace_1___FootTrace_SphereTraceByTraceChannel_Radius__Const; // 0x0154(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitVisualDebugPointMode                  FootTrace_1___FootTrace_RigUnit_VisualDebugVectorItemSpace_Mode__Const; // 0x0158(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___VariableNode_9_Value__Const;          // 0x0160(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_Scale__Const;             // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_Bias__Const;              // 0x016C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___AlphaInterp_bMapRange__Const;         // 0x0170(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputRange                            RigVMModel___AlphaInterp_InRange__Const;           // 0x0174(0x0008)(Edit, NoDestructor)
	bool                                          RigVMModel___AlphaInterp_bInterpResult__Const;     // 0x017C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___AlphaInterp_InterpSpeedIncreasing__Const; // 0x0180(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_ItemToModify__Const; // 0x0188(0x0010)(Edit)
	EControlRigModifyBoneMode                     RigVMModel___ModifyTransforms_Mode__Const;         // 0x0198(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_ItemToModify__Const; // 0x01A0(0x0010)(Edit)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_ItemToModify__Const; // 0x01B0(0x0010)(Edit)
	class FName                                   RigVMModel___PBIK_Root__Const;                     // 0x01C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__Const;                // 0x01C8(0x0010)(Edit)
	ERigVMTransformSpace                          RigVMModel___GetTransform_Space__Const;            // 0x01D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_BoneSettings__Const;             // 0x01E0(0x0010)(Edit)
	TArray<class FName>                           RigVMModel___PBIK_ExcludedBones__Const;            // 0x01F0(0x0010)(Edit)
