#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Verso_hair_v2_skl_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Verso_hair_v2_skl_Skeleton_AnimBlueprint.Verso_hair_v2_skl_Skeleton_AnimBlueprint_C
// 0x139E0 (0x13D50 - 0x0370)
class UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0388(0x0020)()
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_40;                    // 0x03B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_39;                    // 0x0B50(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_38;                    // 0x12F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_37;                    // 0x1A90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_36;                    // 0x2230(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_35;                    // 0x29D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_34;                    // 0x3170(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_33;                    // 0x3910(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_32;                    // 0x40B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_31;                    // 0x4850(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0x4FF0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0x5790(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0x5F30(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0x66D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0x6E70(0x07A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x7610(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x7630(0x00B8)()
	uint8                                         Pad_76E8[0x8];                                     // 0x76E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x76F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x7E90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x8630(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x8DD0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x9570(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x9D10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0xA4B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0xAC50(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0xB3F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0xBB90(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0xC330(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0xCAD0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0xD270(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0xDA10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0xE1B0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0xE950(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0xF0F0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0xF890(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x10030(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x107D0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x10F70(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x11710(0x07A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x11EB0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x11ED0(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x12670(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x12E10(0x07A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x135B0(0x07A0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_062030F64C427656D11A28A91B4FBB38();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_068B59B840C8460C17AAC09DD87C5657();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_0953E8A1449A10EFDEBD42968308ECD0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_1CAE2D7F4786A62A4992619E7A63FE80();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_1ECC4376493A09DBE6C152B6D7D503F8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_2A5BD1164670A1EDDE59F7BAB807A89C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_341A1E4E4570512D1BB706B4B49A253C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_3D985EFE408C786C8F586E8D06888113();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_3F9588FA46E68B0A3CFE9F8BE9E04504();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_497E90404FE3C52E93FD9EA7B1CFB6A0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_4EC358C0422DC223DC377C97D55C5256();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_4FF8E1ED4BCD2181E059B6BF99206267();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_503D847E459F95D01050048CFB3302F1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_524605D84A16EF809EB12A89123111D5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_579F2E2E4B190774E20323B4301624B9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_5B5EC5AF4882A91F8B2FFFAC411766AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_6571ACCF44351BBFF4D12586F2381021();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_66A98B6946DA718D999271A7AE4EA885();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_67DB9B68465AFB98CC0005A2141F1BC4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_719EEB4D4D2ED76F45A56AAD74DCC288();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_71C8F325417894BE1AA06BAEA774E6C7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_72A038824B30A1BB621C68AB3CA25DE2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_76BAD5924A249678DABD2C9E733CC13E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_7A0EFBCB448079EEF0701AAB9DD417CB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_7C47B71442DB8980E367919ED0E24450();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_837D26B04C82A89A66C317BB3C0B31D9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_8D4D70D44023AB0B6B3474866ACC7E32();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_913EDBCF4FA0E77203959789824C5AAD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_9D3298BB46F898368196B5A550C9C325();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_A8AB497049626DF28B33DF85F1802792();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_B0288E0D4952B5C08E1BADA9EB0A95AA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_D4A955814BC2B6F0E6CDB29B1B4F9EC2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_DC505BE242D68AD9D4450B9C64A80158();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_DD5317304F8E89384CA48E9CBD723768();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_E0250CA040C51E68759225AE03E34960();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_E2AE72B545ABA05D529259AF722B89C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_E32529584A70D05C3219D495EF544C5F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_E56E83864C5B71F77AA5DC9D9412752A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_ECFAE8294D4E53AB0E29F28134D27119();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_ED359D2D47925D5C7AC9149078C4B2E2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint_AnimGraphNode_KawaiiPhysics_FF2A730445F4B105469F9DAA418A1C73();
	void ExecuteUbergraph_Verso_hair_v2_skl_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Verso_hair_v2_skl_Skeleton_AnimBlueprint_C">();
	}
	static class UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C) == 0x013D50, "Wrong size on UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000370, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x000388, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_40) == 0x0003B0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_40' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_39) == 0x000B50, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_39' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_38) == 0x0012F0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_38' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_37) == 0x001A90, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_37' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_36) == 0x002230, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_36' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_35) == 0x0029D0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_35' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_34) == 0x003170, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_34' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_33) == 0x003910, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_33' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_32) == 0x0040B0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_32' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_31) == 0x004850, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_31' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_30) == 0x004FF0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_30' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_29) == 0x005790, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_29' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_28) == 0x005F30, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_28' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_27) == 0x0066D0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_27' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_26) == 0x006E70, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_26' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x007610, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_LinkedInputPose) == 0x007630, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_25) == 0x0076F0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_24) == 0x007E90, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_23) == 0x008630, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_22) == 0x008DD0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_21) == 0x009570, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_20) == 0x009D10, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_19) == 0x00A4B0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_18) == 0x00AC50, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_17) == 0x00B3F0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_16) == 0x00BB90, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_15) == 0x00C330, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_14) == 0x00CAD0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_13) == 0x00D270, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_12) == 0x00DA10, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_11) == 0x00E1B0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_10) == 0x00E950, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_9) == 0x00F0F0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_8) == 0x00F890, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_7) == 0x010030, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_6) == 0x0107D0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_5) == 0x010F70, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_4) == 0x011710, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x011EB0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_3) == 0x011ED0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_2) == 0x012670, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_1) == 0x012E10, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics) == 0x0135B0, "Member 'UVerso_hair_v2_skl_Skeleton_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

