#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MM_MainMenu

#include "Basic.hpp"

#include "EModalUIResponse_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MM_MainMenu.WBP_MM_MainMenu_C
// 0x00D0 (0x0500 - 0x0430)
class UWBP_MM_MainMenu_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeToBlackNewGame;                           // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             BuildText;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_BattleTestMap;                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonBoundActionButton_C*         ClickBoundAction;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonActionBarContainer_C*        CommonActionBarContainer;                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DebugBox;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MM_LevelIcon_C*                    LevelImage;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HeadingText_C*                     LevelName;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             LevelNameGrid;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LoadGameBackgroundOverlay;                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MM_LoadScreen_C*                   LoadScreen;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimatedSwitcher*                MainMenuSwitcher;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       PlaceholderBackground;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       SettingsBackground;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_Settings_Page_C*                SettingsScreen;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MM_TitleScreen_C*                  TitleScreen;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       UsernameText;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              QuitRequested;                                     // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    SDBackToMainMenu;                                  // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    SDNewGame;                                         // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    Data_Table_Row_Handle;                             // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void UpdateUsername();
	void StopMenuMusic(double FadeOutDuration);
	void SetActiveWidgetInSwitcher(class UCommonActivatableWidget* ActivatableWidget);
	void OnSwitcherTransitionEnd();
	void OnStartGameSettingsApplied();
	void OnSettingsClicked();
	void OnQuitGameResponse(EModalUIResponse InUserResponse);
	void OnQuitClicked();
	void OnNextTickAfterSwitcherTransition();
	void OnNewGameClicked();
	void OnFadeToBlackFinished();
	void OnContinueClicked();
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_0(const struct FKey& Key);
	class FText GetBuildText();
	void ExecuteUbergraph_WBP_MM_MainMenu(int32 EntryPoint);
	void Construct();
	void BP_OnActivated();
	void BndEvt__WBP_MM_MainMenu_TitleScreen_K2Node_ComponentBoundEvent_6_OnSettingsClicked__DelegateSignature();
	void BndEvt__WBP_MM_MainMenu_TitleScreen_K2Node_ComponentBoundEvent_5_OnNewGameClicked__DelegateSignature();
	void BndEvt__WBP_MM_MainMenu_TitleScreen_K2Node_ComponentBoundEvent_4_OnContinueClicked__DelegateSignature();
	void BndEvt__WBP_MM_MainMenu_TitleScreen_K2Node_ComponentBoundEvent_2_OnQuitClicked__DelegateSignature();
	void BndEvt__WBP_MM_MainMenu_LoadScreen_K2Node_ComponentBoundEvent_7_OnBackToTitlePressed__DelegateSignature();
	void BndEvt__WBP_MM_MainMenu_LoadScreen_K2Node_ComponentBoundEvent_3_OnFocusedLevelChanged__DelegateSignature(bool IsFound, const struct FFLevelDataEntry& LevelData);
	void BndEvt__WBP_MM_MainMenu_LoadScreen_K2Node_ComponentBoundEvent_0_OnNewSlotSelected__DelegateSignature();
	void BndEvt__WBP_MM_MainMenu_ClickBoundAction_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_jRPG_MainMenu_Button_47_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BackToTitle();
	void BackToNewGame();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MM_MainMenu_C">();
	}
	static class UWBP_MM_MainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MM_MainMenu_C>();
	}
};
static_assert(alignof(UWBP_MM_MainMenu_C) == 0x000008, "Wrong alignment on UWBP_MM_MainMenu_C");
static_assert(sizeof(UWBP_MM_MainMenu_C) == 0x000500, "Wrong size on UWBP_MM_MainMenu_C");
static_assert(offsetof(UWBP_MM_MainMenu_C, UberGraphFrame) == 0x000430, "Member 'UWBP_MM_MainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, Anim_FadeToBlackNewGame) == 0x000438, "Member 'UWBP_MM_MainMenu_C::Anim_FadeToBlackNewGame' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, BuildText) == 0x000440, "Member 'UWBP_MM_MainMenu_C::BuildText' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, Button_BattleTestMap) == 0x000448, "Member 'UWBP_MM_MainMenu_C::Button_BattleTestMap' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, ClickBoundAction) == 0x000450, "Member 'UWBP_MM_MainMenu_C::ClickBoundAction' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, CommonActionBarContainer) == 0x000458, "Member 'UWBP_MM_MainMenu_C::CommonActionBarContainer' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, DebugBox) == 0x000460, "Member 'UWBP_MM_MainMenu_C::DebugBox' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, LevelImage) == 0x000468, "Member 'UWBP_MM_MainMenu_C::LevelImage' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, LevelName) == 0x000470, "Member 'UWBP_MM_MainMenu_C::LevelName' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, LevelNameGrid) == 0x000478, "Member 'UWBP_MM_MainMenu_C::LevelNameGrid' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, LoadGameBackgroundOverlay) == 0x000480, "Member 'UWBP_MM_MainMenu_C::LoadGameBackgroundOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, LoadScreen) == 0x000488, "Member 'UWBP_MM_MainMenu_C::LoadScreen' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, MainMenuSwitcher) == 0x000490, "Member 'UWBP_MM_MainMenu_C::MainMenuSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, PlaceholderBackground) == 0x000498, "Member 'UWBP_MM_MainMenu_C::PlaceholderBackground' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, SettingsBackground) == 0x0004A0, "Member 'UWBP_MM_MainMenu_C::SettingsBackground' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, SettingsScreen) == 0x0004A8, "Member 'UWBP_MM_MainMenu_C::SettingsScreen' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, TitleScreen) == 0x0004B0, "Member 'UWBP_MM_MainMenu_C::TitleScreen' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, UsernameText) == 0x0004B8, "Member 'UWBP_MM_MainMenu_C::UsernameText' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, QuitRequested) == 0x0004C0, "Member 'UWBP_MM_MainMenu_C::QuitRequested' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, SDBackToMainMenu) == 0x0004D0, "Member 'UWBP_MM_MainMenu_C::SDBackToMainMenu' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, SDNewGame) == 0x0004E0, "Member 'UWBP_MM_MainMenu_C::SDNewGame' has a wrong offset!");
static_assert(offsetof(UWBP_MM_MainMenu_C, Data_Table_Row_Handle) == 0x0004F0, "Member 'UWBP_MM_MainMenu_C::Data_Table_Row_Handle' has a wrong offset!");

}

