#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UniqueMechanicForetellState

#include "Basic.hpp"

#include "EBattleContext_structs.hpp"
#include "Engine_structs.hpp"
#include "E_UniqueMechanic_Foretell_ChargeType_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UniqueMechanicForetellState.WBP_UniqueMechanicForetellState_C
// 0x0100 (0x0408 - 0x0308)
class UWBP_UniqueMechanicForetellState_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_TwilightCharge;                               // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_SunCharge;                                    // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_MoonCharge;                                   // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               CardSizeBox;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_CardExplosion;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       MoonCard;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           MoonCardGlow;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GlowContainer_C*                   MoonChargesGlow;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MoonChargesText;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MoonOverlay;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       SunCard;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           SunCardGlow;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GlowContainer_C*                   SunChargesGlow;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SunChargesText;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SunOverlay;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           TwilightCardGlow;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TwilightChargesText;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TwilightOverlay;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UniqueMechanic_Foretell_Component_C* ForetellComponent;                                // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Height;                                            // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_FXForetell;                                    // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<E_UniqueMechanic_Foretell_ChargeType, int32> OnTwilightCharges;                             // 0x03B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void EventOnTwilightEngaged(const TMap<E_UniqueMechanic_Foretell_ChargeType, int32>& ChargeState);
	void ExecuteUbergraph_WBP_UniqueMechanicForetellState(int32 EntryPoint);
	void OnChargeChanged(E_UniqueMechanic_Foretell_ChargeType ChargeType, int32 NewValue, int32 PreviousValue, EBattleContext Reason);
	void OnTwilightDisabled();
	void OnTwilightEngaged(const TMap<E_UniqueMechanic_Foretell_ChargeType, int32>& ChargeState);
	void PreConstruct(bool IsDesignTime);
	void SetForetellComponent(class UBP_UniqueMechanic_Foretell_Component_C* ForetellComponent_0);
	void TriggerCardExplosion(E_UniqueMechanic_Foretell_ChargeType Charge);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UniqueMechanicForetellState_C">();
	}
	static class UWBP_UniqueMechanicForetellState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UniqueMechanicForetellState_C>();
	}
};
static_assert(alignof(UWBP_UniqueMechanicForetellState_C) == 0x000008, "Wrong alignment on UWBP_UniqueMechanicForetellState_C");
static_assert(sizeof(UWBP_UniqueMechanicForetellState_C) == 0x000408, "Wrong size on UWBP_UniqueMechanicForetellState_C");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, UberGraphFrame) == 0x000308, "Member 'UWBP_UniqueMechanicForetellState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, Anim_TwilightCharge) == 0x000310, "Member 'UWBP_UniqueMechanicForetellState_C::Anim_TwilightCharge' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, Anim_SunCharge) == 0x000318, "Member 'UWBP_UniqueMechanicForetellState_C::Anim_SunCharge' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, Anim_MoonCharge) == 0x000320, "Member 'UWBP_UniqueMechanicForetellState_C::Anim_MoonCharge' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, CardSizeBox) == 0x000328, "Member 'UWBP_UniqueMechanicForetellState_C::CardSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, FX_CardExplosion) == 0x000330, "Member 'UWBP_UniqueMechanicForetellState_C::FX_CardExplosion' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, MoonCard) == 0x000338, "Member 'UWBP_UniqueMechanicForetellState_C::MoonCard' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, MoonCardGlow) == 0x000340, "Member 'UWBP_UniqueMechanicForetellState_C::MoonCardGlow' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, MoonChargesGlow) == 0x000348, "Member 'UWBP_UniqueMechanicForetellState_C::MoonChargesGlow' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, MoonChargesText) == 0x000350, "Member 'UWBP_UniqueMechanicForetellState_C::MoonChargesText' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, MoonOverlay) == 0x000358, "Member 'UWBP_UniqueMechanicForetellState_C::MoonOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, SunCard) == 0x000360, "Member 'UWBP_UniqueMechanicForetellState_C::SunCard' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, SunCardGlow) == 0x000368, "Member 'UWBP_UniqueMechanicForetellState_C::SunCardGlow' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, SunChargesGlow) == 0x000370, "Member 'UWBP_UniqueMechanicForetellState_C::SunChargesGlow' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, SunChargesText) == 0x000378, "Member 'UWBP_UniqueMechanicForetellState_C::SunChargesText' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, SunOverlay) == 0x000380, "Member 'UWBP_UniqueMechanicForetellState_C::SunOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, TwilightCardGlow) == 0x000388, "Member 'UWBP_UniqueMechanicForetellState_C::TwilightCardGlow' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, TwilightChargesText) == 0x000390, "Member 'UWBP_UniqueMechanicForetellState_C::TwilightChargesText' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, TwilightOverlay) == 0x000398, "Member 'UWBP_UniqueMechanicForetellState_C::TwilightOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, ForetellComponent) == 0x0003A0, "Member 'UWBP_UniqueMechanicForetellState_C::ForetellComponent' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, Height) == 0x0003A8, "Member 'UWBP_UniqueMechanicForetellState_C::Height' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, MID_FXForetell) == 0x0003B0, "Member 'UWBP_UniqueMechanicForetellState_C::MID_FXForetell' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanicForetellState_C, OnTwilightCharges) == 0x0003B8, "Member 'UWBP_UniqueMechanicForetellState_C::OnTwilightCharges' has a wrong offset!");

}

