#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MM_SaveSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_jRPG_PartySlot_structs.hpp"
#include "S_jRPG_CharacterDefinition_structs.hpp"
#include "S_SaveSlotMetaData_structs.hpp"
#include "FLevelDataEntry_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MM_SaveSlot.WBP_MM_SaveSlot_C.SetSlotEnabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_MM_SaveSlot_C_SetSlotEnabled final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_SaveSlot_C_SetSlotEnabled) == 0x000001, "Wrong alignment on WBP_MM_SaveSlot_C_SetSlotEnabled");
static_assert(sizeof(WBP_MM_SaveSlot_C_SetSlotEnabled) == 0x000001, "Wrong size on WBP_MM_SaveSlot_C_SetSlotEnabled");
static_assert(offsetof(WBP_MM_SaveSlot_C_SetSlotEnabled, IsEnabled) == 0x000000, "Member 'WBP_MM_SaveSlot_C_SetSlotEnabled::IsEnabled' has a wrong offset!");

// Function WBP_MM_SaveSlot.WBP_MM_SaveSlot_C.SetEmptyState
// 0x0009 (0x0009 - 0x0000)
struct WBP_MM_SaveSlot_C_SetEmptyState final
{
public:
	bool                                          IsEmpty;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_SaveSlot_C_SetEmptyState) == 0x000001, "Wrong alignment on WBP_MM_SaveSlot_C_SetEmptyState");
static_assert(sizeof(WBP_MM_SaveSlot_C_SetEmptyState) == 0x000009, "Wrong size on WBP_MM_SaveSlot_C_SetEmptyState");
static_assert(offsetof(WBP_MM_SaveSlot_C_SetEmptyState, IsEmpty) == 0x000000, "Member 'WBP_MM_SaveSlot_C_SetEmptyState::IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_SetEmptyState, Temp_byte_Variable) == 0x000001, "Member 'WBP_MM_SaveSlot_C_SetEmptyState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_SetEmptyState, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_MM_SaveSlot_C_SetEmptyState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_SetEmptyState, Temp_bool_Variable) == 0x000003, "Member 'WBP_MM_SaveSlot_C_SetEmptyState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_SetEmptyState, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_MM_SaveSlot_C_SetEmptyState::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_SetEmptyState, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_MM_SaveSlot_C_SetEmptyState::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_SetEmptyState, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_MM_SaveSlot_C_SetEmptyState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_SetEmptyState, K2Node_Select_Default) == 0x000007, "Member 'WBP_MM_SaveSlot_C_SetEmptyState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_SetEmptyState, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_MM_SaveSlot_C_SetEmptyState::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_MM_SaveSlot.WBP_MM_SaveSlot_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_MM_SaveSlot_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_SaveSlot_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_MM_SaveSlot_C_OnListItemObjectSet");
static_assert(sizeof(WBP_MM_SaveSlot_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_MM_SaveSlot_C_OnListItemObjectSet");
static_assert(offsetof(WBP_MM_SaveSlot_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_MM_SaveSlot_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_MM_SaveSlot.WBP_MM_SaveSlot_C.LoadSaveEntryData
// 0x0268 (0x0268 - 0x0000)
struct WBP_MM_SaveSlot_C_LoadSaveEntryData final
{
public:
	class UBP_SaveSlotViewItem_C*                 SaveSlotItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_SaveSlotMetaData                    local_SaveMetaData;                                // 0x0008(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMainSaveString_MainSave;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FS_SaveSlotMetaData                    CallFunc_GetSaveMetaData_MetaData;                 // 0x0048(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindLevelDataByLevelFile_Found;           // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_FindLevelDataByLevelFile_RowName;         // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFLevelDataEntry                       CallFunc_FindLevelDataByLevelFile_LevelData;       // 0x0088(0x01B0)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23B[0x5];                                      // 0x023B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Get_Elapsed_Time_As_Text_Text;            // 0x0240(0x0010)()
	class FText                                   CallFunc_AsDateTime_DateTime_ReturnValue;          // 0x0250(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_SaveSlot_C_LoadSaveEntryData) == 0x000008, "Wrong alignment on WBP_MM_SaveSlot_C_LoadSaveEntryData");
static_assert(sizeof(WBP_MM_SaveSlot_C_LoadSaveEntryData) == 0x000268, "Wrong size on WBP_MM_SaveSlot_C_LoadSaveEntryData");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, SaveSlotItem) == 0x000000, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::SaveSlotItem' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, local_SaveMetaData) == 0x000008, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::local_SaveMetaData' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, CallFunc_GetMainSaveString_MainSave) == 0x000038, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::CallFunc_GetMainSaveString_MainSave' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, CallFunc_GetSaveMetaData_MetaData) == 0x000048, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::CallFunc_GetSaveMetaData_MetaData' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, CallFunc_IsEmpty_ReturnValue) == 0x000078, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, CallFunc_FindLevelDataByLevelFile_Found) == 0x00007A, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::CallFunc_FindLevelDataByLevelFile_Found' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, CallFunc_FindLevelDataByLevelFile_RowName) == 0x00007C, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::CallFunc_FindLevelDataByLevelFile_RowName' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, CallFunc_FindLevelDataByLevelFile_LevelData) == 0x000088, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::CallFunc_FindLevelDataByLevelFile_LevelData' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, CallFunc_Greater_IntInt_ReturnValue) == 0x000238, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, Temp_byte_Variable) == 0x000239, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, Temp_byte_Variable_1) == 0x00023A, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, CallFunc_Get_Elapsed_Time_As_Text_Text) == 0x000240, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::CallFunc_Get_Elapsed_Time_As_Text_Text' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, CallFunc_AsDateTime_DateTime_ReturnValue) == 0x000250, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::CallFunc_AsDateTime_DateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, Temp_bool_Variable) == 0x000260, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_LoadSaveEntryData, K2Node_Select_Default) == 0x000261, "Member 'WBP_MM_SaveSlot_C_LoadSaveEntryData::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MM_SaveSlot.WBP_MM_SaveSlot_C.GenerateCharacterMarkers
// 0x0368 (0x0368 - 0x0000)
struct WBP_MM_SaveSlot_C_GenerateCharacterMarkers final
{
public:
	TArray<struct FS_jRPG_PartySlot>              Party;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_PartySlot                      CallFunc_Array_Get_Item;                           // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_CharacterDefinition            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0328)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CharacterMarker_C*                 CallFunc_BP_CreateEntryOfClass_ReturnValue;        // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_SaveSlot_C_GenerateCharacterMarkers) == 0x000008, "Wrong alignment on WBP_MM_SaveSlot_C_GenerateCharacterMarkers");
static_assert(sizeof(WBP_MM_SaveSlot_C_GenerateCharacterMarkers) == 0x000368, "Wrong size on WBP_MM_SaveSlot_C_GenerateCharacterMarkers");
static_assert(offsetof(WBP_MM_SaveSlot_C_GenerateCharacterMarkers, Party) == 0x000000, "Member 'WBP_MM_SaveSlot_C_GenerateCharacterMarkers::Party' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_GenerateCharacterMarkers, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_MM_SaveSlot_C_GenerateCharacterMarkers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_GenerateCharacterMarkers, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_MM_SaveSlot_C_GenerateCharacterMarkers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_GenerateCharacterMarkers, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_MM_SaveSlot_C_GenerateCharacterMarkers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_GenerateCharacterMarkers, CallFunc_Array_Get_Item) == 0x00001C, "Member 'WBP_MM_SaveSlot_C_GenerateCharacterMarkers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_GenerateCharacterMarkers, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_MM_SaveSlot_C_GenerateCharacterMarkers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_GenerateCharacterMarkers, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'WBP_MM_SaveSlot_C_GenerateCharacterMarkers::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_GenerateCharacterMarkers, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000358, "Member 'WBP_MM_SaveSlot_C_GenerateCharacterMarkers::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_GenerateCharacterMarkers, CallFunc_Add_IntInt_ReturnValue) == 0x00035C, "Member 'WBP_MM_SaveSlot_C_GenerateCharacterMarkers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_GenerateCharacterMarkers, CallFunc_BP_CreateEntryOfClass_ReturnValue) == 0x000360, "Member 'WBP_MM_SaveSlot_C_GenerateCharacterMarkers::CallFunc_BP_CreateEntryOfClass_ReturnValue' has a wrong offset!");

// Function WBP_MM_SaveSlot.WBP_MM_SaveSlot_C.ExecuteUbergraph_WBP_MM_SaveSlot
// 0x0088 (0x0088 - 0x0000)
struct WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveSlotViewItem_C*                 K2Node_DynamicCast_AsBP_Save_Slot_View_Item;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SaveSlotViewItem_C*                 K2Node_DynamicCast_AsBP_Save_Slot_View_Item_1;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetTickSpaceGeometry_ReturnValue;         // 0x0040(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue;              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot) == 0x000008, "Wrong alignment on WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot");
static_assert(sizeof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot) == 0x000088, "Wrong size on WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot");
static_assert(offsetof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot, EntryPoint) == 0x000000, "Member 'WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot, K2Node_Event_bIsExpanded) == 0x000004, "Member 'WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot, K2Node_Event_bIsSelected) == 0x000005, "Member 'WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot, CallFunc_GetListItemObject_ReturnValue) == 0x000010, "Member 'WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot, K2Node_DynamicCast_AsBP_Save_Slot_View_Item) == 0x000018, "Member 'WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot::K2Node_DynamicCast_AsBP_Save_Slot_View_Item' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot, K2Node_DynamicCast_AsBP_Save_Slot_View_Item_1) == 0x000028, "Member 'WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot::K2Node_DynamicCast_AsBP_Save_Slot_View_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot, K2Node_ComponentBoundEvent_Button) == 0x000038, "Member 'WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot, CallFunc_GetTickSpaceGeometry_ReturnValue) == 0x000040, "Member 'WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot::CallFunc_GetTickSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot, CallFunc_LocalToAbsolute_ReturnValue) == 0x000078, "Member 'WBP_MM_SaveSlot_C_ExecuteUbergraph_WBP_MM_SaveSlot::CallFunc_LocalToAbsolute_ReturnValue' has a wrong offset!");

// Function WBP_MM_SaveSlot.WBP_MM_SaveSlot_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_MM_SaveSlot_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_SaveSlot_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_MM_SaveSlot_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_MM_SaveSlot_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_MM_SaveSlot_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_MM_SaveSlot_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_MM_SaveSlot_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_MM_SaveSlot.WBP_MM_SaveSlot_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_MM_SaveSlot_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_SaveSlot_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_MM_SaveSlot_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_MM_SaveSlot_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_MM_SaveSlot_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_MM_SaveSlot_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_MM_SaveSlot_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_MM_SaveSlot.WBP_MM_SaveSlot_C.BndEvt__WBP_MM_SaveSlot_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonBaseFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MM_SaveSlot_C_BndEvt__WBP_MM_SaveSlot_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonBaseFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_SaveSlot_C_BndEvt__WBP_MM_SaveSlot_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MM_SaveSlot_C_BndEvt__WBP_MM_SaveSlot_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonBaseFocused__DelegateSignature");
static_assert(sizeof(WBP_MM_SaveSlot_C_BndEvt__WBP_MM_SaveSlot_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_MM_SaveSlot_C_BndEvt__WBP_MM_SaveSlot_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonBaseFocused__DelegateSignature");
static_assert(offsetof(WBP_MM_SaveSlot_C_BndEvt__WBP_MM_SaveSlot_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonBaseFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_MM_SaveSlot_C_BndEvt__WBP_MM_SaveSlot_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonBaseFocused__DelegateSignature::Button' has a wrong offset!");

}

