#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WheelButton_RequiredMask

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_WheelButton_RequiredMask.WBP_WheelButton_RequiredMask_C.ExecuteUbergraph_WBP_WheelButton_RequiredMask
// 0x0058 (0x0058 - 0x0000)
struct WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0010)()
};
static_assert(alignof(WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask) == 0x000008, "Wrong alignment on WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask");
static_assert(sizeof(WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask) == 0x000058, "Wrong size on WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask");
static_assert(offsetof(WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask, EntryPoint) == 0x000000, "Member 'WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask, Temp_bool_Variable) == 0x000004, "Member 'WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask, CallFunc_Less_IntInt_ReturnValue) == 0x000005, "Member 'WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask, Temp_struct_Variable) == 0x000008, "Member 'WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask, K2Node_Select_Default) == 0x000030, "Member 'WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask, CallFunc_Abs_Int_ReturnValue) == 0x000040, "Member 'WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'WBP_WheelButton_RequiredMask_C_ExecuteUbergraph_WBP_WheelButton_RequiredMask::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_WheelButton_RequiredMask.WBP_WheelButton_RequiredMask_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_WheelButton_RequiredMask_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WheelButton_RequiredMask_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_WheelButton_RequiredMask_C_PreConstruct");
static_assert(sizeof(WBP_WheelButton_RequiredMask_C_PreConstruct) == 0x000001, "Wrong size on WBP_WheelButton_RequiredMask_C_PreConstruct");
static_assert(offsetof(WBP_WheelButton_RequiredMask_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_WheelButton_RequiredMask_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

