#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SplashScreen_Epilepsy

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SplashScreen_Epilepsy.WBP_SplashScreen_Epilepsy_C.ExecuteUbergraph_WBP_SplashScreen_Epilepsy
// 0x0020 (0x0020 - 0x0000)
struct WBP_SplashScreen_Epilepsy_C_ExecuteUbergraph_WBP_SplashScreen_Epilepsy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SplashScreen_Epilepsy_C_ExecuteUbergraph_WBP_SplashScreen_Epilepsy) == 0x000008, "Wrong alignment on WBP_SplashScreen_Epilepsy_C_ExecuteUbergraph_WBP_SplashScreen_Epilepsy");
static_assert(sizeof(WBP_SplashScreen_Epilepsy_C_ExecuteUbergraph_WBP_SplashScreen_Epilepsy) == 0x000020, "Wrong size on WBP_SplashScreen_Epilepsy_C_ExecuteUbergraph_WBP_SplashScreen_Epilepsy");
static_assert(offsetof(WBP_SplashScreen_Epilepsy_C_ExecuteUbergraph_WBP_SplashScreen_Epilepsy, EntryPoint) == 0x000000, "Member 'WBP_SplashScreen_Epilepsy_C_ExecuteUbergraph_WBP_SplashScreen_Epilepsy::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SplashScreen_Epilepsy_C_ExecuteUbergraph_WBP_SplashScreen_Epilepsy, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_SplashScreen_Epilepsy_C_ExecuteUbergraph_WBP_SplashScreen_Epilepsy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SplashScreen_Epilepsy_C_ExecuteUbergraph_WBP_SplashScreen_Epilepsy, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_SplashScreen_Epilepsy_C_ExecuteUbergraph_WBP_SplashScreen_Epilepsy::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

