#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuffWidget_Foretell

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_BuffWidget_Foretell.WBP_BuffWidget_Foretell_C.ExecuteUbergraph_WBP_BuffWidget_Foretell
// 0x0018 (0x0018 - 0x0000)
struct WBP_BuffWidget_Foretell_C_ExecuteUbergraph_WBP_BuffWidget_Foretell final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CounterValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
static_assert(alignof(WBP_BuffWidget_Foretell_C_ExecuteUbergraph_WBP_BuffWidget_Foretell) == 0x000008, "Wrong alignment on WBP_BuffWidget_Foretell_C_ExecuteUbergraph_WBP_BuffWidget_Foretell");
static_assert(sizeof(WBP_BuffWidget_Foretell_C_ExecuteUbergraph_WBP_BuffWidget_Foretell) == 0x000018, "Wrong size on WBP_BuffWidget_Foretell_C_ExecuteUbergraph_WBP_BuffWidget_Foretell");
static_assert(offsetof(WBP_BuffWidget_Foretell_C_ExecuteUbergraph_WBP_BuffWidget_Foretell, EntryPoint) == 0x000000, "Member 'WBP_BuffWidget_Foretell_C_ExecuteUbergraph_WBP_BuffWidget_Foretell::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BuffWidget_Foretell_C_ExecuteUbergraph_WBP_BuffWidget_Foretell, K2Node_CustomEvent_CounterValue) == 0x000004, "Member 'WBP_BuffWidget_Foretell_C_ExecuteUbergraph_WBP_BuffWidget_Foretell::K2Node_CustomEvent_CounterValue' has a wrong offset!");
static_assert(offsetof(WBP_BuffWidget_Foretell_C_ExecuteUbergraph_WBP_BuffWidget_Foretell, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_BuffWidget_Foretell_C_ExecuteUbergraph_WBP_BuffWidget_Foretell::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_BuffWidget_Foretell.WBP_BuffWidget_Foretell_C.Update
// 0x0004 (0x0004 - 0x0000)
struct WBP_BuffWidget_Foretell_C_Update final
{
public:
	int32                                         CounterValue_0;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuffWidget_Foretell_C_Update) == 0x000004, "Wrong alignment on WBP_BuffWidget_Foretell_C_Update");
static_assert(sizeof(WBP_BuffWidget_Foretell_C_Update) == 0x000004, "Wrong size on WBP_BuffWidget_Foretell_C_Update");
static_assert(offsetof(WBP_BuffWidget_Foretell_C_Update, CounterValue_0) == 0x000000, "Member 'WBP_BuffWidget_Foretell_C_Update::CounterValue_0' has a wrong offset!");

}

