#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SplashScreen_SaveWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SplashScreen_SaveWarning.WBP_SplashScreen_SaveWarning_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_SplashScreen_SaveWarning_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Play;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Autosave;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Controls;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Demo;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SaveGameNotification_C*            WBP_SaveGameNotification;                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnSplashCompleted;                                 // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UpdateWidgetsVisibility();
	void PlayMainAnimation();
	void OnMainAnimationFinished();
	void ExecuteUbergraph_WBP_SplashScreen_SaveWarning(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SplashScreen_SaveWarning_C">();
	}
	static class UWBP_SplashScreen_SaveWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SplashScreen_SaveWarning_C>();
	}
};
static_assert(alignof(UWBP_SplashScreen_SaveWarning_C) == 0x000008, "Wrong alignment on UWBP_SplashScreen_SaveWarning_C");
static_assert(sizeof(UWBP_SplashScreen_SaveWarning_C) == 0x000320, "Wrong size on UWBP_SplashScreen_SaveWarning_C");
static_assert(offsetof(UWBP_SplashScreen_SaveWarning_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_SplashScreen_SaveWarning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SplashScreen_SaveWarning_C, Anim_Play) == 0x0002E8, "Member 'UWBP_SplashScreen_SaveWarning_C::Anim_Play' has a wrong offset!");
static_assert(offsetof(UWBP_SplashScreen_SaveWarning_C, VerticalBox_Autosave) == 0x0002F0, "Member 'UWBP_SplashScreen_SaveWarning_C::VerticalBox_Autosave' has a wrong offset!");
static_assert(offsetof(UWBP_SplashScreen_SaveWarning_C, VerticalBox_Controls) == 0x0002F8, "Member 'UWBP_SplashScreen_SaveWarning_C::VerticalBox_Controls' has a wrong offset!");
static_assert(offsetof(UWBP_SplashScreen_SaveWarning_C, VerticalBox_Demo) == 0x000300, "Member 'UWBP_SplashScreen_SaveWarning_C::VerticalBox_Demo' has a wrong offset!");
static_assert(offsetof(UWBP_SplashScreen_SaveWarning_C, WBP_SaveGameNotification) == 0x000308, "Member 'UWBP_SplashScreen_SaveWarning_C::WBP_SaveGameNotification' has a wrong offset!");
static_assert(offsetof(UWBP_SplashScreen_SaveWarning_C, OnSplashCompleted) == 0x000310, "Member 'UWBP_SplashScreen_SaveWarning_C::OnSplashCompleted' has a wrong offset!");

}

