#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SplashScreen_SaveWarning

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_SplashScreen_SaveWarning.WBP_SplashScreen_SaveWarning_C.UpdateWidgetsVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentPlatformConsole_CurrentPlatformIsConsole; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility) == 0x000001, "Wrong alignment on WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility");
static_assert(sizeof(WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility) == 0x000005, "Wrong size on WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility");
static_assert(offsetof(WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility, CallFunc_IsCurrentPlatformConsole_CurrentPlatformIsConsole) == 0x000003, "Member 'WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility::CallFunc_IsCurrentPlatformConsole_CurrentPlatformIsConsole' has a wrong offset!");
static_assert(offsetof(WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_SplashScreen_SaveWarning_C_UpdateWidgetsVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_SplashScreen_SaveWarning.WBP_SplashScreen_SaveWarning_C.PlayMainAnimation
// 0x0018 (0x0018 - 0x0000)
struct WBP_SplashScreen_SaveWarning_C_PlayMainAnimation final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SplashScreen_SaveWarning_C_PlayMainAnimation) == 0x000008, "Wrong alignment on WBP_SplashScreen_SaveWarning_C_PlayMainAnimation");
static_assert(sizeof(WBP_SplashScreen_SaveWarning_C_PlayMainAnimation) == 0x000018, "Wrong size on WBP_SplashScreen_SaveWarning_C_PlayMainAnimation");
static_assert(offsetof(WBP_SplashScreen_SaveWarning_C_PlayMainAnimation, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_SplashScreen_SaveWarning_C_PlayMainAnimation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SplashScreen_SaveWarning_C_PlayMainAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_SplashScreen_SaveWarning_C_PlayMainAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_SplashScreen_SaveWarning.WBP_SplashScreen_SaveWarning_C.ExecuteUbergraph_WBP_SplashScreen_SaveWarning
// 0x0004 (0x0004 - 0x0000)
struct WBP_SplashScreen_SaveWarning_C_ExecuteUbergraph_WBP_SplashScreen_SaveWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SplashScreen_SaveWarning_C_ExecuteUbergraph_WBP_SplashScreen_SaveWarning) == 0x000004, "Wrong alignment on WBP_SplashScreen_SaveWarning_C_ExecuteUbergraph_WBP_SplashScreen_SaveWarning");
static_assert(sizeof(WBP_SplashScreen_SaveWarning_C_ExecuteUbergraph_WBP_SplashScreen_SaveWarning) == 0x000004, "Wrong size on WBP_SplashScreen_SaveWarning_C_ExecuteUbergraph_WBP_SplashScreen_SaveWarning");
static_assert(offsetof(WBP_SplashScreen_SaveWarning_C_ExecuteUbergraph_WBP_SplashScreen_SaveWarning, EntryPoint) == 0x000000, "Member 'WBP_SplashScreen_SaveWarning_C_ExecuteUbergraph_WBP_SplashScreen_SaveWarning::EntryPoint' has a wrong offset!");

}

