#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MM_LoadScreen

#include "Basic.hpp"

#include "E_jRPG_YesNoQuestions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "EModalUIResponse_structs.hpp"
#include "S_SaveSlotMetaData_structs.hpp"
#include "S_SaveSlotData_structs.hpp"
#include "FLevelDataEntry_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.ShowSaveModalPopup
// 0x0060 (0x0060 - 0x0000)
struct WBP_MM_LoadScreen_C_ShowSaveModalPopup final
{
public:
	class FText                                   PopupTitle;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   PopupMessage;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	E_jRPG_YesNoQuestions                         DecisionToMake;                                    // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHoldConfirm;                                     // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModalPopup_C*                      ModalPopup;                                        // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMainSaveString_MainSave;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotIndex_SlotIndex;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModalPopup_C*                      CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_LoadScreen_C_ShowSaveModalPopup) == 0x000008, "Wrong alignment on WBP_MM_LoadScreen_C_ShowSaveModalPopup");
static_assert(sizeof(WBP_MM_LoadScreen_C_ShowSaveModalPopup) == 0x000060, "Wrong size on WBP_MM_LoadScreen_C_ShowSaveModalPopup");
static_assert(offsetof(WBP_MM_LoadScreen_C_ShowSaveModalPopup, PopupTitle) == 0x000000, "Member 'WBP_MM_LoadScreen_C_ShowSaveModalPopup::PopupTitle' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_ShowSaveModalPopup, PopupMessage) == 0x000010, "Member 'WBP_MM_LoadScreen_C_ShowSaveModalPopup::PopupMessage' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_ShowSaveModalPopup, DecisionToMake) == 0x000020, "Member 'WBP_MM_LoadScreen_C_ShowSaveModalPopup::DecisionToMake' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_ShowSaveModalPopup, IsHoldConfirm) == 0x000021, "Member 'WBP_MM_LoadScreen_C_ShowSaveModalPopup::IsHoldConfirm' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_ShowSaveModalPopup, ModalPopup) == 0x000028, "Member 'WBP_MM_LoadScreen_C_ShowSaveModalPopup::ModalPopup' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_ShowSaveModalPopup, CallFunc_GetMainSaveString_MainSave) == 0x000030, "Member 'WBP_MM_LoadScreen_C_ShowSaveModalPopup::CallFunc_GetMainSaveString_MainSave' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_ShowSaveModalPopup, CallFunc_IsActivated_ReturnValue) == 0x000040, "Member 'WBP_MM_LoadScreen_C_ShowSaveModalPopup::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_ShowSaveModalPopup, CallFunc_GetSlotIndex_SlotIndex) == 0x000044, "Member 'WBP_MM_LoadScreen_C_ShowSaveModalPopup::CallFunc_GetSlotIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_ShowSaveModalPopup, CallFunc_Create_ReturnValue) == 0x000048, "Member 'WBP_MM_LoadScreen_C_ShowSaveModalPopup::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_ShowSaveModalPopup, CallFunc_SelectString_ReturnValue) == 0x000050, "Member 'WBP_MM_LoadScreen_C_ShowSaveModalPopup::CallFunc_SelectString_ReturnValue' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.SetIsNewGameState
// 0x0018 (0x0018 - 0x0000)
struct WBP_MM_LoadScreen_C_SetIsNewGameState final
{
public:
	bool                                          IsNewGame_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0008(0x0010)()
};
static_assert(alignof(WBP_MM_LoadScreen_C_SetIsNewGameState) == 0x000008, "Wrong alignment on WBP_MM_LoadScreen_C_SetIsNewGameState");
static_assert(sizeof(WBP_MM_LoadScreen_C_SetIsNewGameState) == 0x000018, "Wrong size on WBP_MM_LoadScreen_C_SetIsNewGameState");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetIsNewGameState, IsNewGame_0) == 0x000000, "Member 'WBP_MM_LoadScreen_C_SetIsNewGameState::IsNewGame_0' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetIsNewGameState, Temp_bool_Variable) == 0x000001, "Member 'WBP_MM_LoadScreen_C_SetIsNewGameState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetIsNewGameState, K2Node_Select_Default) == 0x000008, "Member 'WBP_MM_LoadScreen_C_SetIsNewGameState::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.SetFocusedSaveSlot
// 0x02F8 (0x02F8 - 0x0000)
struct WBP_MM_LoadScreen_C_SetFocusedSaveSlot final
{
public:
	class UBP_SaveSlotViewItem_C*                 SaveSlotItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AbsolutePos;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualExactly_Vector2DVector2D_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SaveSlotMetaData                    CallFunc_GetSaveMetaData_MetaData;                 // 0x0020(0x0030)(HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetBackupSavesStrings_BackupSaves;        // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindLevelDataByLevelFile_Found;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_FindLevelDataByLevelFile_RowName;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFLevelDataEntry                       CallFunc_FindLevelDataByLevelFile_LevelData;       // 0x0070(0x01B0)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_223[0x5];                                      // 0x0223(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetMainSaveString_MainSave;               // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23B[0x1];                                      // 0x023B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetTickSpaceGeometry_ReturnValue;         // 0x023C(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              K2Node_DynamicCast_AsGrid_Slot;                    // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot) == 0x000008, "Wrong alignment on WBP_MM_LoadScreen_C_SetFocusedSaveSlot");
static_assert(sizeof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot) == 0x0002F8, "Wrong size on WBP_MM_LoadScreen_C_SetFocusedSaveSlot");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, SaveSlotItem) == 0x000000, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::SaveSlotItem' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, AbsolutePos) == 0x000008, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::AbsolutePos' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_EqualExactly_Vector2DVector2D_ReturnValue) == 0x000018, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_EqualExactly_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_GetSaveMetaData_MetaData) == 0x000020, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_GetSaveMetaData_MetaData' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_GetBackupSavesStrings_BackupSaves) == 0x000050, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_GetBackupSavesStrings_BackupSaves' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_FindLevelDataByLevelFile_Found) == 0x000064, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_FindLevelDataByLevelFile_Found' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_FindLevelDataByLevelFile_RowName) == 0x000068, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_FindLevelDataByLevelFile_RowName' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_FindLevelDataByLevelFile_LevelData) == 0x000070, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_FindLevelDataByLevelFile_LevelData' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000220, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_Not_PreBool_ReturnValue) == 0x000221, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000222, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_GetMainSaveString_MainSave) == 0x000228, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_GetMainSaveString_MainSave' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_IsEmpty_ReturnValue) == 0x000238, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_Not_PreBool_ReturnValue_1) == 0x000239, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_BooleanAND_ReturnValue) == 0x00023A, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_GetTickSpaceGeometry_ReturnValue) == 0x00023C, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_GetTickSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, K2Node_DynamicCast_AsGrid_Slot) == 0x000278, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::K2Node_DynamicCast_AsGrid_Slot' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, K2Node_DynamicCast_bSuccess) == 0x000280, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_AbsoluteToLocal_ReturnValue) == 0x000288, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_AbsoluteToLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000298, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_BreakVector2D_X) == 0x0002A0, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_BreakVector2D_Y) == 0x0002A8, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, Temp_struct_Variable) == 0x0002B0, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_FClamp_ReturnValue) == 0x0002C0, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_MakeVector2D_ReturnValue) == 0x0002C8, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, Temp_bool_Variable) == 0x0002D8, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, K2Node_Select_Default) == 0x0002E0, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_BooleanOR_ReturnValue) == 0x0002F0, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedSaveSlot, CallFunc_Not_PreBool_ReturnValue_2) == 0x0002F1, "Member 'WBP_MM_LoadScreen_C_SetFocusedSaveSlot::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.SetFocusedBackUpSave
// 0x0010 (0x0010 - 0x0000)
struct WBP_MM_LoadScreen_C_SetFocusedBackUpSave final
{
public:
	class FString                                 FocusedSave;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_LoadScreen_C_SetFocusedBackUpSave) == 0x000008, "Wrong alignment on WBP_MM_LoadScreen_C_SetFocusedBackUpSave");
static_assert(sizeof(WBP_MM_LoadScreen_C_SetFocusedBackUpSave) == 0x000010, "Wrong size on WBP_MM_LoadScreen_C_SetFocusedBackUpSave");
static_assert(offsetof(WBP_MM_LoadScreen_C_SetFocusedBackUpSave, FocusedSave) == 0x000000, "Member 'WBP_MM_LoadScreen_C_SetFocusedBackUpSave::FocusedSave' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.RetrieveBackupSaveDatasIfNeeded
// 0x0060 (0x0060 - 0x0000)
struct WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SaveManager_C*                      CallFunc_GetSaveManager_SaveManager;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetBackupSavesStrings_BackupSaves;        // 0x0020(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SaveGameData_C*                     CallFunc_RetrieveSaveDataFromSlotName_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded) == 0x000008, "Wrong alignment on WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded");
static_assert(sizeof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded) == 0x000060, "Wrong size on WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, CallFunc_GetSaveManager_SaveManager) == 0x000010, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::CallFunc_GetSaveManager_SaveManager' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, CallFunc_Array_IsEmpty_ReturnValue) == 0x000018, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, CallFunc_GetBackupSavesStrings_BackupSaves) == 0x000020, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::CallFunc_GetBackupSavesStrings_BackupSaves' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, CallFunc_RetrieveSaveDataFromSlotName_ReturnValue) == 0x000050, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::CallFunc_RetrieveSaveDataFromSlotName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, CallFunc_Array_Add_ReturnValue_1) == 0x000058, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'WBP_MM_LoadScreen_C_RetrieveBackupSaveDatasIfNeeded::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.OnSaveSlotNavigated
// 0x0018 (0x0018 - 0x0000)
struct WBP_MM_LoadScreen_C_OnSaveSlotNavigated final
{
public:
	class UBP_SaveSlotViewItem_C*                 SaveSlotItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AbsolutePos;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_LoadScreen_C_OnSaveSlotNavigated) == 0x000008, "Wrong alignment on WBP_MM_LoadScreen_C_OnSaveSlotNavigated");
static_assert(sizeof(WBP_MM_LoadScreen_C_OnSaveSlotNavigated) == 0x000018, "Wrong size on WBP_MM_LoadScreen_C_OnSaveSlotNavigated");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnSaveSlotNavigated, SaveSlotItem) == 0x000000, "Member 'WBP_MM_LoadScreen_C_OnSaveSlotNavigated::SaveSlotItem' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnSaveSlotNavigated, AbsolutePos) == 0x000008, "Member 'WBP_MM_LoadScreen_C_OnSaveSlotNavigated::AbsolutePos' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.OnSaveSlotClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_MM_LoadScreen_C_OnSaveSlotClicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_LoadScreen_C_OnSaveSlotClicked) == 0x000008, "Wrong alignment on WBP_MM_LoadScreen_C_OnSaveSlotClicked");
static_assert(sizeof(WBP_MM_LoadScreen_C_OnSaveSlotClicked) == 0x000008, "Wrong size on WBP_MM_LoadScreen_C_OnSaveSlotClicked");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnSaveSlotClicked, Button) == 0x000000, "Member 'WBP_MM_LoadScreen_C_OnSaveSlotClicked::Button' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.OnNewSaveResponse
// 0x0001 (0x0001 - 0x0000)
struct WBP_MM_LoadScreen_C_OnNewSaveResponse final
{
public:
	bool                                          IsAccepted;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_LoadScreen_C_OnNewSaveResponse) == 0x000001, "Wrong alignment on WBP_MM_LoadScreen_C_OnNewSaveResponse");
static_assert(sizeof(WBP_MM_LoadScreen_C_OnNewSaveResponse) == 0x000001, "Wrong size on WBP_MM_LoadScreen_C_OnNewSaveResponse");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnNewSaveResponse, IsAccepted) == 0x000000, "Member 'WBP_MM_LoadScreen_C_OnNewSaveResponse::IsAccepted' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.OnLoadResponse
// 0x0001 (0x0001 - 0x0000)
struct WBP_MM_LoadScreen_C_OnLoadResponse final
{
public:
	bool                                          IsAccepted;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_LoadScreen_C_OnLoadResponse) == 0x000001, "Wrong alignment on WBP_MM_LoadScreen_C_OnLoadResponse");
static_assert(sizeof(WBP_MM_LoadScreen_C_OnLoadResponse) == 0x000001, "Wrong size on WBP_MM_LoadScreen_C_OnLoadResponse");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnLoadResponse, IsAccepted) == 0x000000, "Member 'WBP_MM_LoadScreen_C_OnLoadResponse::IsAccepted' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.OnLoadingErrorPopupClosed
// 0x0001 (0x0001 - 0x0000)
struct WBP_MM_LoadScreen_C_OnLoadingErrorPopupClosed final
{
public:
	EModalUIResponse                              InUserResponse;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_LoadScreen_C_OnLoadingErrorPopupClosed) == 0x000001, "Wrong alignment on WBP_MM_LoadScreen_C_OnLoadingErrorPopupClosed");
static_assert(sizeof(WBP_MM_LoadScreen_C_OnLoadingErrorPopupClosed) == 0x000001, "Wrong size on WBP_MM_LoadScreen_C_OnLoadingErrorPopupClosed");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnLoadingErrorPopupClosed, InUserResponse) == 0x000000, "Member 'WBP_MM_LoadScreen_C_OnLoadingErrorPopupClosed::InUserResponse' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.OnDeleteResponse
// 0x0001 (0x0001 - 0x0000)
struct WBP_MM_LoadScreen_C_OnDeleteResponse final
{
public:
	bool                                          IsAccepted;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_LoadScreen_C_OnDeleteResponse) == 0x000001, "Wrong alignment on WBP_MM_LoadScreen_C_OnDeleteResponse");
static_assert(sizeof(WBP_MM_LoadScreen_C_OnDeleteResponse) == 0x000001, "Wrong size on WBP_MM_LoadScreen_C_OnDeleteResponse");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnDeleteResponse, IsAccepted) == 0x000000, "Member 'WBP_MM_LoadScreen_C_OnDeleteResponse::IsAccepted' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.OnActionBarRebuild
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_MM_LoadScreen_C_OnActionBarRebuild final
{
public:
	class UWBP_CommonActionBarContainer_C*        ActionBarContainerWidget;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0038(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0010)()
	class UWBP_CommonBoundActionButton_C*         CallFunc_FindActionButtonFromButton_CommonButtonBase; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetMainSaveString_MainSave;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0088(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonBoundActionButton_C*         CallFunc_FindActionButtonFromButton_CommonButtonBase_1; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_1;               // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_LoadScreen_C_OnActionBarRebuild) == 0x000008, "Wrong alignment on WBP_MM_LoadScreen_C_OnActionBarRebuild");
static_assert(sizeof(WBP_MM_LoadScreen_C_OnActionBarRebuild) == 0x0000B0, "Wrong size on WBP_MM_LoadScreen_C_OnActionBarRebuild");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, ActionBarContainerWidget) == 0x000000, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::ActionBarContainerWidget' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, Temp_text_Variable) == 0x000008, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, Temp_text_Variable_1) == 0x000018, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, Temp_text_Variable_2) == 0x000028, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, Temp_text_Variable_3) == 0x000038, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, Temp_bool_Variable) == 0x000048, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, Temp_bool_Variable_1) == 0x000049, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, CallFunc_IsActivated_ReturnValue) == 0x00004A, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, CallFunc_IsValid_ReturnValue) == 0x00004B, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, K2Node_Select_Default) == 0x000050, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, CallFunc_FindActionButtonFromButton_CommonButtonBase) == 0x000060, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::CallFunc_FindActionButtonFromButton_CommonButtonBase' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, CallFunc_GetIsEnabled_ReturnValue) == 0x000068, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, CallFunc_GetMainSaveString_MainSave) == 0x000070, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::CallFunc_GetMainSaveString_MainSave' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, CallFunc_IsEmpty_ReturnValue) == 0x000081, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, K2Node_Select_Default_1) == 0x000088, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, CallFunc_IsValid_ReturnValue_3) == 0x000098, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, CallFunc_FindActionButtonFromButton_CommonButtonBase_1) == 0x0000A0, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::CallFunc_FindActionButtonFromButton_CommonButtonBase_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, CallFunc_IsValid_ReturnValue_4) == 0x0000A8, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_OnActionBarRebuild, CallFunc_GetIsEnabled_ReturnValue_1) == 0x0000A9, "Member 'WBP_MM_LoadScreen_C_OnActionBarRebuild::CallFunc_GetIsEnabled_ReturnValue_1' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.LoadAvailableSaves
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_MM_LoadScreen_C_LoadAvailableSaves final
{
public:
	TArray<class FString>                         local_AvailableSaves;                              // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_SaveSlotData>                Temp_wildcard_Variable;                            // 0x0018(0x0010)(ReferenceParm)
	struct FS_SaveSlotData                        CallFunc_Array_Get_Item;                           // 0x0028(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SaveSlotViewItem_C*                 CallFunc_SpawnObject_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMainSaveString_MainSave;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveManager_C*                      CallFunc_GetSaveManager_SaveManager;               // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_SaveSlotData>                CallFunc_GetSlots_SaveSlots;                       // 0x00B0(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_MM_LoadScreen_C_LoadAvailableSaves) == 0x000008, "Wrong alignment on WBP_MM_LoadScreen_C_LoadAvailableSaves");
static_assert(sizeof(WBP_MM_LoadScreen_C_LoadAvailableSaves) == 0x0000C0, "Wrong size on WBP_MM_LoadScreen_C_LoadAvailableSaves");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, local_AvailableSaves) == 0x000000, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::local_AvailableSaves' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, Temp_wildcard_Variable) == 0x000018, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, CallFunc_SpawnObject_ReturnValue) == 0x000080, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, CallFunc_GetMainSaveString_MainSave) == 0x000088, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::CallFunc_GetMainSaveString_MainSave' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, CallFunc_IsEmpty_ReturnValue) == 0x000098, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, CallFunc_Not_PreBool_ReturnValue) == 0x000099, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, CallFunc_BooleanOR_ReturnValue) == 0x0000A0, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, CallFunc_Less_IntInt_ReturnValue) == 0x0000A1, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, CallFunc_GetSaveManager_SaveManager) == 0x0000A8, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::CallFunc_GetSaveManager_SaveManager' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_LoadAvailableSaves, CallFunc_GetSlots_SaveSlots) == 0x0000B0, "Member 'WBP_MM_LoadScreen_C_LoadAvailableSaves::CallFunc_GetSlots_SaveSlots' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.GetActionBar
// 0x0030 (0x0030 - 0x0000)
struct WBP_MM_LoadScreen_C_GetActionBar final
{
public:
	class UWBP_CommonActionBarContainer_C*        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonActionBarContainer_C*        Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MM_MainMenu_C*                     CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonActionBarContainer_C*        K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_LoadScreen_C_GetActionBar) == 0x000008, "Wrong alignment on WBP_MM_LoadScreen_C_GetActionBar");
static_assert(sizeof(WBP_MM_LoadScreen_C_GetActionBar) == 0x000030, "Wrong size on WBP_MM_LoadScreen_C_GetActionBar");
static_assert(offsetof(WBP_MM_LoadScreen_C_GetActionBar, ReturnValue) == 0x000000, "Member 'WBP_MM_LoadScreen_C_GetActionBar::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_GetActionBar, Temp_bool_Variable) == 0x000008, "Member 'WBP_MM_LoadScreen_C_GetActionBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_GetActionBar, Temp_object_Variable) == 0x000010, "Member 'WBP_MM_LoadScreen_C_GetActionBar::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_GetActionBar, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000018, "Member 'WBP_MM_LoadScreen_C_GetActionBar::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_GetActionBar, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_MM_LoadScreen_C_GetActionBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_LoadScreen_C_GetActionBar, K2Node_Select_Default) == 0x000028, "Member 'WBP_MM_LoadScreen_C_GetActionBar::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MM_LoadScreen.WBP_MM_LoadScreen_C.ExecuteUbergraph_WBP_MM_LoadScreen
// 0x02B8 (0x02B8 - 0x0000)
struct WBP_MM_LoadScreen_C_ExecuteUbergraph_WBP_MM_LoadScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_YesNoQuestions                         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsAccepted)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;         // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue_1; // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0080(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0090(0x0010)()
	TDelegate<void(EModalUIResponse InUserResponse)> K2Node_CreateDelegate_OutputDelegate_6;         // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsAccepted)>              K2Node_CreateDelegate_OutputDelegate_7;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_SaveSlotViewItem_C* SaveSlotItem, const struct FVector2D& AbsolutePos)> K2Node_CreateDelegate_OutputDelegate_8; // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_YesNoQuestions                         Temp_byte_Variable_1;                              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MM_SaveSlot_C*                     K2Node_DynamicCast_AsWBP_MM_Save_Slot;             // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsAccepted_2;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModalPopup_C*                      CallFunc_ShowSaveModalPopup_ModalPopup;            // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_LatentAction_LoadGame_C*            CallFunc_GetLoadGameLatentAction_ReturnValue;      // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveManager_C*                      CallFunc_GetSaveManager_SaveManager;               // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USF_BlueprintAsyncAction*               CallFunc_WaitAsyncAction_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModalPopup_C*                      CallFunc_CreateModalPopupFromLoadingError_ModalPopup; // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSuccessful_ReturnValue;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SaveSlotViewItem_C*                 K2Node_CustomEvent_SaveSlotItem;                   // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_AbsolutePos;                    // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsAccepted_1;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
